{"1": [["info", "First Sunday after Christmas"], ["watchO", "Watchword for the week — I will recount the gracious deeds of the Lord, the praiseworthy acts of the Lord, because of all that the Lord has done for us. Isaiah 63:7"], ["dateVerse", "Sunday, January 1", "Isaiah 63:7-9", "Psalm 148", "Hebrews 2:10-18", "Matthew 2:13-23"], ["watchD", "My soul thirsts for God, for the living God. When shall I come and behold the face of God? Psalm 42:2"], ["docT", "For everyone who asks receives, and everyone who searches finds, and for everyone who knocks, the door will be opened. Matthew 7:8"], ["prayer", "Lord, thank you for the gift of curiosity, the hunger to know more of you, and the desire to grow deeper roots into the soil of your grace and love. We ask, Lord, and you respond. Amen."]], "2": [["dateVerse", "Monday, January 2", "Psalm 1", "1 Chronicles 3", "Acts 9:1–9"], ["watchD", "Is Ephraim my dear son? Is he the child I delight in? As often as I speak against him, I still remember him. Therefore I am deeply moved for him; I will surely have mercy on him, says the Lord. Jeremiah 31:20"], ["docT", "God, who is rich in mercy, out of the great love with which he loved us even when we were dead through our trespasses, made us alive together with Christ. Ephesians 2:4-5"], ["prayer", "Merciful God, we are grateful for your tenderness and patience with our failures and flaws. Help us to fix our hearts on the power of your love and the transformation it brings, as we journey with our imperfections. Amen."]], "3": [["dateVerse", "Tuesday, January 3", "Psalm 2", "1 Chronicles 4:1–23", "Acts 9:10–22"], ["watchD", "Lord, plead my cause and redeem me; revive me according to your word. Psalm 119:154 NKJV"], ["docT", "The Lord is faithful; he will strengthen you and guard you from the evil one. 2 Thessalonians 3:3"], ["prayer", "We are not alone, Lord. You stand with us and you watch over us. Help us to stand with others in their time of need. Amen."]], "4": [["dateVerse", "Wednesday, January 4", "Psalm 3", "1 Chronicles 4:24–43", "Acts 9:23–35"], ["watchD", "The angel of the Lord touched Elijah, and said, “Get up and eat, otherwise the journey will be too much for you.” 1 Kings 19:7"], ["docT", "Therefore, lift your drooping hands and strengthen your weak knees, and make straight paths for your feet. Hebrews 12:12-13"], ["prayer", "Merciful God, help us to remember that when we feel weak and are struggling, we can turn to you. Sustain us with your spirit and direct us through the day. In your name, we pray. Amen."]], "5": [["dateVerse", "Thursday, January 5", "Psalm 4", "1 Chronicles 5:1–22", "Acts 9:36–10:8"], ["watchD", "O God, from my youth you have taught me, and I still proclaim your wondrous deeds. Psalm 71:17"], ["docT", "Simeon said, “Lord, now you are letting your servant depart in peace, according to your word; for my eyes have seen your salvation which you have prepared before the face of all peoples.” Luke 2:29-31 NKJV"], ["prayer", "Abiding God, you remain a constant source of comfort in our lives. We can see where your hand has been upon us in the past and we have hope for where you will lead us. We celebrate the promises fulfilled in our lives through your grace and love for us. Amen."]], "6": [["info", "Epiphany"], ["watchO", "Watchword for the Epiphany — Arise, shine; for your light has come, and the glory of the Lord has risen upon you. Isaiah 60:1"], ["specialVerse", "Epiphany of the Lord", "Isaiah 60:1-6", "Psalm 72:1-7,10-14", "Ephesians 3:1-12", "Matthew 2:1-12"], ["dateVerse", "Friday, January 6", "Psalm 5", "1 Chronicles 5:23–6:30", "Acts 10:9–23a"], ["watchD", "Hezekiah became sick and was at the point of death. He prayed to the Lord, and he answered him and gave him a sign. But Hezekiah did not respond according to the benefit done to him for his heart was proud. 2 Chronicles 32:24-25"], ["docT", "God opposes the proud, but gives grace to the humble. 1 Peter 5:5"], ["prayer", "Give us humble hearts, gracious God, that we may see the world as you desire it to be and that we might know our place in it. In Jesus’ name, we pray. Amen."]], "7": [["dateVerse", "Saturday, January 7", "Psalm 6", "1 Chronicles 6:31–81", "Acts 10:23b–33"], ["watchD", "From the rising of the sun to its setting, the name of the Lord is to be praised. Psalm 113:3"], ["docT", "May the God of steadfastness and encouragement grant you to live in harmony with one another, in accordance with Christ Jesus, so that together you may with one voice glorify the God and Father of our Lord Jesus Christ. Romans 15:5-6"], ["prayer", "Lord, give us a spirit of cooperation and goodwill. Help us to see the pathway within our circumstance where we can journey alongside others for your glory. Amen."]], "8": [["info", "First Sunday after Epiphany"], ["watchO", "Watchword for the week — A bruised reed he will not break, and a dimly burning wick he will not quench; he will faithfully bring forth justice. Isaiah 42:3"], ["dateVerse", "Sunday, January 8", "Isaiah 42:1-9", "Psalm 29", "Acts 10:34-43", "Matthew 3:13-17"], ["watchD", "Give generously to your needy brother and do so without a grudging heart. Deuteronomy 15:10 NIV"], ["docT", "Give and it will be given to you. Luke 6:38"], ["prayer", "Lord, as you have been generous with us through the blessings of your limitless love, we pray that we may have that same generous spirit. Empower us to give freely to others in ways that would best serve them. Help us to give without judgement or fear, trusting in your providence for us all. In the name of Jesus, we pray. Amen."]], "9": [["dateVerse", "Monday, January 9", "Psalm 7:1–9", "1 Chronicles 7", "Acts 10:34–43"], ["watchD", "You shall not join hands with the wicked to act as a malicious witness. Exodus 23:1"], ["docT", "Finally, beloved, whatever is true, whatever is honorable, whatever is just, whatever is pure, whatever is pleasing, whatever is commendable, if there is any excellence and if there is anything worthy of praise, think about these things. Philippians 4:8"], ["prayer", "Rock of ages, we pray for the strength to stand with unwavering conviction for faith, love, and hope. Keep our hearts grounded in your grace while we labor for your goodness in this world. Amen."]], "10": [["dateVerse", "Tuesday, January 10", "Psalm 7:10–17", "1 Chronicles 8", "Acts 10:44–11:10"], ["watchD", "Moses said to God, “Who am I that I should go to Pharaoh, and bring the Israelites out of Egypt?” God said, “I will be with you.” Exodus 3:11-12"], ["docT", "Jesus said, “See, I am sending you out like sheep into the midst of wolves; so be wise as serpents and innocent as doves.” Matthew 10:16"], ["prayer", "Lord, you are a God who sends. You sent your Son to us that we might be forgiven and restored to you. You now send us out as agents of your grace. We do not go by our own power or strength, but by trusting in you. Amen."]], "11": [["dateVerse", "Wednesday, January 11", "Psalm 8", "1 Chronicles 9:1–34", "Acts 11:11–24"], ["watchD", "The Lord has heard my supplication, the Lord accepts my prayer. Psalm 6:9"], ["docT", "Whenever you pray, go into your room and shut the door and pray to your Father who is in secret; and your Father who sees in secret will reward you. Matthew 6:6"], ["prayer", "Lord, we thank you for your listening ear. In humility, we come to you with the burdens and concerns of our hearts, knowing that you care for us and we are not alone. We thank you for the assurance we find in this blessing. Amen."]], "12": [["dateVerse", "Thursday, January 12", "Psalm 9:1–10", "1 Chronicles 9:35–11:3", "Acts 11:25–12:5"], ["watchD", "So now, O Israel, what does the Lord your God require of you? Only to fear the Lord your God, to walk in all his ways, to love him, to serve the Lord your God with all your heart and with all your soul. Deuteronomy 10:12"], ["docT", "Whoever obeys his word, truly in this person the love of God has reached perfection. 1 John 2:5"], ["prayer", "Divine Wisdom, help us to understand that obedience to your commandments leads us on the pathway of the liberating power of your love. We pray for the strength to surrender all and put our trust in you. Amen."]], "13": [["dateVerse", "Friday, January 13", "Psalm 9:11–20", "1 Chronicles 11:4–47", "Acts 12:6–19"], ["watchD", "Do not fear, or be afraid; have I not told you from of old and declared it? You are my witnesses! Isaiah 44:8"], ["docT", "So we are ambassadors for Christ, since God is making his appeal through us; we entreat you on behalf of Christ, be reconciled to God. 2 Corinthians 5:20"], ["prayer", "Holy Redeemer, as we face the needs of the world around us, help us to be bold in our witness, loving in our service, and overflowing with hope. It is for you that we bring the good news to the nations. Amen."]], "14": [["dateVerse", "Saturday, January 14", "Psalm 10:1–11", "1 Chronicles 12", "Acts 12:20–13:7"], ["watchD", "Your eyes beheld my unformed substance. In your book were written all the days that were formed for me. Psalm 139:16"], ["docT", "Do not worry about your life. Matthew 6:25"], ["prayer", "Savior, we lay our burdens down. Lord, we trust in your providence. Clear our minds and calm our hearts as we stand on your promises for now and for eternity. Amen."]], "15": [["info", "Second Sunday after the Epiphany"], ["watchO", "Watchword for the Week — God is faithful; by him you were called into the fellowship of his Son, Jesus Christ our Lord. 1 Corinthians 1:9"], ["dateVerse", "Sunday, January 15", "Isaiah 49:1-7", "Psalm 40:1-11", "1 Corinthians 1:1-9", "John 1:29-42"], ["watchD", "To do righteousness and justice is more acceptable to the Lord than sacrifice. Proverbs 21:3"], ["docT", "For just as the body without the spirit is dead, so faith without works is also dead. James 2:26"], ["prayer", "Loving God, raise us up to do the good you would have us do. Open our eyes, ears, and hearts to those who are oppressed and marginalized. May our efforts on their behalf glorify you. We pray this, in the name of Jesus. Amen."]], "16": [["dateVerse", "Monday, January 16", "Psalm 10:12–18", "1 Chronicles 13:1–14:7", "Acts 13:8–20a"], ["watchD", "My lips will shout for joy when I sing praises to you; my soul also, which you have rescued. Psalm 71:23"], ["docT", "Joyfully give thanks to the Father, who has enabled you to share in the inheritance of the saints in the light. Colossians 1:11-12"], ["prayer", "God of constant delight, we thank you for your unlimited grace given to us. We stand with all those who have gone before us in a community of light that gives hope and healing. Amen."]], "17": [["dateVerse", "Tuesday, January 17", "Psalm 11", "1 Chronicles 14:8–15:29", "Acts 13:20b–33"], ["watchD", "I treasure your word in my heart, so that I may not sin against you. Psalm 119:11"], ["docT", "Guard the good treasure entrusted to you, with the help of the Holy Spirit living in us.2 Timothy 1:14"], ["prayer", "Eternal Word, we are grateful that you have given us knowledge of your will for us through scripture and the Holy Spirit. We pray for the wisdom and strength to live out your will daily. Amen."]], "18": [["dateVerse", "Wednesday, January 18", "Psalm 12", "1 Chronicles 16:1–36", "Acts 13:34–47"], ["watchD", "You in your mercy have led forth the people whom you have redeemed. Exodus 15:13 NKJV"], ["docT", "Christ also suffered for sins once for all, the righteous for the unrighteous, in order to bring you to God. 1 Peter 3:18"], ["prayer", "Living Redeemer, your sacrifice was for all, whether we chose to recognize you or not. Keep us among those who humbly remember and live in response to such unbelievable love. Amen."]], "19": [["dateVerse", "Thursday, January 19", "Psalm 13", "1 Chronicles 16:37–17:27", "Acts 13:48–14:7"], ["watchD", "God looks to the ends of the earth, and sees everything under the heavens. Job 28:24"], ["docT", "It is not the will of your Father in heaven that one of these little ones should be lost. Matthew 18:14"], ["prayer", "Lord, you watch over us, and that is no small thing. Help us to remember this when we are feeling alone and lost. Remind us to keep our eyes open for others who may also be feeling lost. Amen."]], "20": [["dateVerse", "Friday, January 20", "Psalm 14", "1 Chronicles 18", "Acts 14:8–20"], ["watchD", "When you make a sale to your neighbor or buy from your neighbor, you shall not cheat one another. Leviticus 25:14"], ["docT", "We intend to do what is right not only in the Lord’s sight but also in the sight of others. 2 Corinthians 8:21"], ["prayer", "God of justice, give us the wisdom and strength to act with honesty and integrity. Remind us of our responsibility to both you and our communities to hold ourselves to the highest standards of your grace. Amen."]], "21": [["dateVerse", "Saturday, January 21", "Psalm 15", "1 Chronicles 19,20", "Acts 14:21–15:5"], ["watchD", "Naked I came from my mother’s womb, and naked I will depart. Job 1:21 NIV"], ["docT", "Clothe yourselves with the Lord Jesus Christ. Romans 13:14 NIV"], ["prayer", "Lord, all the things in our lives will pass, but you will remain. Liberate us from the desire for things that really don’t matter and increase our desire for you. Amen."]], "22": [["info", "Third Sunday after Epiphany"], ["watchO", "Watchword for the week — The Lord is my light and my salvation; whom shall I fear? The Lord is the stronghold of my life; of whom shall I be afraid? Psalm 27:1"], ["dateVerse", "Sunday, January 22", "Isaiah 9:1-4", "Psalm 27:1,4-9", "1 Corinthians 1:10-18", "Matthew 4:12-23"], ["watchD", "There is none like you, O Lord; you are great, and your name is great in might. Jeremiah 10:6"], ["docT", "No one can lay any foundation other than the one that has been laid; that foundation is Jesus Christ. 1 Corinthians 3:11"], ["prayer", "Lord, keep us grounded in your love and aid us in the task of building opportunities for all to abide in your grace. Amen."]], "23": [["dateVerse", "Monday, January 23", "Psalm 16:1–6", "1 Chronicles 21:1–26", "Acts 15:6–18"], ["watchD", "Do not let me be put to shame, for I take refuge in you. Psalm 25:20"], ["docT", "The rain fell, the floods came, and the winds blew and beat on that house, but it did not fall, because it had been founded on rock. Matthew 7:25"], ["prayer", "God, your love is our shield when the troubles of life would overwhelm us. The storms will pass as you remain our rock and our foundation. Thank you, Lord, for this comfort. Amen."]], "24": [["dateVerse", "Tuesday, January 24", "Psalm 16:7–11", "1 Chronicles 21:27–22:19", "Acts 15:19–31"], ["watchD", "You have made the Most High your dwelling-place. Psalm 91:9"], ["docT", "Jesus said, “Do not let your hearts be troubled. Believe in God, believe also in me.” John 14:1"], ["prayer", "God of glory, we place our trust in you. Regardless of the challenges and circumstance of each day, help us stand on the promises of your love for us. In Jesus’ name, we pray. Amen. "]], "25": [["dateVerse", "Wednesday, January 25", "Psalm 17:1–7", "1 Chronicles 23", "Acts 15:32–16:3"], ["watchD", "Whoever is steadfast in righteousness will live, but whoever pursues evil will die. Proverbs 11:19"], ["docT", "Blessed are those who hunger and thirst for righteousness, for they will be filled. Matthew 5:6"], ["prayer", "Lord, we hunger for so many things when our greatest hunger should be for you. Give us the desire to labor for justice and righteousness in the face of the injustices we see all around us. Amen."]], "26": [["dateVerse", "Thursday, January 26", "Psalm 17:8–15", "1 Chronicles 24", "Acts 16:4–15"], ["watchD", "You have put gladness in my heart more than when their grain and wine abound. Psalm 4:7"], ["docT", "The kingdom of God is not food and drink but righteousness and peace and joy in the Holy Spirit. Romans 14:17"], ["prayer", "God, fill our hearts with your Holy Spirit; sustain us with your power and strengthen our work for justice and peace in this world. Amen."]], "27": [["dateVerse", "Friday, January 27", "Psalm 18:1–6", "1 Chronicles 25", "Acts 16:16–29"], ["watchD", "The righteous are like trees planted by streams of water, which yield their fruit in its season, and their leaves do not wither. Psalm 1:3"], ["docT", "Paul wrote: This is my prayer, that your love may abound more and more in knowledge and depth of insight, filled with the fruit of righteousness that comes through Jesus Christ—to the glory and praise of God. Philippians 1:9,11 NIV"], ["prayer", "Creator, we pray that the seeds of love you plant in us will grow, not just for our benefit, but so that we may serve others. May your love overflow from our lives and touch all who are in need. Amen."]], "28": [["dateVerse", "Saturday, January 28", "Psalm 18:7–15", "1 Chronicles 26", "Acts 16:30–17:3"], ["watchD", "David said to the Philistine, “You come to me with sword and spear and javelin; but I come to you in the name of the Lord of hosts.” 1 Samuel 17:45"], ["docT", "Do not conform to the pattern of this world. Romans 12:2 NIV"], ["prayer", "Source of justice, strengthen us to face the challenges of this day empowered by your transforming love. We ask for boldness to speak and act in hope against the violence, fear, and anxiety that harms us all. In Jesus’ name, we pray. Amen."]], "29": [["info", "Fourth Sunday after Epiphany"], ["watchO", "Watchword for the week — For the message about the cross is foolishness to those who are perishing, but to us who are being saved it is the power of God. 1 Corinthians 1:18"], ["dateVerse", "Sunday, January 29", "Micah 6:1-8", "Psalm 15", "1 Corinthians 1:18-31", "Matthew 5:1-12"], ["watchD", "Restore us, O Lord God of hosts; let your face shine, that we may be saved. Psalm 80:19"], ["docT", "By the tender mercy of our God, the dawn from on high will break upon us, to give light to those who sit in darkness. Luke 1:78-79"], ["prayer", "Light of the world, empower us to carry your light to all. Make us beacons of love and encouragement, filled with patience and humility as we serve the world around us. In Jesus’ name, we pray. Amen."]], "30": [["dateVerse", "Monday, January 30", "Psalm 18:16–24", "1 Chronicles 27", "Acts 17:4–15"], ["watchD", "The Lord our God protected us along all the way that we went. Joshua 24:17"], ["docT", "And remember, I am with you always, to the end of the age. Matthew 28:20"], ["prayer", "God of all comfort, no matter what our circumstances may be, you remain faithful to us. Thank you for your abiding presence throughout our journey of life and faith. Amen."]], "31": [["dateVerse", "Tuesday, January 31", "Psalm 18:25–29", "1 Chronicles 28,29", "Acts 17:16–28"], ["watchD", "God, you remain the same, and your years will never end. Psalm 102:27 NIV"], ["docT", "Grace to you and peace from him who is and who was and who is to come. Revelation 1:4"], ["prayer", "Rock of ages, we are so grateful because, in the storms of our lives and the tumult of our times, you remain the same. It is on you we stand secure and know peace. In Jesus’ name, we pray. Amen."]], "32": [["dateVerse", "Wednesday, February 1", "Psalm 18:30–36", "2 Chronicles 1,2", "Acts 17:29–18:7"], ["watchD", "Return to me, says the Lord of hosts, and I will return to you. Zechariah 1:3"], ["docT", "The Lord is patient with you, not wanting any to perish, but all to come to repentance. 2 Peter 3:9"], ["prayer", "O Gracious King, our sins are many and we sometimes stray, yet your patience with us knows no bounds. As you call us to return, may we come to you with repentance and the hope for everlasting life. In your name, we pray. Amen."]], "33": [["dateVerse", "Thursday, February 2", "Psalm 18:37–45", "2 Chronicles 3:1–5:1", "Acts 18:8–21"], ["watchD", "I am watching over my word to perform it. Jeremiah 1:12"], ["docT", "Jesus said, “Do not think that I have come to abolish the law or the prophets; I have come not to abolish but to fulfill.” Matthew 5:17"], ["prayer", "Loving Master, over the millennia your sons and daughters told us of your power and love. You gave us laws to live by and the words of your prophets told of glories to come. We rejoice that those words have been fulfilled in the sacrifice of your Son. In His name, we give you thanks. Amen."]], "34": [["dateVerse", "Friday, February 3", "Psalm 18:46–50", "2 Chronicles 5:2–6:23", "Acts 18:22–19:5"], ["watchD", "You turn things upside down! Shall the potter be regarded as the clay? Shall the thing made say of its maker, “He did not make me”; or the thing formed say of the one who formed it, “He has no understanding?” Isaiah 29:16"], ["docT", "We are what he has made us, created in Christ Jesus for good works. Ephesians 2:10"], ["prayer", "Heavenly Potter, we know you brought us into the world to do your will, yet there are times when we question the source of our being.  Help us to understand that you alone are the true power behind our lives, and that those lives are to be lived in your service. In your name, we pray. Amen."]], "35": [["dateVerse", "Saturday, February 4", "Psalm 19:1–6", "2 Chronicles 6:24–7:22", "Acts 19:6–20"], ["watchD", "Jacob made a vow, saying to God, “Of all that you give me I will surely give one-tenth to you.” Genesis 28:20,22"], ["docT", "The one who sows sparingly will also reap sparingly, and the one who sows bountifully will also reap bountifully. 2 Corinthians 9:6"], ["prayer", "Faithful Gardener, you bestow upon us the unimaginable bounty of your love. All that we are, we owe to you. May we, in turn, give generously of ourselves to bring about your kingdom. Help us to grow, Lord, and help us to sow your love always. Amen."]], "36": [["info", "Fifth Sunday after Epiphany"], ["watchO", "Watchword for the week — For I decided to know nothing among you except Jesus Christ, and him crucified. 1 Corinthians 2:2"], ["dateVerse", "Sunday, February 5", "Isaiah 58:1-9a,(9b-12)", "Psalm 112:1-9,(10)", "1 Corinthians 2:1-12,(13-16)", "Matthew 5:13-20"], ["watchD", "When times are good, be happy; but when times are bad, consider this: God has made the one as well as the other. Therefore, no one can discover anything about their future. Ecclesiastes 7:14 NIV"], ["docT", "Look at the birds of the air; they neither sow nor reap nor gather into barns, and yet your heavenly Father feeds them. Are you not of more value than they? Matthew 6:26"], ["prayer", "Divine Creator, you make and care for all we know, yet much about you is unknowable. Give us strength during those times when we fail to understand your mystery, and help us know that no matter what, you feed us with your love. In your name, we pray. Amen. "]], "37": [["dateVerse", "Monday, February 6", "Psalm 19:7–14", "2 Chronicles 8:1–9:12", "Acts 19:21–31"], ["watchD", "The heart is devious above all else; it is perverse—who can understand it? I the Lord test the mind and search the heart, to give to all according to their ways. Jeremiah 17:9-10"], ["docT", "So let us not grow weary in doing what is right, for we will reap at harvest time, if we do not give up. Galatians 6:9"], ["prayer", "Holy Teacher, you test our minds and search our hearts for the good we can offer the world. Help us grow that good, never surrender to evil or sloth, and endeavor to love you with all of our hearts, our souls, and our minds.  Amen."]], "38": [["dateVerse", "Tuesday, February 7", "Psalm 20", "2 Chronicles 9:13–10:19", "Acts 19:32–20:3"], ["watchD", "As the rain and the snow come down from heaven, and do not return there until they have watered the earth, making it bring forth and sprout, giving seed to the sower and bread to the eater, so shall my word be that goes out from my mouth. Isaiah 55:10-11"], ["docT", "If you abide in me, and my words abide in you, ask for whatever you wish, and it will be done for you. My Father is glorified by this, that you bear much fruit and become my disciples. John 15:7-8"], ["prayer", "Generous Provider, you give us all we need to grow in faith, love, and hope. We are sustained by your heavenly waters and the love of your Son, who rescues us from darkness and sin. May our words and deeds bear fruit by bringing those in need to you. In Jesus’ name, we pray. Amen. "]], "39": [["dateVerse", "Wednesday, February 8", "Psalm 21", "2 Chronicles 11:1–12:12", "Acts 20:4–16"], ["watchD", "Our heart is glad in the Lord, because we trust in his holy name. Psalm 33:21"], ["docT", "Rejoice always, pray without ceasing. 1 Thessalonians 5:16-17"], ["prayer", "Rejoice, believers, rejoice! Lord, we know you as our trusting, loving, generous God, who gave us his Son so that we may be saved from hopeless sadness. We know, too, that you are with us always. May we rejoice in your holy name, for it gladdens our hearts. Amen."]], "40": [["dateVerse", "Thursday, February 9", "Psalm 22:1–8", "2 Chronicles 12:13–13:22", "Acts 20:17–31"], ["watchD", "Be silent before the Lord God! For the day of the Lord is at hand. Zephaniah 1:7"], ["docT", "Therefore you also must be ready, for the Son of Man is coming at an unexpected hour. Matthew 24:44"], ["prayer", "Holy Redeemer, we await the hour of your return with hope and anticipation. While all we do should prepare us for that day, may we also live lives that demonstrate to all that your kingdom is at hand today. With hope, we pray. Amen."]], "41": [["dateVerse", "Friday, February 10", "Psalm 22:9–21", "2 Chronicles 14,15", "Acts 20:32–21:4"], ["watchD", "How beautiful on the mountains are the feet of those who bring good news, who proclaim peace, who bring good tidings, who proclaim salvation, who say to Zion, “Your God reigns!” Isaiah 52:7 NIV"], ["docT", "As shoes for your feet put on whatever will make you ready to proclaim the gospel of peace. Ephesians 6:15"], ["prayer", "Bringer of peace, our world struggles to live in harmony. Our leaders choose war over compromise, battle over benevolence, and anger over forgiveness. Yet, if they only heard your word and walked your way, ours would be a world in unison.  We pray for peace. Amen."]], "42": [["dateVerse", "Saturday, February 11", "Psalm 22:22–28", "2 Chronicles 16,17", "Acts 21:5–16"], ["watchD", "Bring me out of prison, so that I may give thanks to your name. Psalm 142:7"], ["docT", "So if the Son makes you free, you will be free indeed. John 8:36"], ["prayer", "Loving Sustainer, many of us find ourselves prisoners of our thoughts, deeds, and longings. We thank you for giving us your son, born to break the chains that keep us from you. Help us to overcome fear and oppression and help us share your message of freedom and peace. Amen."]], "43": [["info", "Sixth Sunday after Epiphany"], ["watchO", "Watchword for the week — Choose life so that you and your descendants may live, loving the Lord your God, obeying him, and holding fast to him. Deuteronomy 30:19,20"], ["dateVerse", "Sunday, February 12", "Deuteronomy 30:15-20", "Psalm 119:1-8", "1 Corinthians 3:1-9", "Matthew 5:21-37"], ["watchD", "Take good care to love the Lord your God, to walk in all his ways. Joshua 22:5"], ["docT", "Whoever serves me must follow me, and where I am, there will my servant be also. John 12:26"], ["prayer", "Abiding Shepherd, your nearness is our joy and guide. By your presence, we receive light for our path and purpose for our lives. May our lives demonstrate our gratitude for your love and ministry to us. We long to praise you, not only with our voices, but with lives of service to your children. Amen."]], "44": [["dateVerse", "Monday, February 13", "Psalm 22:29–31", "2 Chronicles 18", "Acts 21:17–30"], ["watchD", "Do not cast me away from your presence, and do not take your holy spirit from me. Psalm 51:11"], ["docT", "The tax collector, standing far off, would not even look up to heaven, but was beating his breast and saying, “God, be merciful to me, a sinner!” Luke 18:13"], ["prayer", "Merciful God, we recognize that we are the objects of your love, not by our own doing, but by your unmerited grace. Renew us by your Spirit and hold us in your loving embrace. Draw us ever nearer to yourself that our lives might overflow with joy and gratitude for your tender mercies. Amen."]], "45": [["dateVerse", "Tuesday, February 14", "Psalm 23", "2 Chronicles 19:1–20:19", "Acts 21:31–22:2"], ["watchD", "Surely God is good to Israel, to those who are pure in heart. Psalm 73: 1 NIV"], ["docT", "Blessed are the pure in heart, for they will see God. Matthew 5:8"], ["prayer", "O God of Israel, for your temples, you have chosen neither stone nor wood. You chose our very hearts to be your dwelling place. By your spirit, may we keep our hearts pure and true—a fitting home for you. Amen."]], "46": [["dateVerse", "Wednesday, February 15", "Psalm 24", "2 Chronicles 20:20–21:17", "Acts 22:3–16"], ["watchD", "I will again do amazing things with this people, shocking and amazing. The wisdom of their wise shall perish, and the discernment of the discerning shall be hidden. Isaiah 29:14"], ["docT", "The crowd was amazed when they saw the mute speaking, the maimed whole, the lame walking, and the blind seeing. And they praised the God of Israel. Matthew 15:31"], ["prayer", "Source of wisdom and wonder, your way and wisdom are higher and truer than anything we could devise. The works of your creative hands and your transforming touch overwhelm us with wonder and adoration. May your living word be our only wisdom, and the works of your hands be our constant inspiration. Amen."]], "47": [["dateVerse", "Thursday, February 16", "Psalm 25:1–7", "2 Chronicles 21:18–23:21", "Acts 22:17–29"], ["watchD", "I called to the Lord out of my distress, and he answered me. Jonah 2:2"], ["docT", "Jesus said, “Even the hairs of your head are all counted. Do not be afraid!” Luke 12:7"], ["prayer", "Merciful Deliverer, in all the challenges of our lives, you are sufficient. In our times of need, may we turn to you in confidence, trusting in your presence with us and love for us. May we live by your strength and the assurance that nothing can part us from your eternal love nor keep us from our eternal home. Amen."]], "48": [["dateVerse", "Friday, February 17", "Psalm 25:8–22", "2 Chronicles 24:1–25:4", "Acts 22:30–23:11"], ["watchD", "O Lord, how manifold are your works! In wisdom you have made them all; the earth is full of your creatures. Psalm 104:24"], ["docT", "You are worthy, our Lord and God, to receive glory and honor and power, for you created all things, and by your will they existed and were created. Revelation 4:11"], ["prayer", "Holy and almighty Creator, if we were only to open our eyes in faith, we would see your undeniable fingerprints on the galaxies in the heavens, the wonders of the earth, and the abundant forms of life in our world. Help us open our eyes to see how great you are! Amen."]], "49": [["dateVerse", "Saturday, February 18", "Psalm 26", "2 Chronicles 25:5–26:15", "Acts 23:12–24"], ["watchD", "Whom have I in heaven but you? And there is nothing on earth that I desire other than you. Psalm 73:25"], ["docT", "I am convinced that neither death, nor life, nor angels, nor rulers, nor things present, nor things to come, nor powers, nor height, nor depth, nor anything else in all creation, will be able to separate us from the love of God in Christ Jesus our Lord. Romans 8:38-39"], ["prayer", "Divine Companion, your presence in our lives may not eliminate the tough times, but no difficulty can separate us from you. You are always with us, even in the darkest of times. Even when all else may be gone, you remain. May we always turn to you for comfort, peace, and hope. Amen."]], "50": [["info", "Last Sunday after Epiphany"], ["watchO", "Watchword for the week — God said, “This is my Son, the Beloved; with him I am well pleased; listen to him!” Matthew 17:5"], ["dateVerse", "Sunday, February 19", "Exodus 24:12-18", "Psalm 2", "2 Peter 1:16-21", "Matthew 17:1-9"], ["watchD", "By day the Lord commands his steadfast love, and at night his song is with me, a prayer to the God of my life. Psalm 42:8"], ["docT", "And after Jesus had dismissed the crowds, he went up the mountain by himself to pray. When evening came, he was there alone. Matthew 14:23"], ["prayer", "O Holy One, there is nowhere that we might go where you are not already there. May we remember that you are always with us and only a prayer away. May we remember to seek you in times of silence, free from distractions, and better able to discern your presence and commune with you. Amen."]], "51": [["dateVerse", "Monday, February 20", "Psalm 27:1–6", "2 Chronicles 26:16–28:8", "Acts 23:25–24:3"], ["watchD", "“A mortal, born of woman, few of days and full of trouble, comes up like a flower and withers, flees like a shadow and does not last.” Job 14:1-2"], ["docT", "Here we have no lasting city, but we are looking for the city that is to come. Hebrews 13:14"], ["prayer", "Eternal Creator, although our days in this life are numbered, we take comfort in the assurance that, just as you have neither beginning nor ending, so your love for us never ends. May your eternal love for us empower us to look to the future with holy expectation and confidence. Amen."]], "52": [["dateVerse", "Tuesday, February 21", "Psalm 27:7–14", "2 Chronicles 28:9–29:19", "Acts 24:4–16"], ["watchD", "David said to the Lord, “I have sinned greatly in what I have done. But now, O Lord, I pray you, take away the guilt of your servant.” 2 Samuel 24:10"], ["docT", "If we confess our sins, he who is faithful and just will forgive us our sins and cleanse us from all unrighteousness. 1 John 1:9"], ["prayer", "O Lamb of God, we are an imperfect people. All have sinned and fallen short of your will. Forgive us when we have strayed: for the evil we have done and good we have left undone. Cleanse us of our sin and renew us by your love. Amen."]], "53": [["specialVerse", "Ash Wednesday", "Joel 2:1-2,12-17", "Psalm 51:1-17", "2 Corinthians 5:20b-6:10", "Matthew 6:1-6,16-21"], ["dateVerse", "Wednesday, February 22", "Psalm 28", "2 Chronicles 29:20–30:27", "Acts 24:17–27"], ["watchD", "Sing to the Lord; praise the Lord! For he has delivered the life of the needy from the hands of evildoers. Jeremiah 20:13"], ["docT", "Mary said, “My soul magnifies the Lord, and my spirit rejoices in God my Savior, for he has looked with favor on the lowliness of his servant.” Luke 1:46-48"], ["prayer", "Strong Deliverer, we begin our Lenten journey with you today. Open our hearts and our minds anew to your sacrifice for us in order that we might know that God’s love for us is limitless, with neither beginning nor end. Amen."]], "54": [["dateVerse", "Thursday, February 23", "Psalm 29", "2 Chronicles 31", "Acts 25:1–15"], ["watchD", "Turn back from your evil ways; for why will you die? Ezekiel 33:11"], ["docT", "Rescue us from the evil one. Matthew 6:13"], ["prayer", "O gracious Savior, we thank you that, in your divine mercy and grace, you have done for us what we were unable or unwilling to do for ourselves. You have called us to yourself. You have forgiven our sins, cleansed our hearts and lives, and healed us of our brokenness. Because of you, in all circumstances, we are able to sing, “It is well with my soul.” Amen."]], "55": [["dateVerse", "Friday, February 24", "Psalm 30:1–5", "2 Chronicles 32", "Acts 25:16–26:1"], ["watchD", "I will make with you an everlasting covenant. Isaiah 55:3"], ["docT", "In Christ every one of God’s promises is a “Yes.” For this reason it is through him that we say the “Amen,” to the glory of God. 2 Corinthians 1:20"], ["prayer", "Great Promise-keeper, in Jesus Christ, all of your promises and all of our hopes were fulfilled. We are loved. We are forgiven. We are saved. May our lives continue to sound forth the praise of which you are worthy. Gladly, forever, may we adore you. Amen."]], "56": [["dateVerse", "Saturday, February 25", "Psalm 30:6–12", "2 Chronicles 33:1–34:7", "Acts 26:2–14"], ["watchD", "Hear the word of the Lord, because the Lord has a charge to bring against you who live in the land: “There is no faithfulness, no love, no acknowledgment of God in the land.” Hosea 4:1 NIV"], ["docT", "If any of you is lacking in wisdom, ask God, who gives to all generously and ungrudgingly, and it will be given you. James 1:5"], ["prayer", "Great Father, how often have you looked at the fields of our lives and found no harvest. Forgive us for the fruit we have failed to bear and the weeds we have sown. We thank you that you look to us not as a judge, but as a guide. Thank you for your wisdom, for showing us the better way. Thank you for the home you have prepared, even for sinners such as us. Amen."]], "57": [["info", "First Sunday in Lent"], ["watchO", "Watchword for the week — Be glad in the Lord and rejoice, O righteous, and shout for joy, all you upright in heart. Psalm 32:11"], ["dateVerse", "Sunday, February 26", "Genesis 2:15-17", "3:1-7", "Psalm 32", "Romans 5:12-19", "Matthew 4:1-11"], ["watchD", "The Lord will keep your foot from being caught. Proverbs 3:26"], ["docT", "Jesus prayed, “I am not asking you to take them out of the world, but I ask you to protect them from the evil one.” John 17:15"], ["prayer", "Divine Protector, we thank you that you do not stand far off, keeping score of our faults. You observe us as a loving parent, anxious to prevent us from going astray and assisting us in learning the better way. Your desire is to deliver us from evil and place our feet upon the better path. Heavenly Father, we praise you for your nurturing love. Amen."]], "58": [["dateVerse", "Monday, February 27", "Psalm 31:1–5", "2 Chronicles 34:8–33", "Acts 26:15–27"], ["watchD", "The Lord is coming to judge the earth. He will judge the world with righteousness, and the peoples with equity. Psalm 98:9"], ["docT", "Lord, who will not fear and glorify your name? For you alone are holy. All nations will come and worship before you, for your judgments have been revealed. Revelation 15:4"], ["prayer", "O righteous Judge, as you weigh the nations and people of the world in the scale of your will, we are comforted that you are motivated by love for all your children with an eye toward justice and equity. May we look to your reign as an expression of your love and as a longing for the fulfillment of justice for all your children. Amen."]], "59": [["dateVerse", "Tuesday, February 28", "Psalm 31:6–9", "2 Chronicles 35", "Acts 26:28–27:8"], ["watchD", "Out of the depths I cry to you, O Lord. Lord, hear my voice! Psalm 130:1-2"], ["docT", "The blind man shouted, “Jesus, Son of David, have mercy on me!” Those who were in front sternly ordered him to be quiet; but he shouted even more loudly, “Son of David, have mercy on me!” Luke 18:38-39"], ["prayer", "O merciful Savior, too often our prayers are limited to times when we are in distress and call on you for help. May your Holy Spirit move within our hearts to call us to prayers of praise and gratitude for your goodness and blessing of our lives. Amen. "]], "60": [["info", "March 1, 1457:"], ["info", "Beginning of the Unity of the Brethren in Bohemia"], ["dateVerse", "Wednesday, March 1", "Psalm 31:10–20", "2 Chronicles 36", "Acts 27:9–20"], ["watchD", "The king said to Daniel, “Truly, your God is God of gods and Lord of kings.” Daniel 2:47"], ["docT", "Paul said, “King Agrippa, do you believe the prophets? I know that you do believe.” Then Agrippa said to Paul, “You almost persuade me to become a Christian.” Acts 26:27-28 NKJV"], ["prayer", "Lord, some days our faith is strong—some days we are only “almost persuaded.” Lord God, work to persuade us and those holding power in human affairs, that our true identity is found as creatures who are loved by you and who, in response, are serving you. Amen."]], "61": [["dateVerse", "Thursday, March 2", "Psalm 31:21–24", "Ezra 1,2", "Acts 27:21–38"], ["watchD", "The Lord said to Jacob, “Know that I am with you and will keep you wherever you go, and will bring you back to this land.” Genesis 28:15"], ["docT", "The one who calls you is faithful, and he will do this. 1 Thessalonians 5:24"], ["prayer", "Faithful One, our world is filled with unfaithfulness—in our families, in our neighborhoods, in our government, in our businesses. Help us remain faithful wherever we go. In Jesus’ name, we pray. Amen."]], "62": [["dateVerse", "Friday, March 3", "Psalm 32", "Ezra 3", "Acts 27:39–28:6"], ["watchD", "You have set my feet in a broad place. Psalm 31:8"], ["docT", "I pray that the eyes of your heart may be enlightened in order that you may know the hope to which he has called you. Ephesians 1:18 NIV"], ["prayer", "Lord of history, the psalmist and our ancestors believed all things are in your control. Perhaps we have a clearer sense of both our human powers and our human limits. Increase our confidence, that in the end, you will heal and restore your creation. Amen."]], "63": [["dateVerse", "Saturday, March 4", "Psalm 33:1–5", "Ezra 4", "Acts 28:7–16"], ["watchD", "The promises of the Lord are promises that are pure, silver refined in a furnace on the ground, purified seven times. Psalm 12:6"], ["docT", "The words that I have spoken to you are spirit and life. John 6:63"], ["prayer", "Living Fire, from you comes our life, new each day. Refine us to be better tools for your work. Burn away what stands in the way of your work. Bring the warmth of new life. Open us to your work within us and among us. Amen. "]], "64": [["info", "Second Sunday in Lent"], ["watchO", "Watchword for the week — For God so loved the world that he gave his only Son, so that everyone who believes in him may not perish but may have eternal life. John 3:16"], ["dateVerse", "Sunday, March 5", "Genesis 12:1-4a", "Psalm 121", "Romans 4:1-5,13-17", "John 3:1-17"], ["watchD", "The Lord spoke and it came to be; he commanded, and it stood firm. Psalm 33:9"], ["docT", "The centurion answered, “Lord, I am not worthy to have you come under my roof; but only speak the word, and my servant will be healed.” Matthew 8:8"], ["prayer", "“Make me a captive, Lord, and then I shall be free.” What a seeming contradiction! What a promise! We are at our best, not when we are alone, but when we are connected both to you and to one another. Lord, capture us. Amen."]], "65": [["dateVerse", "Monday, March 6", "Psalm 33:6–11", "Ezra 5:1–6:12", "Acts 28:17–31"], ["watchD", "Thus said the Lord of hosts, “Truly, one who touches you touches the apple of my eye.” Zechariah 2:8"], ["docT", "Just as you did it to one of the least of these who are members of my family, you did it to me. Matthew 25:40"], ["prayer", "Creator of the universe, it is amazing that we mortal creatures—every one of us—are precious to you. Even more, you tell us that we meet you through one another. Plant and nurture in us the faith to believe and to live by those amazing truths. Amen."]], "66": [["dateVerse", "Tuesday, March 7", "Psalm 33:12–22", "Ezra 6:13–7:28", "Romans 1:1–12"], ["watchD", "The Lord our God may not leave us or abandon us. 1 Kings 8:57"], ["docT", "May the Lord direct your hearts to the love of God and to the steadfastness of Christ. 2 Thessalonians 3:5"], ["prayer", "Faithful One, so many in our world feel abandoned and forgotten. When we are tempted to abandon or forget those in need, whether near or far away, we remember the love of parents for their children, a gift that reflects your faithfulness, and we give you thanks. Amen."]], "67": [["dateVerse", "Wednesday, March 8", "Psalm 34:1–7", "Ezra 8:1–20", "Romans 1:13–25"], ["watchD", "O land, land, land, hear the word of the Lord! Jeremiah 22:29"], ["docT", "What you hear in the ear, preach on the housetops. Matthew 10:27 NKJV"], ["prayer", "Welcoming God, we all want a home, a place that is ours, that we can find on a map. But the scattering of friends and family reminds us of what has always been true: our only real home is in you. May we live by this, and be people who welcome and who heal. Amen."]], "68": [["dateVerse", "Thursday, March 9", "Psalm 34:8–18", "Ezra 8:21–10:6", "Romans 1:26–2:4"], ["watchD", "The Lord your God has been with you; you have lacked nothing. Deuteronomy 2:7"], ["docT", "Jesus said to his disciples, “When I sent you out without a purse, bag, or sandals, did you lack anything?” They said, “No, not a thing.” Luke 22:35"], ["prayer", "Our Strength and Motivation, so much in the world needs to be replaced or fixed that we are overwhelmed. Lead us to some corner of life where, empowered by you, we may make a real difference and get a glimpse of your kingdom. Amen."]], "69": [["dateVerse", "Friday, March 10", "Psalm 34:19–22", "Ezra 10:7–44", "Romans 2:5–16"], ["watchD", "He who keeps Israel will neither slumber nor sleep. Psalm 121:4"], ["docT", "Cast all your anxiety on him, because he cares for you. 1 Peter 5:7"], ["prayer", "Ever-present Help and Stay, we tire; we grow weary; we want to rest. Give us the strength to live well this day and serve you faithfully this day. In Jesus’ name, we pray. Amen."]], "70": [["dateVerse", "Saturday, March 11", "Psalm 35:1–10", "Nehemiah 1:1–2:10", "Romans 2:17–3:2"], ["watchD", "Moses said, “See, I am setting before you today a blessing and a curse: the blessing, if you obey the commandments of the Lord your God that I am commanding you today; and the curse, if you do not obey the commandments of the Lord your God.” Deuteronomy 11:26-28"], ["docT", "Jesus said, “If you keep my commandments, you will abide in my love.” John 15:10"], ["prayer", "Loving God, you have created us so that you can bless us, but sometimes we resist. Sometimes we think of your commandments as roadblocks, not as guardrails on the road. Help us to discover the joy and satisfaction of obeying you. Amen."]], "71": [["info", "Third Sunday in Lent"], ["watchO", "Watchword for the week — O come, let us worship and bow down, let us kneel before the Lord, our Maker! Psalm 95:6"], ["dateVerse", "Sunday, March 12", "Exodus 17:1-7", "Psalm 95", "Romans 5:1-11", "John 4:5-42"], ["watchD", "The Lord your God will make you most prosperous in all the work of your hands. Deuteronomy 30:9 NIV"], ["docT", "It is God who is at work in you, enabling you both to will and to work for his good pleasure. Philippians 2:13"], ["prayer", "Source of all riches, what is prosperity? Visions of glory? Power? Getting what we want? Rather, help us to see that it is cooperating with you to make the best use of what you have given us for living lives pleasing to you. Amen."]], "72": [["dateVerse", "Monday, March 13", "Psalm 35:11–18", "Nehemiah 2:11–3:32", "Romans 3:3–18"], ["watchD", "Why should the nations say, “Where is their God?” Our God is in the heavens; he does whatever he pleases. Psalm 115:2-3"], ["docT", "While God has overlooked the times of human ignorance, now he commands all people everywhere to repent. Acts 17:30"], ["prayer", "Creator of all things, we give you thanks for the wonderful planet you have given us. In many ways, we have not cared for it well. Help us to repent and make the difficult choices to better care for our planet. Amen."]], "73": [["dateVerse", "Tuesday, March 14", "Psalm 35:19–28", "Nehemiah 4", "Romans 3:19–31"], ["watchD", "I am coming to gather all nations and tongues; and they shall come and shall see my glory. Isaiah 66:18"], ["docT", "God, who said, “Let light shine out of darkness,” made his light shine in our hearts to give us the light of the knowledge of God’s glory displayed in the face of Christ. 2 Corinthians 4:6 NIV"], ["prayer", "Jesus, light of the world, amid both the gaudy lights and the dark corners of this life, we need a sense of glory—especially the glory we see in you. And when we see that glory, may that glory, that light, shine through us. Amen."]], "74": [["dateVerse", "Wednesday, March 15", "Psalm 36", "Nehemiah 5:1–6:14", "Romans 4:1–12"], ["watchD", "Great is his steadfast love toward us, and the faithfulness of the Lord endures forever. Praise the Lord! Psalm 117:2"], ["docT", "Blessed be the God and Father of our Lord Jesus Christ, the Father of mercies and the God of all consolation. 2 Corinthians 1:3"], ["prayer", "Eternal God, you endure forever. How can we mortals understand that? We thank you for our Lord Jesus Christ, whose resurrection and continuing life among us give us a taste of “forever.” Amen."]], "75": [["dateVerse", "Thursday, March 16", "Psalm 37:1–6", "Nehemiah 6:15–7:73a", "Romans 4:13–25"], ["watchD", "He guarded his people as the apple of his eye. Deuteronomy 32:10"], ["docT", "God is love, and those who abide in love abide in God, and God abides in them. 1 John 4:16"], ["prayer", "Loving God, we are “the apple of your eye”—a gift, not a reward for anything we have done. May that gift so shape us that we are indeed lovers of both strangers and our neighbors, especially those whom the world ignores or forgets. Amen."]], "76": [["dateVerse", "Friday, March 17", "Psalm 37:7–15", "Nehemiah 7:73b–8:18", "Romans 5:1–11"], ["watchD", "O Lord, do your eyes not look for truth? Jeremiah 5:3"], ["docT", "Whoever is faithful in a very little is faithful also in much; and whoever is dishonest in a very little is dishonest also in much. Luke 16:10"], ["prayer", "Ever-living God, surrounded by changes and falsehoods, we often doubt that anything is true or dependable. Enable us to trust you as the truth upon which we can rely, so that we may be faithful people. Amen."]], "77": [["dateVerse", "Saturday, March 18", "Psalm 37:16–22", "Nehemiah 9:1–10:27", "Romans 5:12–6:4"], ["watchD", "They have all gone astray, they are all alike perverse; there is no one who does good, no, not one. Psalm 14:3"], ["docT", "For the gate is narrow and the road is hard that leads to life, and there are few who find it. Matthew 7:14"], ["prayer", "Lord God, your way is not easy. It is narrow. But despite our failures and our going astray, your way is what you have made us for, and what leads us to genuine life. Amen."]], "78": [["info", "Fourth Sunday in Lent"], ["watchO", "Watchword for the week — Surely goodness and mercy shall follow me all the days of my life, and I shall dwell in the house of the Lord my whole life long. Psalm 23:6"], ["dateVerse", "Sunday, March 19", "1 Samuel 16:1-13", "Psalm 23", "Ephesians 5:8-14", "John 9:1-41"], ["watchD", "There is no holy one like the Lord, no one besides you. 1 Samuel 2:2"], ["docT", "As he who called you is holy, be holy yourselves in all your conduct. 1 Peter 1:15"], ["prayer", "Divine Companion, we are shaped by the company we keep. We need your company, so touch us that we may know we have been with you and have been changed. Amen."]], "79": [["dateVerse", "Monday, March 20", "Psalm 37:23–26", "Nehemiah 10:28–11:36", "Romans 6:5–16"], ["watchD", "Come, let us walk in the light of the Lord! Isaiah 2:5"], ["docT", "Jesus said, “I am the light of the world. Whoever follows me will never walk in darkness but will have the light of life.” John 8:12"], ["prayer", "Jesus, every morning’s sunrise reminds us that you are the light of the world. It is easy to be discouraged by the darkness. Open our eyes to see the light and in some small way to be the light for others as we follow you. Amen. "]], "80": [["dateVerse", "Tuesday, March 21", "Psalm 37:27–33", "Nehemiah 12:1–43", "Romans 6:17–7:6"], ["watchD", "One does not live by bread alone, but by every word that comes from the mouth of the Lord. Deuteronomy 8:3"], ["docT", "Lord, to whom can we go? You have the words of eternal life. John 6:68"], ["prayer", "Bread of life, we often prefer to dine on the fast foods of the world around us. Convert our appetites. Make us hungry for real food. Make us hungry for you, the feast that nourishes and satisfies. Amen."]], "81": [["dateVerse", "Wednesday, March 22", "Psalm 37:34–40", "Nehemiah 12:44–13:14", "Romans 7:7–20"], ["watchD", "I will seek the lost, and I will bring back the strayed. I will bind up the injured, and I will strengthen the weak. Ezekiel 34:16"], ["docT", "Jesus said, “When the shepherd comes home, he calls together his friends and neighbors, saying to them, ‘Rejoice with me, for I have found my sheep that was lost.’” Luke 15:6"], ["prayer", "Good Shepherd, sometimes we are lost and yearn to be found. More often, we don’t even know we are lost. Help us to know the joy of being found by you. Amen."]], "82": [["dateVerse", "Thursday, March 23", "Psalm 38:1–8", "Nehemiah 13:15–31", "Romans 7:21–8:8"], ["watchD", "You silence the roaring of the seas, the tumult of the peoples. Psalm 65:7"], ["docT", "Zechariah said, “With a solemn oath to our ancestor Abraham the God of Israel promised to rescue us from our enemies and allow us to serve him without fear all the days of our life.” Luke 1:73-75 GNT"], ["prayer", "Jesus, quiet friend, we are usually impressed by speed and noise and power. You invite us to your wild and different ways: of listening, humility, and compassion. Lead us in that way. Amen."]], "83": [["dateVerse", "Friday, March 24", "Psalm 38:9–16", "Esther 1", "Romans 8:9–19"], ["watchD", "Thus says the Lord, I myself have spoken to you persistently, and you have not obeyed me. Jeremiah 35:14"], ["docT", "Jesus said, “Blessed are those who hear the word of God and keep it!” Luke 11:28 NKJV"], ["prayer", "Our Hope and Stay, on our own, we fall far short of your hopes for us. We go our own way. We live fearful lives. But when we really are open to your guidance, we know that we are blessed. Thank you. Amen."]], "84": [["dateVerse", "Saturday, March 25", "Psalm 38:17–22", "Esther 2:1–18", "Romans 8:20–33"], ["watchD", "One who is slow to anger is better than the mighty and one whose temper is controlled than one who captures a city. Proverbs 16:32"], ["docT", "Blessed are the peacemakers, for they will be called children of God. Matthew 5:9"], ["prayer", "Peacemaking God, you call us to live differently: controlling temper, seeking community, being able to take the risky step. You call us to be a means of your grace. Show us how wonderful and exciting it can be to live as your peacemaking children. Amen."]], "85": [["info", "Fifth Sunday in Lent"], ["watchO", "Watchword for the week — I wait for the Lord, my soul waits, and in his word I hope. Psalm 130:5"], ["dateVerse", "Sunday, March 26", "Ezekiel 37:1-14", "Psalm 130", "Romans 8:6-11", "John 11:1-45"], ["watchD", "Solomon said at the dedication of the temple, “Will God indeed dwell on the earth?” 1 Kings 8:27"], ["docT", "No one has ever seen God. It is God the only Son, who is close to the Father’s heart, who has made him known. John 1:18"], ["prayer", "Invisible God, we long to see you; we need to see you on the earth. Invisible God, you have become visible in Jesus—but not as we expected. Invisible God, may what we see in Jesus, especially forgiveness and service, be reflected in us. Amen."]], "86": [["dateVerse", "Monday, March 27", "Psalm 39:1–6", "Esther 2:19–3:15", "Romans 8:34–9:7"], ["watchD", "Your name, O God, like your praise, reaches to the ends of the earth. Psalm 48:10"], ["docT", "Jesus said, “As you go, proclaim the good news, ‘The kingdom of heaven has come near.’” Matthew 10:7"], ["prayer", "Great Musician, you have made us, as people created in your image, to sing. We sing because we are alive. We sing because, whatever our circumstances, life is good. We sing because, in Jesus, we have a glimpse of your kingdom. We sing because we are your people. Hallelujah! Amen."]], "87": [["dateVerse", "Tuesday, March 28", "Psalm 39:7–13", "Esther 4,5", "Romans 9:8–21"], ["watchD", "He knows how we were made; he remembers that we are dust. Psalm 103:14"], ["docT", "We always carry around in our body the death of Jesus, so that the life of Jesus may also be revealed in our body. 2 Corinthians 4:10 NIV"], ["prayer", "Giver of life, we are dust, and to dust we shall return. But we are more than dust. We give you thanks for Jesus’ promise of new life, both in our present mortal bodies and after we are again dust. Praise be to you. Amen."]], "88": [["dateVerse", "Wednesday, March 29", "Psalm 40:1–8", "Esther 6,7", "Romans 9:22–33"], ["watchD", "Praise the Lord, all you nations! Extol him, all you peoples! Psalm 117:1"], ["docT", "On the Day of Pentecost the people said, “We hear them speaking in our own tongues the wonderful works of God.” Acts 2:11 NKJV"], ["prayer", "Holy Spirit, on Pentecost, you demonstrated your desire to bring together all nations. Yet we humans seem intent on growing divisions and hate. May we, who bear the name of Jesus, so live that we show the world your love for all and your desire for harmony among people. Amen."]], "89": [["dateVerse", "Thursday, March 30", "Psalm 40:9–17", "Esther 8:1–9:17", "Romans 10:1–13"], ["watchD", "For everything there is a season, and a time for every matter under heaven. Ecclesiastes 3:1"], ["docT", "Then Jesus took the twelve aside and said to them, “See, we are going up to Jerusalem, and everything that is written about the Son of Man by the prophets will be accomplished.” Luke 18:31"], ["prayer", "Jesus, divine and human leader, whatever the season—hard or easy, surprising or expected, with destination clear or unknown—you both lead us and go with us. Strengthen our often-feeble wills to trust your leadership. Amen."]], "90": [["dateVerse", "Friday, March 31", "Psalm 41", "Esther 9:18–10:3", "Romans 10:14–11:6"], ["watchD", "When the Israelites cried out to the Lord, the Lord raised up a deliverer, who delivered them. Judges 3:9"], ["docT", "Zechariah said, “Blessed be the Lord God of Israel, for he has looked favorably on his people and redeemed them.” Luke 1:68"], ["prayer", "Savior, from what do we need to be saved or delivered? Turn our attention from the foes outside us to the foes within us. Turn our eyes from the faults of others to see our own faults. Help us to find our salvation in turning from self-centered ways and in joyfully living as your own people. Amen."]], "91": [["dateVerse", "Saturday, April 1", "Psalm 42", "Job 1,2", "Romans 11:7–18"], ["watchD", "The Lord will not cast away his people, for his great name’s sake. 1 Samuel 12:22"], ["docT", "If we are faithless, he remains faithful—for he cannot deny himself. 2 Timothy 2:13"], ["prayer", "So many times, God, we have turned away from you, giving you every reason to turn away from us. Yet, patiently and persistently, you pull us back from our pride and selfishness. You labor to restore us to yourself and to one another. Thank you, faithful God. Amen."]], "92": [["info", "Palm Sunday"], ["watchO", "Watchword for the week — And being found in human form, Jesus humbled himself and became obedient to the point of death—even death on a cross. Philippians 2:7,8"], ["dateVerse", "Sunday, April 2", "Isaiah 50:4-9a", "Psalm 31:9-16", "Philippians 2:5-11", "Matthew 21:1-11"], ["watchD", "I will turn their mourning into joy. Jeremiah 31:13"], ["docT", "Jesus said, “Blessed are those who mourn, for they will be comforted.” Matthew 5:4"], ["prayer", "Jesus of Nazareth, as you rode into Jerusalem, ride into our hearts today. Hear us as we shout, “Blessed is the One who comes in the name of the Lord.” Let us bless you even as you bless and comfort us with freedom, purpose, and joy. Amen."]], "93": [["dateVerse", "Monday, April 3", "Psalm 43", "Job 3,4", "Romans 11:19–32"], ["watchD", "I keep my eyes always on the Lord. Psalm 16:8 NIV"], ["docT", "Let us look to Jesus, the pioneer and perfecter of our faith, who for the sake of the joy that was set before him endured the cross, disregarding its shame. Hebrews 12:2"], ["prayer", "When our eyes wander from you, Lord, we see only the brokenness of human striving and despair. Yet, even on that bleak horizon, we also see your arms stretched out on the cross. We see you, Lord, beginning and ending everything with love. Amen."]], "94": [["dateVerse", "Tuesday, April 4", "Psalm 44:1–8", "Job 5,6", "Romans 11:33–12:8"], ["watchD", "Fear not, O land; Be glad and rejoice, for the Lord has done marvelous things! Joel 2:21 NKJV"], ["docT", "The whole multitude of the disciples began to praise God joyfully with a loud voice for all the deeds of power that they had seen, saying, “Blessed is the king who comes in the name of the Lord!” Luke 19:37-38"], ["prayer", "We lift up our loud voices. We praise and welcome you, Lord. We give thanks because you ride boldly into our lives, our cities, and nations. You bring health, healing, and hope that God’s mercy and justice will prevail in the world around us. Amen."]], "95": [["dateVerse", "Wednesday, April 5", "Psalm 44:9–16", "Job 7", "Romans 12:9–21"], ["watchD", "The Lord loves righteousness and justice. Psalm 33:5"], ["docT", "You know the generous act of our Lord Jesus Christ, that though he was rich, yet for your sakes he became poor, so that by his poverty you might become rich. 2 Corinthians 8:9"], ["prayer", "Thank you, justice-loving God. Seeing our hungry bodies and empty hearts, you give us your commandments and show us the way to live in harmony with one another. Knowing we need still more, you show us that self-sacrificing love—yours and ours—enriches your world with mercy and peace. Amen."]], "96": [["info", "Maundy Thursday "], ["info", "Maundy Thursday — He has gained renown by his wonderful deeds; the Lord is gracious and merciful. Psalm 111:4"], ["dateVerse", "Thursday, April 6", "Psalm 44:17–26", "Job 8", "Romans 13"], ["watchD", "God said, “As long as the earth endures, seedtime and harvest, cold and heat, summer and winter, day and night, shall not cease.” Genesis 8:22"], ["docT", "Jesus took a loaf of bread, and when he had given thanks, he broke it and gave it to them, saying, “This is my body, which is given for you. Do this in remembrance of me.” And he did the same with the cup after supper, saying, “This cup that is poured out for you is the new covenant in my blood.” Luke 22:19-20"], ["prayer", "As faithful as the cycles of day and night, and seedtime and harvest may be, you, Lord, are even more faithful. You invite us again and again to your table as treasured guests. We give thanks, fully and freely without end, that you give yourself to us in love. Amen."]], "97": [["info", "Good Friday"], ["info", "Good Friday — For God so loved the world that he gave his only Son, so that everyone who believes in him may not perish but may have eternal life. John 3:16"], ["dateVerse", "Friday, April 7", "Psalm 45:1–9", "Job 9", "Romans 14:1–12"], ["watchD", "O taste and see that the Lord is good; happy are those who take refuge in him. Psalm 34:8"], ["docT", "One of the criminals said, “Jesus, remember me when you come into your kingdom.” He replied, “Truly I tell you, today you will be with me in Paradise.” Luke 23:42-43"], ["prayer", "Christ, even as we see you hang upon the cross, we pray a humble, earnest plea. May we savor the taste of your forgiveness and the sweetness of your love in this life and in the life yet to come. Amen."]], "98": [["info", "Great Sabbath"], ["dateVerse", "Saturday, April 8", "Psalm 45:10–17", "Job 10", "Romans 14:13–15:2"], ["watchD", "The Lord drew me up from the desolate pit, out of the miry bog, and set my feet upon a rock, making my steps secure. Psalm 40:2"], ["docT", "Christ was put to death in the flesh, but made alive in the spirit, in which also he went and made a proclamation to the spirits in prison. 1 Peter 3:18-19"], ["prayer", "Jesus, when we are in prison, entombed in the consequences of our own sin, speak to us words of hope. Pull us up, set us free. Place our feet securely on the solid rock of your love. Amen."]], "99": [["info", "Easter Sunday"], ["watchO", "Watchword for the week — So if you have been raised with Christ, seek the things that are above, where Christ is, seated at the right hand of God. Colossians 3:1"], ["dateVerse", "Sunday, April 9", "Acts 10:34-43", "Psalm 118:1-2,14-24", "Colossians 3:1-4", "John 20:1-18"], ["watchD", "I lie down and sleep; I wake again, for the Lord sustains me. Psalm 3:5"], ["docT", "After Jesus rose early on the first day of the week, he appeared first to Mary Magdalene, from whom he had cast out seven demons. She went out and told those who had been with him, while they were mourning and weeping. Mark 16:9-10"], ["prayer", "Refreshed by sleep, help us rise to live a new day. With eyes that see more clearly in morning’s light, help us, Lord, to recognize Christ alive among us, bringing us hope and purpose. May we, like Mary, tell those still weary with night’s mourning, “Christ is risen! Alleluia.” Amen."]], "100": [["dateVerse", "Monday, April 10", "Psalm 46", "Job 11:1–12:12", "Romans 15:3–16"], ["watchD", "The Lord will fight for you, and you have only to keep still. Exodus 14:14"], ["docT", "Thanks be to God, who gives us the victory through our Lord Jesus Christ. 1 Corinthians 15:57"], ["prayer", "Life’s enemies threaten—poverty, sickness, disaster, doubt, death. Let me hide behind you, defender God, as you battle them on my behalf. Let my troubled soul be still, trusting that your love and mercy will prevail, protecting me and the whole of your creation. Amen."]], "101": [["dateVerse", "Tuesday, April 11", "Psalm 47", "Job 12:13–13:19", "Romans 15:17–29"], ["watchD", "You have made the Lord your refuge. Psalm 91:9"], ["docT", "For just as the sufferings of Christ are abundant for us, so also our consolation is abundant through Christ. 2 Corinthians 1:5"], ["prayer", "Protector God, when fierce storms threaten, you give us shelter and refuge under your wings like a mother hen. You murmur comforting words of consolation that all will be well. We give thanks that you care for us and raise us up, even as you cared for and raised up Christ. Amen."]], "102": [["dateVerse", "Wednesday, April 12", "Psalm 48", "Job 13:20–14:22", "Romans 15:30–16:7"], ["watchD", "I—My hands—stretched out the heavens, and all their host I have commanded. Isaiah 45:12 NKJV"], ["docT", "Every generous act of giving, with every perfect gift, is from above, coming down from the Father of lights, with whom there is no variation or shadow due to change. James 1:17"], ["prayer", "As energy streams from the sun, giving light and food to the earth, so even the universe itself, with all its light and love, streams from you, creator God. May your creative energy be the source of our own gifts in return: caring for and revering creation. Amen."]], "103": [["dateVerse", "Thursday, April 13", "Psalm 49:1–12", "Job 15,16", "Romans 16:8–20"], ["watchD", "Lord, in your great mercies you did not make an end of your people or forsake them. Nehemiah 9:31"], ["docT", "Jesus said, “Because I live, you also will live.” John 14:19"], ["prayer", "In a world full of negative “becauses” that lead to despair and isolation, thank you, God, for being the loving “because” that leads us to hope and community. Give us the “because” that we need today to live as your people, working for your justice and peace. Amen."]], "104": [["dateVerse", "Friday, April 14", "Psalm 49:13–20", "Job 17,18", "Romans 16:21–1 Corinthians 1:1–9"], ["watchD", "The days are surely coming, says the Lord, when I will raise up for David a righteous branch, and he shall reign as king and deal wisely, and shall execute justice and righteousness in the land. Jeremiah 23:5"], ["docT", "Jesus set free those who were slaves all their lives because of their fear of death. Hebrews 2:15 GNT"], ["prayer", "Son of David, just and kind ruler, set us free from the prisons and chains of our own and other’s making. Release us from poverty to enjoy your abundance. Release us from guilt to experience forgiveness. Release us from despair to live with hope and purpose. Amen."]], "105": [["dateVerse", "Saturday, April 15", "Psalm 50:1–6", "Job 19", "1 Corinthians 1:10–20"], ["watchD", "God is wise in heart, and mighty in strength—who has resisted him, and succeeded? Job 9:4"], ["docT", "But who indeed are you, a human being, to argue with God? Romans 9:20"], ["prayer", "We resist, Lord. We argue; we think we know best. We lead ourselves into cold, dangerous, empty places. Help us instead, wise and compassionate God, to listen to your voice, take your hand, and journey where you lead into warm, safe places of peace and freedom. Amen."]], "106": [["info", "Second Sunday of Easter"], ["info", "Watchword of the week — Blessed be the God and Father of our Lord Jesus Christ! By his great mercy he has given us a new birth into a living hope through the resurrection of Jesus Christ from the dead. 1 Peter 1:3"], ["dateVerse", "Sunday, April 16", "Acts 2:14a,22-32", "Psalm 16", "1 Peter 1:3-9", "John 20:19-31"], ["watchD", "Extol the Lord our God; worship at his footstool. Holy is he! Psalm 99:5"], ["docT", "When they had prayed, the place in which they were gathered together was shaken; and they were all filled with the Holy Spirit and spoke the word of God with boldness. Acts 4:31"], ["prayer", "Drawing strength from one another, we wait for you, Lord. Let your powerful Spirit move among us. Make us bold, not only to tell your story with words, but to live your story by feeding the hungry, healing the sick, caring for the land, and welcoming the stranger. Amen."]], "107": [["dateVerse", "Monday, April 17", "Psalm 50:7–15", "Job 20", "1 Corinthians 1:21–2:2"], ["watchD", "Remember the Lord in a distant land, and let Jerusalem come into your mind. Jeremiah 51:50"], ["docT", "So then you are no longer strangers and aliens, but you are citizens with the saints and also members of the household of God. Ephesians 2:19"], ["prayer", "Pandemic, division, fear, self-loathing—they threaten to exile us from one another and from you, merciful God. Bring us out from our places of isolation. Gather us into the home of your heart. No longer strangers, join us together as members of your beloved family. Amen."]], "108": [["dateVerse", "Tuesday, April 18", "Psalm 50:16–23", "Job 21", "1 Corinthians 2:3–16"], ["watchD", "The king of Israel, the Lord, is in your midst; you shall fear disaster no more. Zephaniah 3:15"], ["docT", "God did not give us a spirit of cowardice, but rather a spirit of power and of love and of self-discipline. 2 Timothy 1:7"], ["prayer", "Seeing the violent chaos of our human-making, Lord, you could justifiably wipe your hands of us and leave us cowering in fear. Instead, you offer us your powerful love. Give us wisdom to open our hearts to your Spirit and courage to follow where you lead. Amen."]], "109": [["dateVerse", "Wednesday, April 19", "Psalm 51:1–6", "Job 22,23", "1 Corinthians 3:1–11"], ["watchD", "I will save you that you may become a blessing. Zechariah 8:13 NASB"], ["docT", "Not that we are competent of ourselves to claim anything as coming from us; our competence is from God. 2 Corinthians 3:5"], ["prayer", "Save us, Lord, so that we too may be a blessing. Wash away our guilt, so that we may forgive. Heal us, so that we may alleviate pain. Fill us with hope and courage, so that we may offer a despairing world the light of your justice and love. Amen."]], "110": [["dateVerse", "Thursday, April 20", "Psalm 51:7–12", "Job 24", "1 Corinthians 3:12–23"], ["watchD", "The Lord said, “I will defend this city to save it, for my own sake.” 2 Kings 19:34"], ["docT", "Do not be afraid, little flock, for it is your Father’s good pleasure to give you the kingdom. Luke 12:32"], ["prayer", "Defend us, Lord, from the self-delusions, doubts, and despairs that defy our hope in your coming kingdom. Cast away our fears. Gather us up gently. Reign over us with mercy and justice, so that every living thing may peacefully enjoy the abundance of your creation. Amen."]], "111": [["dateVerse", "Friday, April 21", "Psalm 51:13–19", "Job 25–27", "1 Corinthians 4:1–15"], ["watchD", "You shall not bear false witness against your neighbor. Exodus 20:16"], ["docT", "Let come out of your mouths what is useful for building up, as there is need, so that your words may give grace to those who hear. Ephesians 4:29"], ["prayer", "God, the word who spoke creation into being, God, the word who teaches us how to love each other, make us value the power of our own words to create and encourage. Help us speak words of comfort and hope, truth and justice, joy and peace. Amen."]], "112": [["dateVerse", "Saturday, April 22", "Psalm 52", "Job 28", "1 Corinthians 4:16–5:8"], ["watchD", "Lord, let me know my end, and what is the measure of my days; let me know how fleeting my life is. Psalm 39:4"], ["docT", "We know that if the earthly tent we live in is destroyed, we have a building from God, a house not made with hands, eternal in the heavens. 2 Corinthians 5:1"], ["prayer", "My body, like a tent made with human hands, is transitory upon this earth. Fleeting, it will wither away into death. Reassure me, Lord, that in the resurrection you will provide for me a new body, a new dwelling, a new way of resting in your heart of love. Amen."]], "113": [["info", "Third Sunday of Easter"], ["watchO", "Watchword for the week — You have been born anew, not of perishable but of imperishable seed, through the living and enduring word of God. 1 Peter 1:23"], ["dateVerse", "Sunday, April 23", "Acts 2:14a,36-41", "Psalm 116:1-4,12-19", "1 Peter 1:17-23", "Luke 24:13-35"], ["watchD", "“Who can hide in secret places so that I cannot see them?” says the Lord. “Do I not fill heaven and earth?” Jeremiah 23:24"], ["docT", "Before him no creature is hidden, but all are naked and laid bare to the eyes of the one to whom we must render an account. Hebrews 4:13"], ["prayer", "Full of pride, we avoid you. Fearing your demands, we evade you. Full of shame, we slip into shadows. And yet, searching God, we cannot hide from you. You never lose sight of us. In every time and place, you still seek to direct, support, console, and protect us. Amen."]], "114": [["dateVerse", "Monday, April 24", "Psalm 53", "Job 29", "1 Corinthians 5:9–6:8"], ["watchD", "My soul waits for the Lord more than those who watch for the morning. Psalm 130:6 "], ["docT", "Keep yourselves in the love of God; look forward to the mercy of our Lord Jesus Christ that leads to eternal life. Jude 21"], ["prayer", "In the quiet dark of night, we wait for the earth to make its trustworthy turn into day, for early gray dawn to light our way. We wait too for you, trustworthy God. In new morning light, help us live embraced by your love, motivated by your will. Amen."]], "115": [["dateVerse", "Tuesday, April 25", "Psalm 54", "Job 30", "1 Corinthians 6:9–20"], ["watchD", "Light shines in the darkness for the upright; [he is] gracious, compassionate, and righteous. Psalm 112:4 NASB"], ["docT", "This slight momentary affliction is preparing us for an eternal weight of glory beyond all measure, because we look not at what can be seen but at what cannot be seen. 2 Corinthians 4:17-18"], ["prayer", "God of light, shine brightly, even through the gloom of our afflictions. Shine, so that we can see the way to live a righteous life before you. Help us to be gracious, not rude; truthful, not dishonest; patient, not expedient; compassionate, not cruel; full of joy and not despairing. Amen."]], "116": [["dateVerse", "Wednesday, April 26", "Psalm 55:1–8", "Job 31", "1 Corinthians 7:1–16"], ["watchD", "There shall once more be heard the voice of mirth and the voice of gladness, the voice of the bridegroom and the voice of the bride, the voices of those who sing, “Give thanks to the Lord of hosts, for the Lord is good, for his steadfast love endures forever!” Jeremiah 33:10-11"], ["docT", "The grace of God has appeared, bringing salvation to all. Titus 2:11"], ["prayer", "Steadfastly, without fail, you care for us in every time and place, through every joy, change, and hardship. Steadfastly, without consideration of class, race, nation, or species, you offer your love to every living creature. Faithful, steadfast God, how can we keep from singing our thanks and praise? Amen."]], "117": [["dateVerse", "Thursday, April 27", "Psalm 55:9–15", "Job 32,33", "1 Corinthians 7:17–24"], ["watchD", "I formed you, you are my servant; O Israel, you will not be forgotten by me. Isaiah 44:21"], ["docT", "Has God rejected his people? By no means! Romans 11:1"], ["prayer", "Lord, you extend love and mercy, and call and purpose to Israel—your ancient covenant people—and to all those who inherit your history of leading and guiding them. We give thanks that we, and every other human family, are never beyond the reach of your patient, persistent love. Amen."]], "118": [["dateVerse", "Friday, April 28", "Psalm 55:16–19", "Job 34:1–28", "1 Corinthians 7:25–40"], ["watchD", "One who puts on armor should not brag like one who takes it off. 1 Kings 20:11"], ["docT", "Be renewed in the spirit of your minds. Ephesians 4:23"], ["prayer", "We trust you, Lord, to lead us safely through our battles with evil and despair. Before each battle, we beg you to renew our minds with hope, purpose, and peace. We shall not brag until each battle is won, Lord. And then, victorious, we will brag only of you. Amen."]], "119": [["dateVerse", "Saturday, April 29", "Psalm 55:20–23", "Job 34:29–35:16", "1 Corinthians 8"], ["watchD", "You shall worship before the Lord your God; and you shall rejoice in every good thing which the Lord your God has given to you and your house. Deuteronomy 26:10-11 ESV"], ["docT", "As for those who in the present age are rich, command them not to be haughty, or to set their hopes on the uncertainty of riches, but rather on God who richly provides us with everything for our enjoyment. They are to do good, to be rich in good works, generous, and ready to share. 1 Timothy 6:17-18"], ["prayer", "Every gift comes from you, Lord. May your blessings of wealth and security lead us not to arrogant pride but to humble gratitude. May our gratitude for your gifts lead us not to clutch them tightly, but to open our hands and freely share them with love. Amen."]], "120": [["info", "Fourth Sunday of Easter"], ["watchO", "Watchword for the week — Jesus said, “I am the gate. Whoever enters by me will be saved, and will come in and go out and find pasture.” John 10:9"], ["dateVerse", "Sunday, April 30", "Acts 2:42-47", "Psalm 23", "1 Peter 2:19-25", "John 10:1-10"], ["watchD", "Then Jacob woke from his sleep and said, “Surely the Lord is in this place—and I did not know it!” Genesis 28:16"], ["docT", "The disciples said to each other, “Were not our hearts burning within us while he was talking to us on the road, while he was opening the scriptures to us?” Luke 24:32"], ["prayer", "Let us savor, mysterious Lord, those sure moments when we clearly feel you comforting us, hear you calling us, feel you leading us. And then, in moments when you seem just beyond our reach, open our hearts. Let them burn with the power of your ever-present love. Amen."]], "121": [["dateVerse", "Monday, May 1", "Psalm 56:1–8", "Job 36:1–26", "1 Corinthians 9:1–12a"], ["watchD", "How great are God’s signs, how mighty his wonders! His kingdom is an eternal kingdom; his dominion endures from generation to generation. Daniel 4:3 NIV"], ["docT", "Therefore, since we are receiving a kingdom that cannot be shaken, let us give thanks, by which we offer to God an acceptable worship with reverence and awe. Hebrews 12:28"], ["prayer", "Dear Lord, help us remember that you built your kingdom on a firm, rock-solid, unshakeable foundation. We stand on that foundation, and nothing shakes us off our rock. We live and move and have our being in you, awestruck at how great your faithful love continues throughout all generations into eternal light and life. We praise you for your wonderful creation and love, for you are the everlasting God of all our days. Our souls sing, “How great thou art!” Amen. "]], "122": [["dateVerse", "Tuesday, May 2", "Psalm 56:9–13", "Job 36:27–37:24", "1 Corinthians 9:12b–27"], ["watchD", "May the Lord, who is good, pardon everyone who sets his heart on seeking God. 2 Chronicles 30:18-19 NIV"], ["docT", "Jesus said, “I have come to call not the righteous but sinners.” Mark 2:17"], ["prayer", "Sometimes, Lord, we doubt that we can truly have healed hearts, restored relationships, and forgiven, fruitful lives. We seek your forgiveness and we offer forgiveness and love to others as you have offered to us, so that our hearts find a real home in you. In Jesus’ name, we pray. Amen."]], "123": [["dateVerse", "Wednesday, May 3", "Psalm 57:1–6", "Job 38", "1 Corinthians 10:1–10"], ["watchD", "You shall be holy, for I the Lord your God am holy. Leviticus 19:2"], ["docT", "We, who were the first to set our hope on Christ, might live for the praise of his glory. Ephesians 1:12"], ["prayer", "Lord, when we lose hope, we also lose sight of your holiness and your call for us to be holy, just as you are. Help us be more like you, and to see clearly where we need to allow you to reshape us into your image. Help us live as you would have us, and help us as we walk together in your footsteps. Amen."]], "124": [["dateVerse", "Thursday, May 4", "Psalm 57:7–11", "Job 39", "1 Corinthians 10:11–22"], ["watchD", "My tongue will sing of your promise, for all your commandments are right. Psalm 119:172"], ["docT", "I am not ashamed of the gospel; it is the power of God for salvation to everyone who has faith. Romans 1:16"], ["prayer", "Help us remember why we are yours, Lord. Help our voices sing your praises and our hearts and ears remember to listen to your commandments. Help us to put into practice the words and commandments we have learned from you, so that we don’t convince ourselves and others that we can simply hear or read your words and not obey or submit to you. In Jesus’ name, we pray. Amen."]], "125": [["dateVerse", "Friday, May 5", "Psalm 58", "Job 40", "1 Corinthians 10:23–11:2"], ["watchD", "I will remove the guilt of this land in a single day. Zechariah 3:9 "], ["docT", "Jesus Christ is the atoning sacrifice for our sins, and not for ours only but also for the sins of the whole world. 1 John 2:2"], ["prayer", "Lord, when we practice the two greatest commandments you taught us—to love you first as our God and savior, and to love others as we love ourselves—our souls are filled with light. May we keep the fire burning as we fix our eyes on you. Help us be the hands and feet, to offer a drink of water to the thirsty and take care of those who are sick. Give us the strength to be your body in the world. In your name, O Lord, we pray. Amen."]], "126": [["dateVerse", "Saturday, May 6", "Psalm 59:1–9", "Job 41", "1 Corinthians 11:3–16"], ["watchD", "In my distress I called upon the Lord; to my God I cried for help. He heard my voice. Psalm 18:6"], ["docT", "Jesus was in the stern, asleep on the cushion; and they woke him up and said to him, “Teacher, do you not care that we are perishing?” Mark 4:38"], ["prayer", "We waited for you, Lord, and you heard our cries for help. Even though we think we can trust our survival skills, storms unexpectedly arise that make us realize we could drown without your help. You remain calmly sleeping, reminding us to trust and rest in you until the storm passes, because your love is our protection from what harms us. In your name, Jesus, we thank you for your protection! Amen. "]], "127": [["info", "Fifth Sunday of Easter"], ["watchO", "Watchword for the week — Jesus said, “I am the way, and the truth, and the life. No one comes to the Father except through me.” John 14:6"], ["dateVerse", "Sunday, May 7", "Acts 7:55-60", "Psalm 31:1-5,15-16", "1 Peter 2:2-10", "John 14:1-14"], ["watchD", "If your enemies are hungry, give them bread to eat; and if they are thirsty, give them water to drink; for you will heap coals of fire on their heads, and the Lord will reward you. Proverbs 25:21-22"], ["docT", "Love your enemies, do good, and lend, expecting nothing in return. Your reward will be great, and you will be children of the Most High; for he is kind to the ungrateful and the wicked. Luke 6:35"], ["prayer", "Father, we sometimes hold a grudge and use our words to be spiteful or mean, so that others can feel the pain we are experiencing. Lord, help us let go of the pain and extend kindness and love to all, even to those who are our enemies. You alone are the one who can judge us and take away our sins. Forgive us and forgive our enemies. We thank you for your grace, through our redeemer, Jesus. Amen. "]], "128": [["dateVerse", "Monday, May 8", "Psalm 59:10–17", "Job 42", "1 Corinthians 11:17–30"], ["watchD", "God said to Moses, “I am who I am.” Exodus 3:14"], ["docT", "If God is for us, who is against us? Romans 8:31"], ["prayer", "O, Lord, we have no reason to be afraid. You bring us life and peace, even when we can’t see you and wonder why you are hiding. You are the eternal and great I AM, who has always existed. We have a place at your table, and know that you have plans for our future. In Jesus’ name, we pray. Amen!"]], "129": [["dateVerse", "Tuesday, May 9", "Psalm 60", "Proverbs 1:1–2:8", "1 Corinthians 11:31–12:11"], ["watchD", "The God of heaven will set up a kingdom that shall never be destroyed. Daniel 2:44"], ["docT", "Jesus said to the apostles, “I confer on you, just as my Father has conferred on me, a kingdom, so that you may eat and drink at my table in my kingdom.” Luke 22:29-30"], ["prayer", "Jesus, you are our bread of life! Thank you for promising to feed us and care for us always. You know our hunger and thirst for food, for water, and most importantly, your presence in our hearts and lives. Amen and alleluia! Amen."]], "130": [["dateVerse", "Wednesday, May 10", "Psalm 61", "Proverbs 2:9–3:20", "1 Corinthians 12:12–26"], ["watchD", "Is my hand shortened, that it cannot redeem? Or have I no power to deliver? Isaiah 50:2"], ["docT", "There was a leper who came to Jesus and knelt before him, saying, “Lord, if you choose, you can make me clean.” Matthew 8:2"], ["prayer", "Give us clean hands and a pure heart, Lord, so we can raise them to you. May we give thanks to you, our greatest treasure and most important friend. You are the most high and we praise you! Amen."]], "131": [["dateVerse", "Thursday, May 11", "Psalm 62", "Proverbs 3:21–4:27", "1 Corinthians 12:27–13:7"], ["watchD", "Thus says the Lord, “As the wine is found in the cluster, and they say, ‘Do not destroy it, for there is a blessing in it’, so I will do for my servants’ sake, and not destroy them all.” Isaiah 65:8 "], ["docT", "Indeed, God did not send the Son into the world to condemn the world, but in order that the world might be saved through him. John 3:17"], ["prayer", "Sometimes our guilt shames us. But you, Lord, come to save us from everything that condemns us and condemns others, including our own negative thoughts. Help us remember to live in freedom because you freed us. Amen."]], "132": [["dateVerse", "Friday, May 12", "Psalm 63", "Proverbs 5", "1 Corinthians 13:8–14:5"], ["watchD", "With weeping they shall come, and with consolations I will lead them back, I will let them walk by brooks of water, in a straight path in which they shall not stumble; for I have become a father to Israel. Jeremiah 31:9"], ["docT", "Jesus said, “You now have sorrow; but I will see you again and your heart will rejoice, and your joy no one will take from you.” John 16:22 NKJV"], ["prayer", "Jesus, your perfect love casts out our fears. We will walk in your ways because we know our souls are at peace in you. You hear us when we pray for your guidance. Help us make good decisions. In your name, we pray. Amen."]], "133": [["dateVerse", "Saturday, May 13", "Psalm 64", "Proverbs 6", "1 Corinthians 14:6–19"], ["watchD", "I am with you to save you and deliver you, says the Lord. Jeremiah 15:20"], ["docT", "Let us therefore approach the throne of grace with boldness, so that we may receive mercy and find grace to help in time of need. Hebrews 4:16"], ["prayer", "Lord, we have nothing to be afraid of. We are confident that your grace and mercy bring us blessings and joy in times of hardships and sorrow. You wipe away our tears and help us remember that we can come to you in trust, love, and praise for who you are and what you have done for us as our creator, redeemer, and sustainer. Amen!"]], "134": [["info", "Sixth Sunday of Easter"], ["watchO", "Watchword for the week — Make a joyful noise to God, all the earth; sing the glory of his name; give to him glorious praise. Psalm 66:1,2"], ["dateVerse", "Sunday, May 14", "Acts 17:22-31", "Psalm 66:8-20", "1 Peter 3:13-22", "John 14:15-21"], ["watchD", "Daniel said, “My God sent his angel and shut the lions’ mouths so that they would not hurt me.” Daniel 6:22"], ["docT", "Jesus said, “My sheep hear my voice. I know them, and they follow me. No one will snatch them out of my hand.” John 10:27,28"], ["prayer", "Thank you, Lord, for protecting us when we are attacked by our enemies. We hear your voice, Lord, and follow you to eat in green pastures and drink beside still waters. You are good and kind, the Lion of Judah, and nothing can hurt us because you are our defender. May it be that peace fills our lives and overflows to others around us. Amen."]], "135": [["dateVerse", "Monday, May 15", "Psalm 65:1–8", "Proverbs 7", "1 Corinthians 14:20–35"], ["watchD", "Those he gathered from the east and from the west, from the north and from the south: Let them thank the Lord for his steadfast love, for his wonderful works to humankind. Psalm 107:3,8"], ["docT", "Many will come from east and west and will eat with Abraham and Isaac and Jacob in the kingdom of heaven. Matthew 8:11"], ["prayer", "Lord, take the blinders off our eyes. Help us be more accepting of people all over this world. Lord, help us to love others and to be a good friend to them because of your love for us. Help us share your goodness and blessings with everyone. In your name, we pray. Amen!"]], "136": [["dateVerse", "Tuesday, May 16", "Psalm 65:9–13", "Proverbs 8:1–9:6", "1 Corinthians 14:36–15:2"], ["watchD", "Some sat in darkness and in gloom, prisoners in misery and in irons. Then they cried to the Lord in their trouble, and he saved them from their distress. Let them thank the Lord for his steadfast love, for his wonderful works to humankind. Psalm 107:10,13,15"], ["docT", "Blessed are those who are persecuted for righteousness’ sake, for theirs is the kingdom of heaven. Matthew 5:10"], ["prayer", "Sometimes, Lord, we forget that you are the light in the darkest nights of our souls. Sometimes, real persecution happens to people who are tortured, imprisoned, and martyred for their faith, hope, and trust in you as their guiding light. Help us to recognize the risks involved in being a Christian, and to truly be willing to sacrifice our time and energy for your cause. In the name of the one who died for us, help us live for you. Amen."]], "137": [["dateVerse", "Wednesday, May 17", "Psalm 66:1–7", "Proverbs 9:7–10:32", "1 Corinthians 15:3–16"], ["watchD", "O Lord, do not rebuke me in your anger, or discipline me in your wrath. Psalm 6:1"], ["docT", "God has destined us not for wrath but for obtaining salvation through our Lord Jesus Christ, who died for us. 1 Thessalonians 5:9-10"], ["prayer", "Lord, remind us that the gift of your salvation is free and available to everyone…and that no good works will change that. May we remember the cross and all that you do for us. In your holy name, we pray. Amen."]], "138": [["info", "Ascension Day"], ["watchO", "Watchword for Ascension Day — Christ said, “I, when I am lifted up from the earth, will draw all people to myself.” John 12:32"], ["specialVerse", "Ascension of the Lord", "Acts 1:1-11", "Psalm 47", "Ephesians 1:15-23", "Luke 24:44-53"], ["dateVerse", "Thursday, May 18", "Psalm 66:8–15", "Proverbs 11", "1 Corinthians 15:17–28"], ["watchD", "The human mind may devise many plans, but it is the purpose of the Lord that will be established. Proverbs 19:21"], ["docT", "So when they had come together, they asked Jesus, “Lord, is this the time when you will restore the kingdom to Israel?” He replied, “It is not for you to know the times or periods that the Father has set by his own authority. But you will receive power when the Holy Spirit has come upon you; and you will be my witnesses in Jerusalem, in all Judea and Samaria, and to the ends of the earth.” Acts 1:6-8"], ["prayer", "Savior, as your disciples witnessed your ascension into heaven, help us to witness your power over all areas of our lives. You came once as a tiny baby, but you will return to earth as a conquering king. We wait with expectation and hope for that glorious day. In your name, we pray. Amen!"]], "139": [["dateVerse", "Friday, May 19", "Psalm 66:16–20", "Proverbs 12", "1 Corinthians 15:29–41"], ["watchD", "This assembly may know that the Lord does not save by sword and spear. 1 Samuel 17:47"], ["docT", "Jesus said, “Whatever house you enter, first say, ‘Peace to this house!’” Luke 10:5"], ["prayer", "We ask for peace, Lord, inside our hearts, homes, and families, and outside in our communities and the world around us. We ask you to help us bring peace with open hands and hearts without the need for weapons. Replace our swords with baskets of good gifts from heaven to share with others. Lord Jesus, we ask this in your name. Amen."]], "140": [["dateVerse", "Saturday, May 20", "Psalm 67", "Proverbs 13", "1 Corinthians 15:42–58"], ["watchD", "I was ready to be sought out by those who did not ask, to be found by those who did not seek me. Isaiah 65:1"], ["docT", "But many who are first will be last, and the last will be first. Matthew 19:30"], ["prayer", "Lord, sometimes we are tempted to put ourselves first before all else, including you and others whom we should love as you love us. Help us remember that the Christian life isn’t about us. Help us to love you because you loved us first. Help us show the same love and forgiveness to others and to ourselves. In Jesus name, we pray. Amen. "]], "141": [["info", "Ascension Sunday"], ["watchO", "Watchword for the week — Cast all your anxiety on him, because he cares for you. 1 Peter 5:7"], ["dateVerse", "Sunday, May 21", "Acts 1:6-14", "Psalm 68:1-10,32-35", "1 Peter 4:12-14", "5:6-11", "John 17:1-11"], ["watchD", "Restore to me the joy of your salvation, and sustain in me a willing spirit. Psalm 51:12"], ["docT", "Are any among you suffering? They should pray. Are any cheerful? They should sing songs of praise. James 5:13"], ["prayer", "Pain and suffering are hard for us to handle alone, Lord. We need you and our fellow Christians to help carry the load. In good times and in bad, we will remember your presence and give you the offering of our praise. We find joy in your salvation and cheerfully give you—our creator, redeemer, and sustainer—our thanks and praise for blessings and mercy. Amen."]], "142": [["dateVerse", "Monday, May 22", "Psalm 68:1–6", "Proverbs 14", "1 Corinthians 16:1–11"], ["watchD", "So I commend enjoyment, for there is nothing better for people under the sun than to eat, and drink, and enjoy themselves, for this will go with them in their toil through the days of life that God gives them under the sun. Ecclesiastes 8:15"], ["docT", "Rejoice in the Lord always. Philippians 4:4"], ["prayer", "Creating God, help our voices praise you. Redeeming God, help us find the balance between work and rest. Sustaining God, bring joy to our hearts for every moment of our lives. Journeying God, help us walk with others, so that we can share what you have given us, and remember how you have been faithful in caring for all. Amen."]], "143": [["dateVerse", "Tuesday, May 23", "Psalm 68:7–18", "Proverbs 15", "1 Corinthians 16:12–24"], ["watchD", "You must therefore be careful to do as the Lord your God has commanded you; you shall not turn to the right or to the left. Deuteronomy 5:32"], ["docT", "Jesus said to him, “‘You shall love the Lord your God with all your heart, and with all your soul, and with all your mind.’ This is the greatest and first commandment. And a second is like it: ‘You shall love your neighbor as yourself.’” Matthew 22:37-39"], ["prayer", "God of love, help us remember to be love in action and in thought. Help us to depend upon you, and be willing to put into action what you have asked us to do. Help us feed hungry people; help us mend broken hearts. Help us be the mirror that other people look into to see your reflection. In your redeeming name, we pray. Amen."]], "144": [["dateVerse", "Wednesday, May 24", "Psalm 68:19–27", "Proverbs 16", "2 Corinthians 1:1–11"], ["watchD", "When my spirit grows faint within me, it is you who watch over my way. Psalm 142:3 NIV"], ["docT", "Come to me, all you that are weary and are carrying heavy burdens, and I will give you rest. Matthew 11:28"], ["prayer", "Lord, you are more than a security blanket. You are a watchtower and a resting place in our lives. We have nothing to fear, because you take care of us. Amen!"]], "145": [["dateVerse", "Thursday, May 25", "Psalm 68:28–35", "Proverbs 17", "2 Corinthians 1:12–22"], ["watchD", "But you, O Bethlehem of Ephrathah, who are one of the little clans of Judah, from you shall come forth for me one who is to rule in Israel, whose origin is from of old, from ancient days. Micah 5:2"], ["docT", "Without any doubt, the mystery of our religion is great: He was revealed in flesh, vindicated in spirit, seen by angels, proclaimed among Gentiles, believed in throughout the world, taken up in glory. 1 Timothy 3:16"], ["prayer", "Lord, sometimes we forget that Christmas, Good Friday, Easter, and Ascension Day are all parts of one story, but the story doesn’t end there. Your birth, life, death, burial, resurrection, and ascension are important because they happened for our salvation. We believe you are coming back for us and for the whole church. We thank you for that hope! Amen."]], "146": [["dateVerse", "Friday, May 26", "Psalm 69:1–12", "Proverbs 18", "2 Corinthians 1:23–2:13"], ["watchD", "The Lord our God is righteous in everything he does. Daniel 9:14 NIV"], ["docT", "God [did] prove at the present time that he himself is righteous and that he justifies the one who has faith in Jesus. Romans 3:25-26"], ["prayer", "Lord, there is nothing we can do to earn our salvation except to ask you to help our hearts believe in you and to put your teachings into practice. Thank you for giving us your hope, righteousness, and salvation. Amen!"]], "147": [["dateVerse", "Saturday, May 27", "Psalm 69:13–21", "Proverbs 19", "2 Corinthians 2:14–3:11"], ["watchD", "A faithful God, without deceit, just and upright is he. Deuteronomy 32:4"], ["docT", "And by this we know that he abides in us, by the Spirit that he has given us. 1 John 3:24"], ["prayer", "Thank you, Lord, for giving us your Spirit when you chose us to be your children. We praise you for bringing us into your family with common goals of preaching the gospel and bringing hope to the world. We thank you for the variety of gifts you give us to help work towards that goal. Thank you for the ongoing work of redemption and transformation into your image, through the Holy Spirit. We thank you for your unconditional love that never changes nor is hidden from us. Amen!"]], "148": [["info", "Day of Pentecost"], ["watchO", "Watchword for the week — Now there are varieties of gifts, but the same Spirit; and there are varieties of services, but the same Lord. "], ["info", "1 Corinthians 12:4,5"], ["dateVerse", "Sunday, May 28", "Acts 2:1-21", "Psalm 104:24-34,35b", "1 Corinthians 12:3b-13", "John 20:19-23"], ["watchD", "For I will be a wall of fire around [Jerusalem], says the Lord. Zechariah 2:5"], ["docT", "When the day of Pentecost had come, divided tongues, as of fire, appeared among them, and a tongue rested on each of them. All of them were filled with the Holy Spirit. Acts 2:1,3-4"], ["prayer", "Thank you for protecting us and keeping us safe, Lord. Help us spread the good news of great joy like a holy fire that lights our way and keeps us warm. Help us bring hope and light to the world around us in ways that people can understand for themselves. Fill us with your Spirit and enable us to offer protection and peace to others who need it. In your name, we pray. Amen."]], "149": [["dateVerse", "Monday, May 29", "Psalm 69:22–29", "Proverbs 20", "2 Corinthians 3:12–4:6"], ["watchD", "“The silver is mine, and the gold is mine,” says the Lord of hosts. Haggai 2:8"], ["docT", "Now the whole group of those who believed were of one heart and soul, and no one claimed private ownership of any possessions, but everything they owned was held in common. Acts 4:32"], ["prayer", "All that we have is really from you, Lord. Help us offer the first fruits of everything to you. We intentionally choose to be selfless and cheerful givers instead of selfish and cheerless hoarders of what we think we should have to live an abundant life. Help us and our fellow Christians meet the needs of the communities we live in. In Jesus’ name, we pray. Amen."]], "150": [["dateVerse", "Tuesday, May 30", "Psalm 69:30–36", "Proverbs 21", "2 Corinthians 4:7–18"], ["watchD", "Is the Lord’s arm too short? Numbers 11:23 NIV"], ["docT", "Jesus said, “Again, truly I tell you, if two of you agree on earth about anything you ask, it will be done for you by my Father in heaven.” Matthew 18:19"], ["prayer", "Sometimes we stumble and fall, Lord. Sometimes, we don’t forgive others the way you forgive us. But when you reach out to rescue us with a long, outstretched arm, it helps us to open our arms to those who need your forgiveness. Help us to be forgiving of each other and to live in peace and agreement with your plans for our lives. In awe of your name, we pray. Amen."]], "151": [["dateVerse", "Wednesday, May 31", "Psalm 70", "Proverbs 22", "2 Corinthians 5:1–15"], ["watchD", "You have turned my mourning into dancing; you have taken off my sackcloth and clothed me with joy. Psalm 30:11"], ["docT", "May the God of hope fill you with all joy and peace in believing, so that you may abound in hope by the power of the Holy Spirit. Romans 15:13"], ["prayer", "Sustaining and comforting Spirit, you fill us with joy, even when we mourn and grieve for losses we have faced. You replace the broken and shredded parts of our lives with complete and sturdy walls to support us through challenges. Your light is a beacon of hope for us to find our way back to you. Thank you for redeeming love that keeps us warm. Amen!"]], "152": [["dateVerse", "Thursday, June 1", "Psalm 71:1–8", "Proverbs 23", "2 Corinthians 5:16–6:2"], ["watchD", "He will swallow up death forever. Isaiah 25:8"], ["docT", "I want to know Christ and the power of his resurrection and the sharing of his sufferings by becoming like him in his death, if somehow I may attain the resurrection from the dead. Philippians 3:10-11"], ["prayer", "Dear God, may we partake of all the sufferings in our lives in humble obedience to you, and may we be increasingly transformed into the image of Jesus Christ, our Lord, in whose name we pray. Amen."]], "153": [["dateVerse", "Friday, June 2", "Psalm 71:9–18a", "Proverbs 24", "2 Corinthians 6:3–18"], ["watchD", "“In this place I will give peace,” says the Lord of hosts. Haggai 2:9 NKJV"], ["docT", "And let the peace of Christ rule in your hearts, to which indeed you were called in the one body. And be thankful. Colossians 3:15"], ["prayer", "Greatest Lord, you call us into community and bind us together as the body of Christ. Strengthen us to seek peace with one another and to act in love. Help us to not lose sight of your goodness. Accept our humble gratitude for all you give to us, for you have given us all. Amen. "]], "154": [["dateVerse", "Saturday, June 3", "Psalm 71:18b–24", "Proverbs 25", "2 Corinthians 7:1–13a"], ["watchD", "Behold, your King is coming to you; He is just and having salvation, lowly and riding on a donkey. Zechariah 9:9 NKJV"], ["docT", "Jesus said, “Blessed are the meek, for they will inherit the earth.” Matthew 5:5"], ["prayer", "Most Holy Lord our God, we confess that our desire for power and possessions separates us from you. We long for more, even as your son came riding on a donkey. Forgive us, we pray, and give us the faith to follow Jesus’ example of gentleness and strength for the sake of others. Amen. "]], "155": [["info", "Trinity Sunday"], ["watchO", "Watchword for the week — O Lord, our Sovereign, how majestic is your name in all the earth! Psalm 8:9"], ["dateVerse", "Sunday, June 4", "Genesis 1:1-2:4a", "Psalm 8", "2 Corinthians 13:11-13", "Matthew 28:16-20"], ["watchD", "The Lord is just in all his ways, and kind in all his doings. Psalm 145:17 "], ["docT", "I am confident of this, that the one who began a good work among you will bring it to completion by the day of Jesus Christ. Philippians 1:6"], ["prayer", "You are God the creator, from whom all blessings flow. You are Christ the savior of the world, by whose blood we are set free. You are the Spirit of truth and love, through whom we can fulfill your calling for our lives. Eternal Trinity, we praise and adore you forever. Amen."]], "156": [["dateVerse", "Monday, June 5", "Psalm 72:1–11", "Proverbs 26", "2 Corinthians 7:13b–8:9"], ["watchD", "Fathers make known to children your faithfulness. Isaiah 38:19"], ["docT", "As you therefore have received Christ Jesus the Lord, continue to live your lives in him, rooted and built up in him and established in the faith, just as you were taught, abounding in thanksgiving. Colossians 2:6-7"], ["prayer", "Loving God, we have received all we need to live a life worthy of Christ Jesus. Help us, we pray, to center our lives on him and to reflect his love in who we are and all we do. Amen. "]], "157": [["dateVerse", "Tuesday, June 6", "Psalm 72:12–20", "Proverbs 27", "2 Corinthians 8:10–21"], ["watchD", "Out of the ground the Lord God formed every animal of the field and every bird of the air, and brought them to the man. The man gave names to [all]. Genesis 2:19,20"], ["docT", "Are not five sparrows sold for two pennies? Yet not one of them is forgotten in God’s sight. Luke 12:6"], ["prayer", "Almighty God, how lucky we are to live in your world and to be your beloved children. May we do all within our power to care for your precious creation just as you care so tenderly for us. Amen."]], "158": [["dateVerse", "Wednesday, June 7", "Psalm 73:1–12", "Proverbs 28", "2 Corinthians 8:22–9:9"], ["watchD", "You must follow exactly the path that the Lord your God has commanded you, so that you may live. Deuteronomy 5:33"], ["docT", "For whatever was written in former days was written for our instruction, so that by steadfastness and by the encouragement of the scriptures we might have hope. Romans 15:4"], ["prayer", "Heavenly Father, you are the way and yet we wander, looking for fulfillment everywhere but through you. Help us to surrender ourselves to you and to listen for your direction. Guide us to your holy word so that we may live the lives you would have us live, always hoping in Christ Jesus, our Lord, in whose name, we pray. Amen. "]], "159": [["dateVerse", "Thursday, June 8", "Psalm 73:13–20", "Proverbs 29", "2 Corinthians 9:10–10:6"], ["watchD", "Boaz said to Ruth, “May you have a full reward from the Lord, under whose wings you have come for refuge!” Ruth 2:12"], ["docT", "Christ came and proclaimed peace to you who were far off and peace to those who were near. Ephesians 2:17"], ["prayer", "You are the author of all that is good, dear Lord, our ever-present source of comfort and strength. Use our lives, we pray, to be instruments of your peace and healing. Amen. "]], "160": [["dateVerse", "Friday, June 9", "Psalm 73:21–28", "Proverbs 30", "2 Corinthians 10:7–18"], ["watchD", "The Lord your God turned the curse into a blessing for you, because the Lord your God loved you. Deuteronomy 23:5"], ["docT", "Regard the patience of our Lord as salvation. 2 Peter 3:15"], ["prayer", "Glorious God, we thank you for your love, unconditional and eternal. We thank you for salvation, full and free. We thank you for the assurance that nothing can separate us from you. Keep us close, we pray, as we strive to live so that we are worthy to stand before Jesus when he comes. Amen. "]], "161": [["dateVerse", "Saturday, June 10", "Psalm 74:1–9", "Proverbs 31", "2 Corinthians 11:1–11"], ["watchD", "I will satisfy the weary, and all who are faint I will replenish. Jeremiah 31:25"], ["docT", "Jesus said, “Blessed are the poor in spirit, for theirs is the kingdom of heaven.” Matthew 5:3"], ["prayer", "You are the strength of your people, O Lord; your goodness and love made us alive when we were dead. Help us to turn to you when we are worn down. Keep us from pride and give us humble and grateful hearts. Amen."]], "162": [["info", "Second Sunday after Pentecost"], ["watchO", "Watchword for the week — God desires steadfast love and not sacrifice, the knowledge of God rather than burnt offerings. Hosea 6:6"], ["dateVerse", "Sunday, June 11", "Hosea 5:15-6:6", "Psalm 50:7-15", "Romans 4:13-25", "Matthew 9:9-13,18-26"], ["watchD", "Turn back to the Lord whom you have deeply betrayed. Isaiah 31:6"], ["docT", "The saying is sure and worthy of full acceptance, that Christ Jesus came into the world to save sinners. 1 Timothy 1:15"], ["prayer", "We confess to you, merciful Savior, that our sins are many. Daily we fail to live as your children and to obey your word. Forgive us, we humbly pray, and hear now our shouts of joy for the salvation we receive through Jesus Christ, our Lord. Amen.  "]], "163": [["dateVerse", "Monday, June 12", "Psalm 74:10–17", "Ecclesiastes 1:1–3:8", "2 Corinthians 11:12–15"], ["watchD", "Consider my affliction and my trouble, and forgive all my sins. Psalm 25:18"], ["docT", "Just so, I tell you, there will be more joy in heaven over one sinner who repents than over ninety-nine righteous persons who need no repentance. Luke 15:7"], ["prayer", "Redeemer God, we kneel before you burdened and broken. Like David, we are aware of our sins and pray for mercy. Help us to live in the radiance of your forgiveness through Christ, in whose name we pray. Amen."]], "164": [["dateVerse", "Tuesday, June 13", "Psalm 74:18–23", "Ecclesiastes 3:9–5:20", "2 Corinthians 11:16–33"], ["watchD", "And now, therefore, let the power of the Lord be great in the way that you promised. Numbers 14:17"], ["docT", "Mary said, “The Mighty One has done great things for me, and holy is his name.” Luke 1:49"], ["prayer", "Heavenly Father, we recognize the wondrous ways you are at work in our lives from the rising of the sun to the place where it sets. With gratitude and awe, we praise your most mighty and holy name. Amen. "]], "165": [["dateVerse", "Wednesday, June 14", "Psalm 75", "Ecclesiastes 6:1–7:14", "2 Corinthians 12:1–13"], ["watchD", "My soul will boast in the Lord; let the afflicted hear and rejoice. Psalm 34:2 NIV"], ["docT", "Rejoice. Let your gentleness be known to everyone. The Lord is near. Philippians 4:4,5"], ["prayer", "With our whole hearts we sing to you, O God, for sending Jesus to show us how to live. May the joy we feel because of his presence be evident in all we do. Amen."]], "166": [["dateVerse", "Thursday, June 15", "Psalm 76", "Ecclesiastes 7:15–9:18", "2 Corinthians 12:14–13:4"], ["watchD", "“‘I will not hide my face from them anymore; for I shall have poured out my Spirit on the house of Israel,’ says the Lord God.” Ezekiel 39:29 NKJV"], ["docT", "It is that very Spirit bearing witness with our spirit that we are children of God. Romans 8:16"], ["prayer", "Holy Spirit, we thank you for the many ways you mold and transform us, and for your assurance that we are children of God. Bring us ever closer and guide us in the ways in which we should live as God’s family. Amen. "]], "167": [["dateVerse", "Friday, June 16", "Psalm 77:1–9", "Ecclesiastes 10:1–12:14", "2 Corinthians 13:5–13"], ["watchD", "Far be it from us that we should rebel against the Lord, and turn away this day from following the Lord. Joshua 22:29"], ["docT", "Let us consider not neglecting to meet together, as is the habit of some, but encouraging one another. Hebrews 10:25"], ["prayer", "Lord, we confess that we often stray. We follow our own desires. We isolate ourselves. We fail to uplift others. Have mercy on us, O God, and bring us closer to one another as we strive to draw closer to you. Amen."]], "168": [["dateVerse", "Saturday, June 17", "Psalm 77:10–15", "Song of Solomon 1:1–2:7", "Galatians 1:1–12"], ["watchD", "The mighty one, God the Lord, speaks and summons the earth from the rising of the sun to its setting. Psalm 50:1"], ["docT", "Jesus said, “The kingdom of God is not coming with things that can be observed; nor will they say, ‘Look, here it is!’ or ‘There it is!’ For, in fact, the kingdom of God is among you.” Luke 17:20-21"], ["prayer", "You call to us, sovereign God, and we wake to hear you. Open our ears to listen for your voice through Jesus Christ, our Lord, who lives among us, and is our hope now and always. Amen."]], "169": [["info", "Third Sunday after Pentecost"], ["watchO", "Watchword for the week — The Lord is good; his steadfast love endures forever, and his faithfulness to all generations. Psalm 100:5"], ["dateVerse", "Sunday, June 18", "Exodus 19:2-8a", "Psalm 100", "Romans 5:1-8", "Matthew 9:35-10:8,(9-23)"], ["watchD", "The heavens are yours, the earth also is yours; the world and all that is in it—you have founded them. The north and the south—you created them. Psalm 89:11-12"], ["docT", "All things have been created through Christ and for him. He himself is before all things, and in him all things hold together. Colossians 1:16-17"], ["prayer", "Creator God, sometimes we forget that all things are made by you, and that we need to care for it as a precious gift. Show us how to honor and care for your world; empower us to act for the good of all. May we follow your lead and love your creation as much as you do. In Jesus’ name, we pray. Amen. "]], "170": [["dateVerse", "Monday, June 19", "Psalm 77:16–20", "Song of Solomon 2:8–4:16", "Galatians 1:13–24"], ["watchD", "All who forsake you shall be put to shame; for they have forsaken the fountain of living water, the Lord. Jeremiah 17:13"], ["docT", "God said, “To the thirsty I will give water as a gift from the spring of the water of life.” Revelation 21:6"], ["prayer", "Holy One, we give you thanks for your saving water of life, a free gift of your grace. Remind us today, Lord, that you alone will quench our thirst, and give us bodies and souls willing to take a drink. Amen. "]], "171": [["dateVerse", "Tuesday, June 20", "Psalm 78:1–8", "Song of Solomon 5,6", "Galatians 2:1–14"], ["watchD", "The Lord will regard the prayer of the destitute, and will not despise their prayer. Psalm 102:17"], ["docT", "Do not worry about anything, but in everything by prayer and supplication with thanksgiving let your requests be made known to God. Philippians 4:6"], ["prayer", "Lord, we call on you today. You know what is on our minds and we bring those concerns to you. You hear us and care for us, and we thank you for how you are at work in our lives. We will strive to focus not on our anxieties, but on your presence and peace. Amen."]], "172": [["dateVerse", "Wednesday, June 21", "Psalm 78:9–16", "Song of Solomon 7,8", "Galatians 2:15–3:5"], ["watchD", "Relieve the troubles of my heart, and bring me out of my distress. Psalm 25:17"], ["docT", "Jesus said, “In this world you will have trouble. But take heart! I have overcome the world.” John 16:33 NIV"], ["prayer", "Lamb of God, we can face anything because your victory is our victory. Thank you that we have nothing to fear with you as our savior. May our hearts rest in you, in whose name we pray. Amen. "]], "173": [["dateVerse", "Thursday, June 22", "Psalm 78:17–31", "Isaiah 1", "Galatians 3:6–18"], ["watchD", "Lord, remember and do not break your covenant with us. Jeremiah 14:21"], ["docT", "God is faithful; by him you were called into the fellowship of his Son, Jesus Christ our Lord. 1 Corinthians 1:9"], ["prayer", "Faithful God, we give thanks that you are the same yesterday, today, and forever. We rejoice that you call us into fellowship with your son, our Lord Jesus Christ, and pray that we may remember who we are in him. Amen."]], "174": [["dateVerse", "Friday, June 23", "Psalm 78:32–39", "Isaiah 2:1–4:1", "Galatians 3:19–29"], ["watchD", "The Lord said to Moses, “All the people among whom you live shall see the work of the Lord.” Exodus 34:10"], ["docT", "Jesus went throughout Galilee, teaching in their synagogues and proclaiming the good news of the kingdom and curing every disease and every sickness among the people. Matthew 4:23"], ["prayer", "Amazing Lord Jesus, you blessed the world with your teaching, preaching, and healing. May we follow your example and look to ease suffering, offer care, and share the good news wherever we go. In your holy name, we pray. Amen. "]], "175": [["dateVerse", "Saturday, June 24", "Psalm 78:40–55", "Isaiah 4:2–5:30", "Galatians 4:1–16"], ["watchD", "He has told you, O mortal, what is good; and what does the Lord require of you but to do justice, and to love kindness, and to walk humbly with your God? Micah 6:8"], ["docT", "Let the same mind be in you that was in Christ Jesus. Philippians 2:5"], ["prayer", "What you ask of us is simple, O God, and you have shown us what is good; still, we need your help to do what is required. Give us the strength and compassion to have the same mind as Jesus: showing concern for all people, offering ourselves in service to everyone, and relying totally on you. Amen. "]], "176": [["info", "Fourth Sunday after Pentecost"], ["watchO", "Watchword for the week — Jesus said, “Those who find their life "], ["info", "will lose it, and those who lose their life for my sake will find it.” Matthew 10:39"], ["dateVerse", "Sunday, June 25", "Jeremiah 20:7-13", "Psalm 69:7-10,(11-15)16-18", "Romans 6:1b-11", "Matthew 10:24-39"], ["watchD", "The revelation awaits an appointed time; though it lingers, wait for it. Habakkuk 2:3 NIV"], ["docT", "Therefore be serious and discipline yourselves for the sake of your prayers. Above all, maintain constant love for one another. 1 Peter 4:7-8"], ["prayer", "Everlasting God, as we wait patiently for what lies beyond the trials and struggles of this life, may we do so as the body of Christ, trusting in you and loving one another fully. Amen."]], "177": [["dateVerse", "Monday, June 26", "Psalm 78:56–64", "Isaiah 6,7", "Galatians 4:17–27"], ["watchD", "Even though I walk through the darkest valley, I fear no evil; for you are with me; your rod and your staff—they comfort me. Psalm 23:4"], ["docT", "We are afflicted in every way, but not crushed; perplexed, but not driven to despair; persecuted, but not forsaken; struck down, but not destroyed. 2 Corinthians 4:8-9"], ["prayer", "Great Shepherd, we give you thanks for walking with us every moment of our lives, and for lifting us from the despairs of this world. May we find true comfort and peace in you, our ever-present Lord and Savior. Amen. "]], "178": [["dateVerse", "Tuesday, June 27", "Psalm 78:65–72", "Isaiah 8:1–9:7", "Galatians 4:28–5:6"], ["watchD", "Then all flesh shall know that I am the Lord your Savior, and your Redeemer. Isaiah 49:26"], ["docT", "Jesus said, “All authority in heaven and on earth has been given to me. Go therefore and make disciples of all nations, baptizing them in the name of the Father and of the Son and of the Holy Spirit, and teaching them to obey everything that I have commanded you.” Matthew 28:18-20"], ["prayer", "It is our desire to know you, Savior and Redeemer, and to become your true disciples. Make us willing to learn, we pray, so that we may grow closer to you. Strengthen us for the important work of spreading your gospel, so that all the world may know of your love. Amen. "]], "179": [["dateVerse", "Wednesday, June 28", "Psalm 79:1–8", "Isaiah 9:8–10:11", "Galatians 5:7–18"], ["watchD", "I give thanks to your name for your steadfast love and your faithfulness; for you have exalted your name and your word above everything. Psalm 138:2"], ["docT", "You have been born anew, not of perishable but of imperishable seed, through the living and enduring word of God. 1 Peter 1:23"], ["prayer", "We bow before you, O Lord, grateful recipients of your steadfast love and faithfulness. We lift your name above all others, unworthy recipients of a new life in Christ Jesus. We thank you and put all our hope in you, our eternal God, world without end. Amen. "]], "180": [["dateVerse", "Thursday, June 29", "Psalm 79:9–13", "Isaiah 10:12–11:9", "Galatians 5:19–6:5"], ["watchD", "The Lord is with me as a mighty, awesome One. Jeremiah 20:11 NKJV"], ["docT", "I am grateful to Christ Jesus our Lord, who has strengthened me, because he judged me faithful. 1 Timothy 1:12"], ["prayer", "We praise your name, O God, our protector and defender, and give you thanks for the gift of your son, Jesus Christ, who leads, strengthens, and redeems us. We offer ourselves to you today, that we may be used for your glory. Amen. "]], "181": [["dateVerse", "Friday, June 30", "Psalm 80:1–7", "Isaiah 11:10–13:22", "Galatians 6:6–18"], ["watchD", "When people fall, do they not get up again? If they go astray, do they not turn back? Jeremiah 8:4"], ["docT", "The apostles said to the Lord, “Increase our faith!” Luke 17:5"], ["prayer", "Almighty God, we confess our sins before you this day. Forgive us and turn us toward you, we pray. Just as your apostles asked, we ask you to increase our faith, so that we too may experience your abundant acts of grace and love. In Jesus’ name, we pray. Amen. "]], "182": [["dateVerse", "Saturday, July 1", "Psalm 80:8–11", "Isaiah 14", "Ephesians 1:1–10"], ["watchD", "Lord, to you I have committed my cause. Jeremiah 11:20"], ["docT", "Jesus said, “Your will be done, on earth as it is in heaven.” Matthew 6:10"], ["prayer", "Faithful Guide, you lead us through lush, green pastures, and thorny briar patches. Give us ears to listen for your voice, eyes to see your path, and faith to trust them both. Amen."]], "183": [["info", "Fifth Sunday after Pentecost"], ["watchO", "Watchword for the week — Happy are the people who know the festal shout, who walk, O Lord, in the light of your countenance. Psalm 89:15"], ["dateVerse", "Sunday, July 2", "Jeremiah 28:5-9", "Psalm 89:1-4,15-18", "Romans 6:12-23", "Matthew 10:40-42"], ["watchD", "The earth, O Lord, is full of your steadfast love; teach me your statutes. Psalm 119:64"], ["docT", "In everything do to others as you would have them do to you; for this is the law and the prophets. Matthew 7:12"], ["prayer", "Teacher, your laws are easy to understand but hard for us to live up to—to treat others better than we treat ourselves and to love you most of all. We are trying. Help us to do better. Amen."]], "184": [["dateVerse", "Monday, July 3", "Psalm 80:12–19", "Isaiah 15,16", "Ephesians 1:11–23"], ["watchD", "Bless the Lord, O my soul, and do not forget all his benefits. Psalm 103:2"], ["docT", "Give thanks in all circumstances; for this is the will of God in Christ Jesus for you. 1 Thessalonians 5:18"], ["prayer", "Gracious Lord, how great are your gifts! Let the praises that flow from our lips serve as the thank you note that we so often forget to send to you. Though we don’t always act like it, we are grateful. Help us to show our gratitude to you through our loving actions toward others. Amen."]], "185": [["dateVerse", "Tuesday, July 4", "Psalm 81:1–5", "Isaiah 17:1–19:17", "Ephesians 2:1–10"], ["watchD", "Those of steadfast mind you keep in peace—in peace because they trust in you. Isaiah 26:3"], ["docT", "Now it is God who makes both us and you stand firm in Christ. 2 Corinthians 1:21 NIV"], ["prayer", "Good Shepherd, we are safe with you. You guide, protect, and comfort us—and you will do the same for all you have created. Help us to welcome all into the safety of your fold, to throw wide the gates of your pasture and call out to everyone, shouting, “Come in! Come in! It is safe here!” Amen."]], "186": [["dateVerse", "Wednesday, July 5", "Psalm 81:6–10", "Isaiah 19:18–22:14", "Ephesians 2:11–22"], ["watchD", "I the Lord do not change. Malachi 3:6"], ["docT", "His mercy is for those who fear him from generation to generation. Luke 1:50"], ["prayer", "God of Abraham, you know us—every hair, every freckle. You don’t change, but we do. We get older, day by day—new lines, new spots. Yet you still know us—every hair, every freckle. What a gift it is to be known by you. Amen."]], "187": [["specialVerse", "John Hus Festival†", "Isaiah 49:1-7", "Psalm 135:1-13", "1 Corinthians 1:18-24", "Mark 8:34-38"], ["dateVerse", "Thursday, July 6", "Psalm 81:11–16", "Isaiah 22:15–23:18", "Ephesians 3:1–13"], ["watchD", "To you, O Lord, I lift up my soul. O my God, in you I trust; do not let me be put to shame. Psalm 25:1-2"], ["docT", "Zacchaeus wanted to see who Jesus was. Luke 19:3 NIV"], ["prayer", "Lord Jesus, we pray as Hus prayed, ‘O Christ, Son of the living God, have mercy on me.’ Hear us, Son of David. Amen."], ["info", "†On July 6, 1415, John Hus was martyred at the Council of Constance."]], "188": [["dateVerse", "Friday, July 7", "Psalm 82:1–4", "Isaiah 24,25", "Ephesians 3:14–4:6"], ["watchD", "You have set our iniquities before you, our secret sins in the light of your countenance. Psalm 90:8"], ["docT", "And forgive us our debts, as we also have forgiven our debtors. Matthew 6:12"], ["prayer", "Forgiving God, you have released us from all we owe. How glorious it is to live debt-free! Give us grace to release others in the same way, so that everyone may know the freedom of living without owing anything! Amen."]], "189": [["dateVerse", "Saturday, July 8", "Psalm 82:5–8", "Isaiah 26,27", "Ephesians 4:7–16"], ["watchD", "The memory of the righteous is a blessing. Proverbs 10:7"], ["docT", "Do not become sluggish, but imitate those who through faith and patience inherit the promises. Hebrews 6:12 NKJV"], ["prayer", "Spirit of love, our days are numbered. Help us to use each and every one of them for your purposes. From baptism to burial, equip us to make the most of the time you have given us. Moment by moment, we are yours. Amen."]], "190": [["info", "Sixth Sunday after Pentecost"], ["watchO", "Watchword for the week — The Lord is gracious and merciful, slow to anger and abounding in steadfast love. Psalm 145:8"], ["dateVerse", "Sunday, July 9", "Zechariah 9:9-12", "Psalm 145:8-14", "Romans 7:15-25a", "Matthew 11:16-19,25-30"], ["watchD", "Their congregation shall be established before me. Jeremiah 30:20"], ["docT", "Paul wrote: If then there is any encouragement in Christ, any consolation from love, any sharing in the Spirit, any compassion and sympathy, make my joy complete: be of the same mind, having the same love, being in full accord and of one mind. Philippians 2:1-2"], ["prayer", "Welcoming God, we come into your house like children who have been away from home far too long. As we knew you would, you wrap us up in arms of welcome and acceptance. On the table sit our favorite dishes; our bed is made with fresh linens. How wonderful it is to be home—with you! Amen. "]], "191": [["dateVerse", "Monday, July 10", "Psalm 83:1–8", "Isaiah 28", "Ephesians 4:17–28"], ["watchD", "O come, let us worship and bow down, let us kneel before the Lord, our Maker! Psalm 95:6"], ["docT", "To the King of the ages, immortal, invisible, the only God, be honor and glory forever and ever. 1 Timothy 1:17"], ["prayer", "King of creation, we stand in awe of your creativity. All around us are bursts of color and light that you have knit together in patterns we could never have imagined: symmetry and sequence, spirals and stripes. Animals and plants proclaim your imagination and, along with them, we praise you for your clever artistry. Amen."]], "192": [["dateVerse", "Tuesday, July 11", "Psalm 83:9–12", "Isaiah 29", "Ephesians 4:29–5:7"], ["watchD", "There is nothing better than that all should enjoy their work, for that is their lot. Ecclesiastes 3:22"], ["docT", "Whatever you do, in word or deed, do everything in the name of the Lord Jesus, giving thanks to God the Father through him. Colossians 3:17"], ["prayer", "Merciful Lord, we have much to do: redeem the wrongfully accused, bring justice to the oppressed, free the captives, provide for those in need. It’s quite a to-do list, but with your help, we’ll do all we can. In Jesus’ name, we pray. Amen."]], "193": [["dateVerse", "Wednesday, July 12", "Psalm 83:13–18", "Isaiah 30,31", "Ephesians 5:8–20"], ["watchD", "Spare your people, O Lord, and do not make your heritage a mockery. Joel 2:17"], ["docT", "Christ gave himself for us that he might redeem us from all iniquity and purify for himself a people of his own who are zealous for good deeds. Titus 2:14"], ["prayer", "Loving Redeemer, the price you paid for us was so high, we will never understand it. By your wounds, you have healed and restored us to your service. May we fix our eyes on you, so that we can prove to be worthy of your sacrifice. Amen."]], "194": [["dateVerse", "Thursday, July 13", "Psalm 84:1–7", "Isaiah 32:1–33:16", "Ephesians 5:21–33"], ["watchD", "Reuben said to his brothers, “Shed no blood.” Genesis 37:22"], ["docT", "Always strive to do what is good for each other and for everyone else. 1 Thessalonians 5:15 NIV"], ["prayer", "Peace-giving God, we know that there is never a time when violence is helpful. We will neither shed blood nor harm others. Help us in this commitment—bringing peace to our woeful world and healing to hearts torn by violence. Make us instruments of your perfect peace. Amen."]], "195": [["dateVerse", "Friday, July 14", "Psalm 84:8–12", "Isaiah 33:17–35:10", "Ephesians 6:1–9"], ["watchD", "You are a people holy to the Lord your God; it is you the Lord has chosen out of all the peoples on earth to be his people, his treasured possession. Deuteronomy 14:2"], ["docT", "For you are all children of light and children of the day; we are not of the night or of darkness. 1 Thessalonians 5:5"], ["prayer", "Light of the universe, you have chosen us to reflect your light into a darkened world. Make us shine brightly with your love for us and with our love for each other. Amen."]], "196": [["dateVerse", "Saturday, July 15", "Psalm 85:1–7", "Isaiah 36:1–37:13", "Ephesians 6:10–24"], ["watchD", "God saw my affliction and the labor of my hands. Genesis 31:42"], ["docT", "Paul wrote: You know that in the Lord your labor is not in vain. 1 Corinthians 15:58"], ["prayer", "Holy Master, sometimes it seems the laborers are very few. The field is ripe, and we are willing to work, Lord, but it can be discouraging when we think we are working the rows alone. Send us co-laborers to share in the jobs that must be done, so we can work cheerfully together to further your Kin-dom. Amen."]], "197": [["info", "Seventh Sunday after Pentecost"], ["watchO", "Watchword for the week — There is therefore now no condemnation for those who are in Christ Jesus. Romans 8:1"], ["dateVerse", "Sunday, July 16", "Isaiah 55:10-13", "Psalm 65:(1-8),9-13", "Romans 8:1-11", "Matthew 13:1-9,18-23"], ["watchD", "The Lord God will wipe away the tears from all faces. Isaiah 25:8"], ["docT", "Jesus said, “Your grief will turn to joy.” John 16:20 NIV"], ["prayer", "Divine Comforter, sometimes tears overtake us in the strangest places. We weep for those we have lost through distance, or death, or destroyed relationships. Our broken hearts cry out to you. Thank you for being the shoulder we can always cry upon, and the friend whom we can always count on. Amen."]], "198": [["dateVerse", "Monday, July 17", "Psalm 85:8–13", "Isaiah 37:14–38", "Philippians 1:1–11"], ["watchD", "Though I write the multitude of my instructions, they are regarded as a strange thing. Hosea 8:12"], ["docT", "Jesus said, “Everyone then who hears these words of mine and acts on them will be like a wise man who built his house on rock.” Matthew 7:24"], ["prayer", "Holy Mystery, we plant seeds for trees under whose shade we may never sit. Water them and fertilize them, groom them and grow them for your glory. Your Kin-dom come, your will be done. Amen."]], "199": [["dateVerse", "Tuesday, July 18", "Psalm 86:1–10", "Isaiah 38:1–40:5", "Philippians 1:12–22"], ["watchD", "Praise him for his acts of power; praise him for his surpassing greatness. Psalm 150:2 NIV"], ["docT", "Ever since the creation of the world his eternal power and divine nature, invisible though they are, have been understood and seen through the things he has made. Romans 1:20"], ["prayer", "Imaginative Creator, we marvel at the great things you have created and repent for the damage we have done to them. We commit to do better, to become more conscientious caregivers, and to encourage others to do the same. Make us a blessing to the earth and to you. Amen."]], "200": [["dateVerse", "Wednesday, July 19", "Psalm 86:11–17", "Isaiah 40:6–41:7", "Philippians 1:23–2:4"], ["watchD", "God, remember your congregation, which you acquired long ago, which you redeemed to be the tribe of your heritage. Psalm 74:2"], ["docT", "Jesus said, “For where two or three are gathered in my name, I am there among them.” Matthew 18:20"], ["prayer", "God, whether we gather online, in-person, or outdoors, we know you are with us. Thank you for your everlasting-presence that can transcend any form of communication. Be present in our pews, our classrooms, and our virtual spaces. Amen."]], "201": [["dateVerse", "Thursday, July 20", "Psalm 87", "Isaiah 41:8–42:9", "Philippians 2:5–18"], ["watchD", "My salvation and my honor depend on God. Psalm 62:7 NIV"], ["docT", "Jesus said to her, “Daughter, your faith has made you well; go in peace.” Luke 8:48"], ["prayer", "Lover of our souls, how is it that you cherish even us?  We cannot be completely faithful nor completely good, yet you make us well. You send us forth in the peace of your love. Our wandering hearts rest in you. Amen."]], "202": [["dateVerse", "Friday, July 21", "Psalm 88:1–5", "Isaiah 42:10–43:21", "Philippians 2:19–30"], ["watchD", "When the song was raised, with trumpets and cymbals and other musical instruments, in praise to the Lord, “For he is good, for his steadfast love endures forever,” the glory of the Lord filled the house of God. 2 Chronicles 5:13,14"], ["docT", "The holy city, the new Jerusalem, has no need of sun or moon to shine on it, for the glory of God is its light, and its lamp is the Lamb. Revelation 21:2,23"], ["prayer", "Blessed Architect, what a home you have prepared for us! The light never dims, the music never ends. In it is found no evil, nor darkness, nor crying, nor pain. Best of all, we will be with you. Prepare our hearts for the day when we become heavenly citizens. Amen."]], "203": [["dateVerse", "Saturday, July 22", "Psalm 88:6–12", "Isaiah 43:22–44:23", "Philippians 3:1–11"], ["watchD", "This is the Lord for whom we have waited; let us be glad and rejoice in his salvation. Isaiah 25:9"], ["docT", "Now faith is the assurance of things hoped for, the conviction of things not seen. Hebrews 11:1 "], ["prayer", "Wounded Healer, you never lead us with guilt, shame, or fear, but with your persistent love. May we be leaders who model your style, drawing others closer to you through loving kindness. Amen."]], "204": [["info", "Eighth Sunday after Pentecost"], ["watchO", "Watchword for the week — Thus says the Lord, the King of Israel, and his Redeemer, the Lord of hosts: I am the first and I am the last; besides me there is no god. Isaiah 44:6"], ["dateVerse", "Sunday, July 23", "Isaiah 44:6-8", "Psalm 86:11-17", "Romans 8:12-25", "Matthew 13:24-30,36-43"], ["watchD", "You bless the righteous, O Lord; you cover them with favor as with a shield. Psalm 5:12"], ["docT", "The one who was born of God protects them, and the evil one does not touch them. 1 John 5:18"], ["prayer", "Lord, we will lie down in peace and rest in safety for you are our ever-present protector. Whether we are threatened by foes real or imagined, we will rest in the shadow of your wings. Nightmares have no power over us when you stand ready to scatter them away. When morning comes, we will thank you for never leaving us. Amen."]], "205": [["dateVerse", "Monday, July 24", "Psalm 88:13–18", "Isaiah 44:24–45:25", "Philippians 3:12–4:1"], ["watchD", "He leads me in right paths for his name’s sake. Psalm 23:3"], ["docT", "I am the good shepherd. I know my own and my own know me. John 10:14"], ["prayer", "Good Shepherd, when we look around, we see fellow sheep of all shapes, colors, and sizes. Help us to feel welcome with our sisters and brothers, and to welcome others. We are all yours. Amen."]], "206": [["dateVerse", "Tuesday, July 25", "Psalm 89:1–8", "Isaiah 46:1–48:6", "Philippians 4:2–13"], ["watchD", "I will thank you in the great congregation; in the mighty throng I will praise you. Psalm 35:18"], ["docT", "Sing psalms and hymns and spiritual songs among yourselves, singing and making melody to the Lord in your hearts. Ephesians 5:19"], ["prayer", "True Foundation, we fling wide open the doors of our churches, so all may come in and join us in our praise of you. We will not bar the doors to anyone and if they do not come to us, we will go to them. Make us your messengers. Amen."]], "207": [["dateVerse", "Wednesday, July 26", "Psalm 89:9–18", "Isaiah 48:7–49:21", "Philippians 4:14–23"], ["watchD", "[Adam and Eve] hid themselves from the presence of the Lord God. Genesis 3:8"], ["docT", "There is no fear in love, but perfect love casts out fear. 1 John 4:18"], ["prayer", "Lord God, we admit that sometimes we are afraid of you. We hide from your presence and cower in fear—behind our work, behind our piety, behind our self-righteousness. Amen."]], "208": [["dateVerse", "Thursday, July 27", "Psalm 89:19–29", "Isaiah 49:22–51:16", "Colossians 1:1–14"], ["watchD", "I, I am the Lord, and besides me there is no savior. Isaiah 43:11"], ["docT", "And this is eternal life, that they may know you, the only true God, and Jesus Christ whom you have sent. John 17:3"], ["prayer", "God, we are listening. Meet us in the silence...Amen."]], "209": [["dateVerse", "Friday, July 28", "Psalm 89:30–37", "Isaiah 51:17–53:12", "Colossians 1:15–27"], ["watchD", "You who love the Lord, hate evil! Psalm 97:10 NKJV"], ["docT", "You cannot serve God and wealth. Matthew 6:24"], ["prayer", "God, we abhor the things that hurt your beloved children: poverty, violence, racism, hatred. Make us agents to stop them. Enable us to bind up the wounded and the hurting and carry them to you. Amen."]], "210": [["dateVerse", "Saturday, July 29", "Psalm 89:38–45", "Isaiah 54,55", "Colossians 1:28–2:10"], ["watchD", "In the day of my trouble I seek the Lord; in the night my hand is stretched out without wearying. Psalm 77:2"], ["docT", "Jesus said to the disciples, “I am deeply grieved, even to death; remain here, and stay awake with me.” And going a little farther, he threw himself on the ground and prayed. Matthew 26:38-39"], ["prayer", "Rabbi, we will pray with you. We are sleepy, and we are weary, but we love you too much to leave you alone. We will cry out through the night. “Abba! Father! Hear us!” Amen."]], "211": [["info", "Ninth Sunday after Pentecost"], ["watchO", "Watchword for the week — God, turn to me and be gracious to me, as is your custom toward those who love your name. Psalm 119:132"], ["dateVerse", "Sunday, July 30", "1 Kings 3:5-12", "Psalm 119:129-136", "Romans 8:26-39", "Matthew 13:31-33,44-52"], ["watchD", "When I told of my ways, you answered me; teach me your statutes. Psalm 119:26"], ["docT", "If we know that he hears us in whatever we ask, we know that we have obtained the requests made of him. 1 John 5:15"], ["prayer", "Precious Friend, wherever you would have us go, we will go. Whatever you would have us do, we will do. Whomever you would have us welcome, we will receive. We ask only that you reveal yourself and your will to us. In Jesus’ name, we pray. Amen."]], "212": [["dateVerse", "Monday, July 31", "Psalm 89:46–52", "Isaiah 56,57", "Colossians 2:11–23"], ["watchD", "Do not remember the sins of my youth or my transgressions; according to your steadfast love remember me, for your goodness’ sake, O Lord! Psalm 25:7"], ["docT", "Jesus said to Nicodemus, “Do not be astonished that I said to you, ‘You must be born from above.’” John 3:7"], ["prayer", "We thank you, gracious God, for the gift of water. Send your Spirit upon us. Bring us into your covenant. We are beloved because you have called us so. Every time we touch the water, may we be reminded of your promise. Amen. "]], "213": [["dateVerse", "Tuesday, August 1", "Psalm 90", "Isaiah 58,59", "Colossians 3:1–11"], ["watchD", "For me it is good to be near God; I have made the Lord God my refuge, to tell of all your works. Psalm 73:28"], ["docT", "He entered the temple with [Peter and John], walking and leaping and praising God. Acts 3:8"], ["prayer", "God, when we talk about you and your goodness, we do feel closer to you and know you as our strength and our refuge. May we never keep to ourselves what we have experienced of your love and your care. Amen."]], "214": [["dateVerse", "Wednesday, August 2", "Psalm 91:1–8", "Isaiah 60,61", "Colossians 3:12–25"], ["watchD", "Out of my distress I called on the Lord; the Lord answered me and set me in a broad place. Psalm 118:5"], ["docT", "Paul wrote: Our hope for you is unshaken; for we know that as you share in our sufferings, so also you share in our consolation. 2 Corinthians 1:7"], ["prayer", "Never, O God, did you promise that your followers would not suffer—just the opposite! Yet you promise to walk beside us in our suffering and to console us with your presence and love. Thank you. In Jesus’ holy name, we pray. Amen."]], "215": [["dateVerse", "Thursday, August 3", "Psalm 91:9–16", "Isaiah 62,63", "Colossians 4:1–9"], ["watchD", "Your love is like the dew that goes away early. Hosea 6:4"], ["docT", "If I speak in the tongues of mortals and of angels, but do not have love, I am a noisy gong or a clanging cymbal. 1 Corinthians 13:1"], ["prayer", "As we long to grow in love for you, Lord, let us seek to be more like you, loving all people and all creation as you do. Amen."]], "216": [["dateVerse", "Friday, August 4", "Psalm 92:1–8", "Isaiah 64,65", "Colossians 4:10–1 Thessalonians 1:5a"], ["watchD", "Never be rash with your mouth, nor let your heart be quick to utter a word before God, for God is in heaven, and you upon earth; therefore let your words be few. Ecclesiastes 5:2"], ["docT", "Do not judge, so that you may not be judged. Matthew 7:1"], ["prayer", "Lord, govern our speech and our thought, that we may be slow to speak, slow to judge another person, and always quick to love and to forgive. Amen."]], "217": [["dateVerse", "Saturday, August 5", "Psalm 92:9–15", "Isaiah 66–Jeremiah 1:7", "1 Thessalonians 1:5b–2:9"], ["watchD", "Give ear to my words, O Lord; give heed to my sighing. Listen to the sound of my cry, for to you I pray. Psalm 5:1-2"], ["docT", "Whatever you ask for in prayer, believe that you have received it, and it will be yours. Mark 11:24"], ["prayer", "Savior, we come to you in prayer at your invitation because you draw us to you. Let us listen to you knowing that you are listening to us. Hear our prayer and speak to our listening hearts. Amen."]], "218": [["info", "Tenth Sunday after Pentecost"], ["watchO", "Watchword for the week — The Lord is good to all, and his compassion is over all that he has made. Psalm 145:9"], ["dateVerse", "Sunday, August 6", "Isaiah 55:1-5", "Psalm 145:8-9,14-21", "Romans 9:1-5", "Matthew 14:13-21"], ["watchD", "In you our ancestors trusted; they trusted, and you delivered them. Psalm 22:4"], ["docT", "The Lord is compassionate and merciful. James 5:11"], ["prayer", "Jesus, we remember those in our past who trusted in your compassion and mercy. We long faithfully to rely on you, for we know that whatever we face, you walk with us in strong compassion. With thanks, we pray. Amen."]], "219": [["dateVerse", "Monday, August 7", "Psalm 93", "Jeremiah 1:8–2:19", "1 Thessalonians 2:10–20"], ["watchD", "Joseph remained there in prison. But the Lord was with him. Genesis 39:20,21"], ["docT", "About midnight Paul and Silas were praying and singing hymns to God, and the prisoners were listening to them. Acts 16:25"], ["prayer", "In whatever situation we may find ourselves in life, dear Lord, may we remember and bear witness that you are with us. Comfort those in prison and lead us to serve them in your name. Amen."]], "220": [["dateVerse", "Tuesday, August 8", "Psalm 94:1–11", "Jeremiah 2:20–3:13", "1 Thessalonians 3"], ["watchD", "My people shall be satisfied with my bounty, says the Lord. Jeremiah 31:14"], ["docT", "Like good stewards of the manifold grace of God, serve one another with whatever gift each of you has received. 1 Peter 4:10"], ["prayer", "God, may we always respond thoughtfully and carefully to your generosity, knowing that you have entrusted us with gifts, by your grace, for the good of others as well as ourselves. Amen."]], "221": [["dateVerse", "Wednesday, August 9", "Psalm 94:12–23", "Jeremiah 3:14–4:22", "1 Thessalonians 4:1–12"], ["watchD", "Great peace have those who love your law; nothing can make them stumble. Psalm 119:165"], ["docT", "Let the word of Christ dwell in you richly; teach and admonish one another in all wisdom. Colossians 3:16"], ["prayer", "Spirit of truth, your teachings fill us, surround us, and nourish us all our days. We seek to love your truth, and to share it with one another with the wisdom and gentleness that can come only from you. We pray, in Jesus’ name. Amen."]], "222": [["dateVerse", "Thursday, August 10", "Psalm 95", "Jeremiah 4:23–5:25", "1 Thessalonians 4:13–5:3"], ["watchD", "Look at the proud! Their spirit is not right in them, but the righteous live by their faith. Habakkuk 2:4"], ["docT", "Therefore rid yourselves of all sordidness and rank growth of wickedness, and welcome with meekness the implanted word that has the power to save your souls. James 1:21"], ["prayer", "Loving God, may we live ever closer to the truth: about you, about others, and about ourselves. Cleanse our hearts and minds daily, dear Lord. Strengthen our faith that we may continue to grow in love and hope. Amen."]], "223": [["dateVerse", "Friday, August 11", "Psalm 96:1–9", "Jeremiah 5:26–6:30", "1 Thessalonians 5:4–15"], ["watchD", "God knows what is in the darkness, and light dwells with him. Daniel 2:22"], ["docT", "The light shines in the darkness. John 1:5"], ["prayer", "Light of the world, in summer we forget how dark the winter nights can be. In our happy times, we forget how grim the difficult times can be. In our hardest hours, be our light; in easier times, may we be bearers of your light. Amen."]], "224": [["dateVerse", "Saturday, August 12", "Psalm 96:10–13", "Jeremiah 7", "1 Thessalonians 5:16–28"], ["watchD", "My heart exults in the Lord. 1 Samuel 2:1"], ["docT", "Rejoice that your names are written in heaven. Luke 10:20"], ["prayer", "God of strength, God of love, may we today celebrate not our circumstances, but rather the joy of your strength, the constancy of your love, and the certainty that you hold us in your everlasting care. Amen."]], "225": [["info", "Eleventh Sunday after Pentecost - †On this date in 1727 in Berthelsdorf, Saxony (now Germany), a group of quarreling  Christians experienced their unity in Christ through the power of the Holy Spirit. This new Pentecost marked the revival of the Unity of the Brethren, begun in 1457, and the beginning of the Renewed Moravian Church."], ["watchO", "Watchword for the week — Jesus spoke to the disciples and said, “Take heart, it is I; do not be afraid.” Matthew 14:27"], ["specialVerse", "August Thirteenth Festival†", "Joshua 24:16-24", "Psalm 133", "1 John 4:1-13", "John 17:1-2,6-19"], ["dateVerse", "Sunday, August 13", "1 Kings 19:9-18", "Psalm 85:8-13", "Romans 10:5-15", "Matthew 14:22-33"], ["watchD", "God does great things beyond understanding, and marvelous things without number. Job 9:10"], ["docT", "Blessed be the God and Father of our Lord Jesus Christ, who has blessed us in Christ with every spiritual blessing in the heavenly places. Ephesians 1:3"], ["prayer", "Spirit of Christ, you can unite people in you, even in our differences. Fill our vision with the sacrifice and love of Jesus, and fill our hearts with love for Jesus, that we may boundlessly love each other. Amen."]], "226": [["dateVerse", "Monday, August 14", "Psalm 97:1–6", "Jeremiah 8:1–9:9", "2 Thessalonians 1"], ["watchD", "Speak out for those who cannot speak, for the rights of all the destitute. Proverbs 31:8"], ["docT", "Remember those who are in prison, as though you were in prison with them; those who are being tortured, as though you yourselves were being tortured. Hebrews 13:3"], ["prayer", "Jesus, you teach that love for you is expressed by loving the least of your brothers and sisters—our brothers and sisters. May we learn to love as you love, and give ourselves as you gave yourself for the life of the world. Amen."]], "227": [["dateVerse", "Tuesday, August 15", "Psalm 97:7–12", "Jeremiah 9:10–10:16", "2 Thessalonians 2:1–12"], ["watchD", "When the ways of people please the Lord, he causes even their enemies to be at peace with them. Proverbs 16:7"], ["docT", "Love your enemies and pray for those who persecute you, so that you may be children of your Father in heaven. Matthew 5:44-45"], ["prayer", "Triune God, we seek to love even those who hurt us, following your words and your actions. It’s hard, but we know you are with us to enable us to love beyond our own strength. Amen."]], "228": [["dateVerse", "Wednesday, August 16", "Psalm 98", "Jeremiah 10:17–11:23", "2 Thessalonians 2:13–3:5"], ["watchD", "For we are aliens and transients before you, as were all our ancestors; our days on the earth are like a shadow, and there is no hope. 1 Chronicles 29:15"], ["docT", "So we do not lose heart. Even though our outer nature is wasting away, our inner nature is being renewed day by day. 2 Corinthians 4:16"], ["prayer", "God of the wilderness, who suffered beyond our comprehension, today we meditate on our life as a pilgrimage and a journey. May we always know you as our creator, our strength, and our everlasting home. Amen."]], "229": [["dateVerse", "Thursday, August 17", "Psalm 99", "Jeremiah 12:1–13:19", "2 Thessalonians 3:6–18"], ["watchD", "Gideon said, “I will not rule over you; the Lord will rule over you.” Judges 8:23"], ["docT", "The greatest among you will be your servant. Matthew 23:11"], ["prayer", "Suffering servant Jesus, may we learn obedience as you did. May we relinquish our desire to be served, our thirst for power, and our hunger for praise. May we look to you and be a witness for you. Amen."]], "230": [["dateVerse", "Friday, August 18", "Psalm 100", "Jeremiah 13:20–14:22", "1 Timothy 1:1–11"], ["watchD", "Happy are those who keep his decrees, who seek him with their whole heart. Psalm 119:2"], ["docT", "Therefore, whoever breaks one of the least of these commandments, and teaches others to do the same, will be called least in the kingdom of heaven; but whoever does them and teaches them will be called great in the kingdom of heaven. Matthew 5:19"], ["prayer", "Teach us to hear and heed your instruction, Spirit of truth, for therein is our greatest joy and peace. Amen."]], "231": [["dateVerse", "Saturday, August 19", "Psalm 101", "Jeremiah 15:1–16:13", "1 Timothy 1:12–2:7"], ["watchD", "You know me, O Lord; you see me; and you examine my heart’s attitude toward you. Jeremiah 12:3 NASB"], ["docT", "Speaking the truth in love, we must grow up in every way into him who is the head, into Christ. Ephesians 4:15"], ["prayer", "O holy Wisdom, you know our every thought and feeling. May we grow to maturity and into the image of Christ with all our sisters and brothers together. Amen."]], "232": [["info", "Twelfth Sunday after Pentecost "], ["watchO", "Watchword for the week — Let the peoples praise you, O God; let all the peoples praise you. Psalm 67:5"], ["dateVerse", "Sunday, August 20", "Isaiah 56:1,6-8", "Psalm 67", "Romans 11:1-2a,29-32", "Matthew 15:(10-20),21-28"], ["watchD", "God said, “Let there be light;” and there was light. Genesis 1:3"], ["docT", "The fruit of the light is found in all that is good and right and true. Ephesians 5:9"], ["prayer", "Creator God, you made all things good. Today may we focus our attention on seeing the good in everything you made, and may our works and words reflect your light clearly and cleanly. Amen."]], "233": [["info", "†On this day in 1732, the first missionaries departed from Herrnhut bound for St. Thomas."], ["dateVerse", "Monday, August 21†", "Psalm 102:1–11", "Jeremiah 16:14–17:27", "1 Timothy 2:8–3:7"], ["watchD", "I will give them a heart to know that I am the Lord. Jeremiah 24:7"], ["docT", "Paul wrote: Pray for us that God will open to us a door for the word, that we may declare the mystery of Christ. Colossians 4:3"], ["prayer", "Wherever we go in the name of Jesus, Holy Spirit, you are there before us. Today let us speak the words you give us, with the heart of love that only you can give. Amen."]], "234": [["dateVerse", "Tuesday, August 22", "Psalm 102:12–22", "Jeremiah 18:1–19:9", "1 Timothy 3:8–16"], ["watchD", "The Lord your God is testing you, to know whether you indeed love the Lord your God with all your heart and soul. Deuteronomy 13:3"], ["docT", "God is faithful, and he will not let you be tested beyond your strength, but with the testing he will also provide the way out so that you may be able to endure it. 1 Corinthians 10:13"], ["prayer", "Caring God, you give what is needed to answer every call. You provide the strength needed to face every challenge. Your presence is the cure for every fear. With awe, we receive your care, strength, and comfort. Amen."]], "235": [["dateVerse", "Wednesday, August 23", "Psalm 102:23–28", "Jeremiah 19:10–21:10", "1 Timothy 4:1–10"], ["watchD", "I will recount the gracious deeds of the Lord, the praiseworthy acts of the Lord, because of all that the Lord has done for us. Isaiah 63:7"], ["docT", "Indeed you have tasted that the Lord is good. 1 Peter 2:3"], ["prayer", "All praise to you, God, who acts for the good of your children! May we embrace all people, as you do, as your beloved children, and as our beloved brothers and sisters! Amen."]], "236": [["dateVerse", "Thursday, August 24", "Psalm 103:1–5", "Jeremiah 21:11–22:30", "1 Timothy 4:11–5:8"], ["watchD", "The Lord said to me, “You are my servant, Israel, in whom I will be glorified.” Isaiah 49:3"], ["docT", "You know the message God sent to the people of Israel, announcing the good news of peacethrough Jesus Christ, who is Lord of all. Acts 10:36 NIV"], ["prayer", "God of Abraham, Isaac, and Jacob, we honor our brothers and sisters of our faith as your chosen people, through Jesus Christ, son of David, in whose name we pray. Amen."]], "237": [["dateVerse", "Friday, August 25", "Psalm 103:6–18", "Jeremiah 23:1–32", "1 Timothy 5:9–16"], ["watchD", "I said, “I have toiled in vain, I have spent my strength for nothing and vanity; yet surely the justice due to me is with the Lord, and my reward with my God.” Isaiah 49:4 NASB1995"], ["docT", "Be patient, therefore, beloved, until the coming of the Lord. The farmer waits for the precious crop from the earth, being patient with it until it receives the early and the late rains. James 5:7"], ["prayer", "Teach us, Holy Spirit, to leave final outcomes to you. We see dimly and only what is now. What is to be is in your care. Give us wisdom to act when we should and patience to wait for your guidance. Amen."]], "238": [["dateVerse", "Saturday, August 26", "Psalm 103:19–22", "Jeremiah 23:33–25:14", "1 Timothy 5:17–6:2"], ["watchD", "Share your bread with the hungry. Isaiah 58:7"], ["docT", "Do not neglect to do good and to share what you have, for such sacrifices are pleasing to God. Hebrews 13:16"], ["prayer", "Today, God who gave us everything, may we not cling to what we have but share with those who need what we can give. Let us give freely as you have given to us. Amen."]], "239": [["info", "Thirteenth Sunday after Pentecost"], ["watchO", "Watchword for the week — Do not be conformed to this world, but be transformed by the renewing of your minds, so that you may discern what is the will of God—what is good and acceptable and perfect. Romans 12:2"], ["dateVerse", "Sunday, August 27", "Isaiah 51:1-6", "Psalm 138", "Romans 12:1-8", "Matthew 16:13-20"], ["watchD", "The Lord your God has blessed you in all your undertakings. Deuteronomy 2:7"], ["docT", "From his fullness we have all received, grace upon grace. John 1:16"], ["prayer", "Open our eyes, Spirit of truth, to see the grace upon grace you have lavished on us. May we recognize your hand of blessing and may we bless others with your love and mercy. Amen."]], "240": [["dateVerse", "Monday, August 28", "Psalm 104:1–9", "Jeremiah 25:15–26:9", "1 Timothy 6:3–16"], ["watchD", "One who rules over people justly, ruling in the fear of God, is like the light of morning, like the sun rising. 2 Samuel 23:3-4"], ["docT", "Jesus said, “Take my yoke upon you, and learn from me; for I am gentle and humble in heart, and you will find rest for your souls.” Matthew 11:29"], ["prayer", "May we stop trying to do everything with our own strength. May we hear your guidance and learn from you, Jesus, our master. Amen."]], "241": [["dateVerse", "Tuesday, August 29", "Psalm 104:10–18", "Jeremiah 26:10–27:22", "1 Timothy 6:17–2 Timothy 1:7"], ["watchD", "I am the Lord your God, who teaches you for your own good, who leads you in the way you should go. Isaiah 48:17"], ["docT", "Mary sat at the Lord’s feet and listened to what he was saying. Luke 10:39"], ["prayer", "Spirit of wisdom, teach us what you would have us learn. Remind us to sit and listen for your voice in prayer, in quiet meditation, and in the words of sisters and brothers walking with us. Amen."]], "242": [["dateVerse", "Wednesday, August 30", "Psalm 104:19–23", "Jeremiah 28:1–29:14", "2 Timothy 1:8–18"], ["watchD", "Lord God, do not destroy the people who are your very own possession, whom you redeemed in your greatness. Deuteronomy 9:26 "], ["docT", "God who did not withhold his own Son, but gave him up for all of us, will he not with him also give us everything else? Romans 8:32"], ["prayer", "God, you give us your very self, holding nothing back because of your love for us. You conquered death with that love. We worship and adore you. Amen."]], "243": [["dateVerse", "Thursday, August 31", "Psalm 104:24–30", "Jeremiah 29:15–30:11", "2 Timothy 2:1–13"], ["watchD", "The Lord gave them food from heaven in abundance. He opened the rock, and water gushed out; it flowed through the desert like a river. For he remembered his holy promise. Psalm 105:40-42"], ["docT", "Give us this day our daily bread. Matthew 6:11"], ["prayer", "Abundance is your very nature, God of all creation—no two snowflakes alike, no two people alike, no two sunrises alike. May we trust in your goodness and your promises, and may we too give in abundance as we have received. Amen."]], "244": [["dateVerse", "Friday, September 1", "Psalm 104:31–35", "Jeremiah 30:12–31:22", "2 Timothy 2:14–26"], ["watchD", "You are wearied with your many consultations. Isaiah 47:13"], ["docT", "Do not claim to be wiser than you are. Romans 12:16"], ["prayer", "Gracious God, thank you for your understanding, even when we seek counsel that does not honor your holy truth. Please guide us into the fullness of your presence and power, which are always available to us. Amen."]], "245": [["dateVerse", "Saturday, September 2", "Psalm 105:1–7", "Jeremiah 31:23–32:15", "2 Timothy 3:1–9"], ["watchD", "You shall not spread a false report. Exodus 23:1"], ["docT", "So then, putting away falsehood, let all of us speak the truth to our neighbors, for we are members of one another. Ephesians 4:25"], ["prayer", "Incarnate Word, our words have power. May we always be mindful of our language and what it conveys in all our conversations today. In Jesus’ name, we pray. Amen."]], "246": [["info", "Fourteenth Sunday after Pentecost"], ["watchO", "Watchword for the week — Jesus said, “If any want to become my followers, let them deny themselves and take up their cross and follow me.” Matthew 16:24"], ["dateVerse", "Sunday, September 3", "Jeremiah 15:15-21", "Psalm 26:1-8", "Romans 12:9-21", "Matthew 16:21-28"], ["watchD", "Look down from heaven and see, from your holy and glorious habitation. Where are your zeal and your might? Isaiah 63:15"], ["docT", "For through the Spirit, by faith, we eagerly wait for the hope of righteousness. Galatians 5:5"], ["prayer", "Mighty God, bless us today with faith that is eager, hopeful, and trusting. May your righteousness guide us with strength and wisdom. Amen."]], "247": [["dateVerse", "Monday, September 4", "Psalm 105:8–15", "Jeremiah 32:16–33:5", "2 Timothy 3:10–4:8"], ["watchD", "My God, my soul is cast down within me; therefore I remember you. Psalm 42:6"], ["docT", "I will not leave you orphaned; I am coming to you. John 14:18"], ["prayer", "Abiding God, thank you for your steadfast lovingkindness through the hardest times of our lives. Your warm shelter sustains us more often than we may ever know. Amen."]], "248": [["dateVerse", "Tuesday, September 5", "Psalm 105:16–22", "Jeremiah 33:6–34:7", "2 Timothy 4:9–22"], ["watchD", "I have swept away your transgressions like a cloud, and your sins like mist; return to me, for I have redeemed you. Isaiah 44:22"], ["docT", "God erased the record that stood against us with its legal demands. He set this aside, nailing it to the cross. Colossians 2:14"], ["prayer", "Gentle One, you generously forgive all our mistakes: how we hurt others, how we walk away from you. Nurture our hearts to savor and share your joy in forgiving others their mistakes and missteps. In Jesus’ name, we pray. Amen."]], "249": [["dateVerse", "Wednesday, September 6", "Psalm 105:23–36", "Jeremiah 34:8–35:19", "Titus 1:1–9"], ["watchD", "Speak the truth to one another, render in your gates judgments that are true and make for peace. Zechariah 8:16"], ["docT", "Let us then pursue what makes for peace and for mutual upbuilding. Romans 14:19"], ["prayer", "Lord, help us repent from all the ways we resist doing what we know can make peace in and among ourselves. Guide us to speak truth, to make good judgments reflecting your grace. Teach us the power of creating mutual understanding. Amen."]], "250": [["dateVerse", "Thursday, September 7", "Psalm 105:37–45", "Jeremiah 36", "Titus 1:10–2:5"], ["watchD", "Inquire first for the word of the Lord. 2 Chronicles 18:4"], ["docT", "Continue in the things which you have learned and been assured of. 2 Timothy 3:14 NKJV"], ["prayer", "Steadfast Love, may we always consult you about whatever matters to us, because we know we matter to you. May we remember to listen for your responses. We trust you will always be clear and honest with us. In Jesus’ name, we pray. Amen."]], "251": [["dateVerse", "Friday, September 8", "Psalm 106:1–5", "Jeremiah 37:1–38:13", "Titus 2:6–3:2"], ["watchD", "Your dead shall live. Isaiah 26:19"], ["docT", "Since we are surrounded by so great a cloud of witnesses, let us also lay aside every weight and the sin that clings so closely. Hebrews 12:1"], ["prayer", "O God, you understand our sorrows and are with us in all our grief, bearing it for us when we cannot. We are grateful that our loved ones who are no longer with us now reside with you. Amen."]], "252": [["dateVerse", "Saturday, September 9", "Psalm 106:6–12", "Jeremiah 38:14–39:18", "Titus 3:3–15"], ["watchD", "He is mindful of his covenant forever, of the word that he commanded, for a thousand generations. Psalm 105:8"], ["docT", "The gifts and the calling of God are irrevocable. Romans 11:29"], ["prayer", "Everlasting God, your covenant, gifts, and calling are steadfast and irrevocable. We are joined together in community that is centered in the truth of your love for, and commitment to, us forever. We are grateful that we are yours and you are ours. Amen."]], "253": [["info", "Fifteenth Sunday after Pentecost"], ["watchO", "Watchword for the week — Give me understanding, O God, that I may keep your law and observe it with my whole heart. Psalm 119:34"], ["dateVerse", "Sunday, September 10", "Ezekiel 33:7-11", "Psalm 119:33-40", "Romans 13:8-14", "Matthew 18:15-20"], ["watchD", "God has made me fruitful in the land of my misfortunes. Genesis 41:52"], ["docT", "We also boast in our sufferings, knowing that suffering produces endurance, and endurance produces character, and character produces hope. Romans 5:3-4"], ["prayer", "Kind, attentive God, none of us is immune to the harsh realities of life. In these hard times, you are present, reliable, and loving. Help us trust and depend on you as our shepherd and the guardian of our way. Amen."]], "254": [["dateVerse", "Monday, September 11", "Psalm 106:13–23", "Jeremiah 40,41", "Philemon 1:1–11"], ["watchD", "It is better to take refuge in the Lord than to put confidence in mortals. Psalm 118:8"], ["docT", "Paul wrote: At my first defense no one came to my support, but all deserted me. May it not be counted against them! But the Lord stood by me and gave me strength. 2 Timothy 4:16-17"], ["prayer", "Eternal Protector, when every security falls away, when we stand defenseless, you stand with us. You have loved us with everlasting love; you have drawn us with every kindness. Help us trust your continued assurance no matter what our circumstances. Amen."]], "255": [["dateVerse", "Tuesday, September 12", "Psalm 106:24–31", "Jeremiah 42,43", "Philemon 1:12–25"], ["watchD", "[The Lord said] “You have seen how I bore you on eagles’ wings and brought you to myself.” Exodus 19:4 "], ["docT", "So do not throw away your confidence; it will be richly rewarded. Hebrews 10:35 NIV"], ["prayer", "God, your love upholds us and gives us confidence. Guide and direct us to welcome your power, and to discipline ourselves in applying it in how we think, speak, and act today. Amen."]], "256": [["dateVerse", "Wednesday, September 13", "Psalm 106:32–39", "Jeremiah 44", "Hebrews 1:1–9"], ["watchD", "In the midst of the congregation I will praise you. Psalm 22:22"], ["docT", "Jesus prayed for his disciples: “The glory that you have given me I have given them, so that they may be one, as we are one.” John 17:22"], ["prayer", "As one congregation, we praise your name, faithful Savior. We are grateful for all the ways in which you love us, shown to us so generously in the prayers Jesus offered for his disciples and for us. May your will be done through us today. Amen."]], "257": [["dateVerse", "Thursday, September 14", "Psalm 106:40–48", "Jeremiah 45,46", "Hebrews 1:10–2:8a"], ["watchD", "As a father has compassion for his children, so the Lord has compassion for those who fear him. Psalm 103:13"], ["docT", "Jesus said, “If you then, who are evil, know how to give good gifts to your children, how much more will your Father in heaven give good things to those who ask him!” Matthew 7:11"], ["prayer", "Abundant Giver of life, thank you for your goodness, mercy, and blessings that fill our days to overflowing. May we remember each day that you are the source of all that we are and all that we have. Amen."]], "258": [["dateVerse", "Friday, September 15", "Psalm 107:1–9", "Jeremiah 47:1–48:25", "Hebrews 2:8b–18"], ["watchD", "My heart recoils within me; my compassion grows warm and tender. I will not execute my fierce anger; for I am God and no mortal, the Holy One in your midst. Hosea 11:8-9 "], ["docT", "Jesus said, “I came not to judge the world, but to save the world.” John 12:47"], ["prayer", "Merciful One, we find it hard to comprehend that we are created in your image, not the other way around. While we are inclined by our human nature to judge, you, by your divine nature, delight in graciousness. May we remember who made us and to whom we belong. Amen. "]], "259": [["info", "Minister’s Covenant Day†"], ["dateVerse", "Saturday, September 16", "Psalm 107:10–16", "Jeremiah 48:26–49:16", "Hebrews 3:1–15"], ["watchD", "You have taken up my cause, O Lord, you have redeemed my life. Lamentations 3:58"], ["docT", "Christ suffered for you, leaving you an example, so that you should follow in his steps. When he was abused, he did not return abuse; when he suffered, he did not threaten; but he entrusted himself to the one who judges justly. 1 Peter 2:21,23"], ["prayer", "God, you are all-powerful, and you love us. You always come to help us. You champion our cause, and when we suffer, you hold us safely in your embrace. May we embody Jesus’ example of entrusting himself to you in the difficult times. Amen."], ["info", "†During a synodal conference in London, Jesus Christ was recognized as chief elder of the Brethren’s Church. The day is observed as a covenanting day for servants of the church."]], "260": [["info", "Sixteenth Sunday after Pentecost"], ["watchO", "Watchword for the week — Bless the Lord, O my soul, and do not forget all his benefits. Psalm 103:2"], ["dateVerse", "Sunday, September 17", "Genesis 50:15-21", "Psalm 103:(1-7),8-13", "Romans 14:1-12", "Matthew 18:21-35"], ["watchD", "No inhabitant will say, “I am sick”; the people who live there will be forgiven their iniquity. Isaiah 33:24"], ["docT", "Christ said, “Do not be afraid; I am the first and the last, and the living one. I was dead, and see, I am alive forever and ever; and I have the keys of Death and of Hades.” Revelation 1:17-18"], ["prayer", "Most loving God, the certainty of your blessings is eternal, everlasting, from generation to generation. We are grateful and humbled that it is you in whom we live, move, and have our being today. Amen."]], "261": [["dateVerse", "Monday, September 18", "Psalm 107:17–22", "Jeremiah 49:17–39", "Hebrews 3:16–4:5"], ["watchD", "Know that all lives are mine. Ezekiel 18:4"], ["docT", "Paul wrote: I urge that supplications, prayers, intercessions, and thanksgivings be made for everyone. 1 Timothy 2:1"], ["prayer", "Sustaining God, claiming us all as your own, encourage us to come to you with all our hopes, wants, and fears. Teach us that we are worthy of your loving attention. Amen."]], "262": [["dateVerse", "Tuesday, September 19", "Psalm 107:23–32", "Jeremiah 50:1–40", "Hebrews 4:6–16"], ["watchD", "Trust in him at all times, O people; pour out your heart before him; God is a refuge for us. Psalm 62:8"], ["docT", "Now during those days Jesus went out to the mountain to pray; and he spent the night in prayer to God. Luke 6:12"], ["prayer", "Eternal Refuge, our trust in you is strengthened when we bring everything in our lives to you in prayer. Please encourage us, welcome us, hear us when we come to you, in whatever state of being we find ourselves. Amen."]], "263": [["dateVerse", "Wednesday, September 20", "Psalm 107:33–43", "Jeremiah 50:41–51:23", "Hebrews 5"], ["watchD", "In the fear of the Lord one has strong confidence. Proverbs 14:26"], ["docT", "Who will separate us from the love of Christ? Will hardship, or distress, or persecution, or famine, or nakedness, or peril, or sword? Romans 8:35"], ["prayer", "Enduring One, we know you, love you, and serve you. When we feel disconnected from you, please guide our hearts back to the truth, that nothing separates us from you. Thank you, God. Amen."]], "264": [["dateVerse", "Thursday, September 21", "Psalm 108:1–5", "Jeremiah 51:24–64", "Hebrews 6:1–12"], ["watchD", "You will certainly revere me, you will accept discipline. Zephaniah 3:7 NASB"], ["docT", "Jesus entered the temple and began to drive out those who were selling things there; and he said, “It is written, ‘My house shall be a house of prayer.’” Luke 19:45-46"], ["prayer", "Sovereign Lord, your justice is powerful and creative, beginning with each of us allowing your will to work its way in us. We sometimes make the mistake of believing that faithful action takes singular courage. What it takes is union with you and your reconciling purpose in the life of Jesus Christ. On this trust, we base our lives. Amen."]], "265": [["dateVerse", "Friday, September 22", "Psalm 108:6–13", "Jeremiah 52", "Hebrews 6:13–7:3"], ["watchD", "See, you shall call nations that you do not know, and nations that do not know you shall run to you, because of the Lord your God, the Holy One of Israel, for he has glorified you. Isaiah 55:5"], ["docT", "I bow my knees before the Father, from whom every family in heaven and on earth takes its name. Ephesians 3:14-15"], ["prayer", "Today, dear God, we take in the great mystery of your gathering all people and nations into your family. We are no longer strangers when we worship you and share your love with each other. Thank you, God. Amen."]], "266": [["dateVerse", "Saturday, September 23", "Psalm 109:1–7", "Lamentations 1:1–15", "Hebrews 7:4–17"], ["watchD", "Do not be discouraged, for you will not suffer disgrace. Isaiah 54:4"], ["docT", "Paul wrote: I do not consider that I have made it my own; but this one thing I do: forgetting what lies behind and straining forward to what lies ahead. Philippians 3:13"], ["prayer", "Constant Spirit, our human actions often lead to broken hearts, wounded pride, and petty grievances that can risk us fracturing our souls and our union with you. Please forgive us our mistakes. Please lift us up by your grace this day, so that we may keep walking with you toward what lies ahead. Amen."]], "267": [["info", "Seventeenth Sunday after Pentecost"], ["watchO", "Watchword for the week — For to me, living is Christ and dying is gain. Philippians 1:21"], ["dateVerse", "Sunday, September 24", "Jonah 3:10-4:11", "Psalm 145:1-8", "Philippians 1:21-30", "Matthew 20:1-16"], ["watchD", "You shall love your neighbor as yourself: I am the Lord. Leviticus 19:18"], ["docT", "A Samaritan while traveling came near him; and when he saw him, he was moved with pity. He went to him and bandaged his wounds, having poured oil and wine on them. Then he put him on his own animal, brought him to an inn, and took care of him. Luke 10:33-34"], ["prayer", "You, God, loves us best. We have a lot to learn. Please help us release the fear that stops us from loving fully and deeply in the way that Jesus, our savior, embodied in his life and ministry. Thank you. Amen."]], "268": [["dateVerse", "Monday, September 25", "Psalm 109:8–20", "Lamentations 1:16–2:10", "Hebrews 7:18–28"], ["watchD", "The word of the Lord is upright, and all his work is done in faithfulness. Psalm 33:4"], ["docT", "Jesus said, “Heaven and earth will pass away, but my words will not pass away.” Matthew 24:35"], ["prayer", "Steadfast, trustworthy God, your words and actions are the same from age to age, and in every generation. You are always reliable, and we can believe and take action in your confident leadership, even when we don’t feel so confident ourselves. Thank you, God. Amen."]], "269": [["dateVerse", "Tuesday, September 26", "Psalm 109:21–31", "Lamentations 2:11–3:15", "Hebrews 8"], ["watchD", "I will exult and rejoice in your steadfast love, because you have seen my affliction; you have taken heed of my adversities. Psalm 31:7"], ["docT", "Go home to your friends, and tell them how much the Lord has done for you, and what mercy he has shown you. Mark 5:19"], ["prayer", "Love Eternal, your mercy and kindness attend us in days of distress and affliction, peace and joy. May we praise and thank you in all the circumstances of life in which we find ourselves because we know you are with us, sustaining us always. Amen."]], "270": [["dateVerse", "Wednesday, September 27", "Psalm 110", "Lamentations 3:16–66", "Hebrews 9:1–10"], ["watchD", "In God’s hand are the depths of the earth; the heights of the mountains are his also. Psalm 95:4"], ["docT", "Worship him who made heaven and earth, the sea and the springs of water. Revelation 14:7"], ["prayer", "Extravagant Creator, your generosity knows no bounds. May we each take time today to stand still, look around, and take in some of the beauty you share with us in nature and each other. Thank you. Amen."]], "271": [["dateVerse", "Thursday, September 28", "Psalm 111", "Lamentations 4,5", "Hebrews 9:11–22"], ["watchD", "The Lord will not forsake his people; he will not abandon his heritage. Psalm 94:14"], ["docT", "Our citizenship is in heaven, and it is from there that we are expecting a Savior, the Lord Jesus Christ. Philippians 3:20"], ["prayer", "Unchanging Love, when we feel lost, alone, or confused, still our souls to trust in your provision, order, and power. Please strengthen our confidence in you that it may never be shaken. In Jesus’ name, we pray. Amen."]], "272": [["dateVerse", "Friday, September 29", "Psalm 112", "Ezekiel 1,2", "Hebrews 9:23–10:4"], ["watchD", "Let us go with you, for we have heard that God is with you. Zechariah 8:23"], ["docT", "How are they to hear without someone to proclaim him? Romans 10:14"], ["prayer", "Author of all life, may we always delight in sharing our stories of your constant love and abiding presence with those who may not know you. Please continue to draw us close with your kindness, patience, and peace. In Jesus’ name, we pray. Amen."]], "273": [["dateVerse", "Saturday, September 30", "Psalm 113", "Ezekiel 3–4:5", "Hebrews 10:5–18"], ["watchD", "Better is a little with the fear of the Lord than great treasure and trouble with it. Proverbs 15:16"], ["docT", "Keep your lives free from the love of money, and be content with what you have. Hebrews 13:5"], ["prayer", "Source of our being, love is a powerful currency of which there is no limit when we rely on you. Please help us steward all our resources, including monetary ones, with that love you so lavishly bestow on us. Amen."]], "274": [["info", "Eighteenth Sunday after Pentecost"], ["watchO", "Watchword for the week — Let the same mind be in you that was in Christ Jesus. Philippians 2:5"], ["dateVerse", "Sunday, October 1", "Ezekiel 18:1-4,25-32", "Psalm 25:1-9", "Philippians 2:1-13", "Matthew 21:23-32"], ["watchD", "I am the Lord; I act with steadfast love, justice, and righteousness in the earth. Jeremiah 9:24"], ["docT", "A harvest of righteousness is sown in peace for those who make peace. James 3:18"], ["prayer", "Almighty God, bless us to be blessings unto your creation, your people, and your holy name. Help us to keep Sabbath this day, uniting with sisters and brothers throughout the world, honorably and peaceably. Amen."]], "275": [["dateVerse", "Monday, October 2", "Psalm 114", "Ezekiel 4:6–6:7", "Hebrews 10:19–31"], ["watchD", "The light of the moon will be like the light of the sun, and the light of the sun will be sevenfold on the day when the Lord binds up the injuries of his people, and heals the wounds. Isaiah 30:26"], ["docT", "By Christ’s wounds you have been healed. 1 Peter 2:24"], ["prayer", "Lord Jesus Christ, son of God, hold us in your divine embrace. Comfort us and heal us. Keep us in the shadow of your mountain and in the sunshine of your love, this day and always. Amen."]], "276": [["dateVerse", "Tuesday, October 3", "Psalm 115:1–8", "Ezekiel 6:8–7:27", "Hebrews 10:32–11:3"], ["watchD", "Protect me, O God, for in you I take refuge. Psalm 16:1"], ["docT", "Jesus said, “Do not bring us to the time of trial.” Matthew 6:13"], ["prayer", "Sometimes our prayers seem selfish and desperate, dear Lord, but you listen anyway. We know you love us and desire to protect us from harm, even though we may question and fear. Let us ponder your goodness and mercy, and give thanks for the many blessings you bestow. Amen."]], "277": [["dateVerse", "Wednesday, October 4", "Psalm 115:9–18", "Ezekiel 8,9", "Hebrews 11:4–16"], ["watchD", "The Lord your God is bringing you into a good land, a land with flowing streams, with springs and underground waters welling up in valleys and hills. Deuteronomy 8:7"], ["docT", "Barnabas and Paul shouted to the crowds: “God has not left himself without a witness in doing good—giving you rains from heaven and fruitful seasons, and filling you with food and your hearts with joy.” Acts 14:17"], ["prayer", "Wise Father, we are filled with desires, but you know our true needs. Teach us to trust your all-sufficient grace. Lead us into mature and abundant life in Christ Jesus. Amen."]], "278": [["dateVerse", "Thursday, October 5", "Psalm 116:1–7", "Ezekiel 10:1–11:15", "Hebrews 11:17–28"], ["watchD", "Not one of all the good promises that the Lord had made to the house of Israel had failed; all came to pass. Joshua 21:45"], ["docT", "The entire crowd was rejoicing at all the wonderful things that Jesus was doing. Luke 13:17"], ["prayer", "You are the source of the smiles on our faces, Lord. You cause our hearts to skip beats. May your holy name, Jesus, be praised, again and again, in every nation. Alleluia, alleluia, alleluia! Amen."]], "279": [["dateVerse", "Friday, October 6", "Psalm 116:8–14", "Ezekiel 11:16–12:28", "Hebrews 11:29–40"], ["watchD", "Obey me, and I will be your God and you will be my people. Jeremiah 7:23 NIV"], ["docT", "Jesus said, “If you continue in my word, you are truly my disciples.” John 8:31"], ["prayer", "Best divine Friend, what a privilege it is to be your covenant people. Thank you for calling us to be your disciples. May we remember you with sincere devotion in everything we do, always. Amen."]], "280": [["dateVerse", "Saturday, October 7", "Psalm 116:15–19", "Ezekiel 13:1–14:11", "Hebrews 12:1–13"], ["watchD", "Elijah prayed, “Answer me, Lord, answer me, so these people will know that you, Lord, are God, and that you are turning their hearts back again.” 1 Kings 18:37 NIV"], ["docT", "Jesus said to Peter, “I have prayed for you that your own faith may not fail; and you, when once you have turned back, strengthen your brothers.” Luke 22:32"], ["prayer", "We live in a transactional society, Lord, but you call us to be relational people. Open our hearts that we might live, not in isolated self-interest, but as sisters and brothers united in discipleship, reaching out to serve others. In Christ’s name, we pray. Amen."]], "281": [["info", "Nineteenth Sunday after Pentecost"], ["watchO", "Watchword for the week — The stone that the builders rejected has become the chief cornerstone. This is the Lord’s doing; it is marvelous in our eyes. Psalm 118:22,23"], ["dateVerse", "Sunday, October 8", "Isaiah 5:1-7", "Psalm 80:7-15", "Philippians 3:4b-14", "Matthew 21:33-46"], ["watchD", "The boundary lines have fallen for me in pleasant places; I have a goodly heritage. Psalm 16:6"], ["docT", "God is able to provide you with every blessing in abundance, so that by always having enough of everything, you may share abundantly in every good work. 2 Corinthians 9:8"], ["prayer", "God, you created us, you love us, and you have plans for us. Why should we worry? Why should we be perplexed? Help us return to you this Sabbath day and abide in you ever more—just as we are, just as you intend. Amen."]], "282": [["dateVerse", "Monday, October 9", "Psalm 117", "Ezekiel 14:12–15:8", "Hebrews 12:14–24"], ["watchD", "Treasures gained by wickedness do not profit, but righteousness delivers from death. Proverbs 10:2"], ["docT", "Zacchaeus said to Jesus, “Look, half of my possessions, Lord, I will give to the poor; and if I have defrauded anyone of anything, I will pay back four times as much.” Luke 19:8"], ["prayer", "Christ, we acknowledge that you are the only source of true fulfillment. Deliver us from materialism; free us from the never-ending quest for more. Grant us the peace that comes from surrendering our desires to you. Amen."]], "283": [["dateVerse", "Tuesday, October 10", "Psalm 118:1–9", "Ezekiel 16:1–42", "Hebrews 12:25–13:6"], ["watchD", "I will leave among you a humble and lowly people, and they will take refuge in the name of the Lord. Zephaniah 3:12 NASB"], ["docT", "God chose what is low and despised in the world, things that are not, to reduce to nothing things that are, so that no one might boast in the presence of God. 1 Corinthians 1:28-29"], ["prayer", "You give us freedom to make choices in life, Lord, and have extended to us an open invitation to turn to you at any time, regardless of circumstance. Move us to choose your way and call upon your holy name, every minute and every hour. Amen."]], "284": [["dateVerse", "Wednesday, October 11", "Psalm 118:10–14", "Ezekiel 16:43–17:10", "Hebrews 13:7–19"], ["watchD", "Lord, you have been a refuge for the needy in his distress, a shelter from the storm and a shade from the heat. For the breath of the ruthless is like a storm. Isaiah 25:4 NIV"], ["docT", "While we live, we are always being given up to death for Jesus’ sake, so that the life of Jesus may be made visible in our mortal flesh. 2 Corinthians 4:11"], ["prayer", "You are omnipotent, God, yet you delicately care for each of us, even in the small moments of our fragile lives. Remind us today that you believe in us. Let us not forget that, by the spirit, the water, and the blood, you have equipped us to be your disciples. Amen."]], "285": [["dateVerse", "Thursday, October 12", "Psalm 118:15–21", "Ezekiel 17:11–18:18", "Hebrews 13:20–James 1:8"], ["watchD", "Help me, O Lord my God! Save me according to your steadfast love. Psalm 109:26"], ["docT", "When Peter noticed the strong wind, he became frightened, and beginning to sink, he cried out, “Lord, save me!” Jesus immediately reached out his hand and caught him, saying to him, “You of little faith, why did you doubt?” Matthew 14:30-31"], ["prayer", "Lord of our salvation, too often life is difficult, and circumstances leave us feeling alone and filled with fear. Through your grace, you claim us as your own and abide with us in every moment. Embolden us to surrender our anxieties and doubts to you. May we humble ourselves in your presence, which is always with us. Amen. "]], "286": [["dateVerse", "Friday, October 13", "Psalm 118:22–29", "Ezekiel 18:19–19:14", "James 1:9–18"], ["watchD", "He does what he wills with the host of heaven and the inhabitants of the earth. There is no one who can stay his hand or say to him, “What are you doing?” Daniel 4:35"], ["docT", "Humble yourselves therefore under the mighty hand of God, so that he may exalt you in due time. 1 Peter 5:6"], ["prayer", "Discerning God, often we think we are clever and deceive ourselves into believing that we are in control. Sometimes, we even try to subject you to our will, making excuses and offering appeasements. Forgive us, loving Lord. Return us to genuine, forthright faith. Amen."]], "287": [["dateVerse", "Saturday, October 14", "Psalm 119:1–8", "Ezekiel 20:1–29", "James 1:19–27"], ["watchD", "Lay down a pledge for me with yourself; who is there that will give surety for me? Job 17:3"], ["docT", "Who is to condemn? It is Christ Jesus, who died, yes, who was raised, who is at the right hand of God, who indeed intercedes for us. Romans 8:34"], ["prayer", "Christ Jesus, you are the one and only resurrected Lord who has rendered unto your people the matchless gift of salvation. Guide us as your redeemed followers to respond in the only way we are able, by offering our faith, love, and hope in every aspect of our living. Amen."]], "288": [["info", "Twentieth Sunday after Pentecost"], ["watchO", "Watchword for the week — O Lord, you are my God; I will exalt you, I will praise your name; for you have done wonderful things. Isaiah 25:1"], ["dateVerse", "Sunday, October 15", "Isaiah 25:1-9", "Psalm 23", "Philippians 4:1-9", "Matthew 22:1-14"], ["watchD", "The righteous know the rights of the poor. Proverbs 29:7"], ["docT", "Jesus said, “When you give a banquet, invite the poor, the crippled, the lame, and the blind. And you will be blessed, because they cannot repay you.” Luke 14:13-14"], ["prayer", "Who are our sisters and brothers, O Lord, but all of your children? Why are the people who discomfort and disquiet us the most usually the ones who help us grow and mature? May we not hesitate to practice radical hospitality as we learn to recognize and honor your divinity in all others. Amen."]], "289": [["dateVerse", "Monday, October 16", "Psalm 119:9–16", "Ezekiel 20:30–21:17", "James 2:1–13"], ["watchD", "He does not deal with us according to our sins, nor repay us according to our iniquities. Psalm 103:10"], ["docT", "Forgive one another, as God in Christ has forgiven you. Ephesians 4:32"], ["prayer", "God with us, it is a wonder that you do not give up on us. By your infinite mercy, may we begin anew to love our neighbors as we love ourselves. Give us courage to surrender our pride and seek forgiveness from those whom we have wronged. Amen."]], "290": [["dateVerse", "Tuesday, October 17", "Psalm 119:17–24", "Ezekiel 21:18–22:22", "James 2:14–26"], ["watchD", "The Lord will command his angels concerning you to guard you in all your ways. On their hands they will bear you up, so that you will not dash your foot against a stone. Psalm 91:11-12"], ["docT", "An angel of the Lord appeared to Joseph in a dream and said, “Get up, take the child and his mother, and flee to Egypt, and remain there until I tell you.” Matthew 2:13"], ["prayer", "We acknowledge your protection, good and loving Lord, in our coming and going, night and day. Deepen our conviction in your lovingkindness by helping us perceive that we are, indeed, surrounded by angels. Amen."]], "291": [["dateVerse", "Wednesday, October 18", "Psalm 119:25–32", "Ezekiel 22:23–23:27", "James 3:1–12"], ["watchD", "I know that the Lord maintains the cause of the needy, and executes justice for the poor. Psalm 140:12"], ["docT", "Blessed are you who are poor, for yours is the kingdom of God. Luke 6:20"], ["prayer", "Compassionate Lord, you have instructed us to care for the poor. Thank you for your teachings about how to serve others. We pray for your assistance in our daily efforts to overcome spiritual poverty—the source of human suffering. Amen."]], "292": [["dateVerse", "Thursday, October 19", "Psalm 119:33–40", "Ezekiel 23:28–24:8", "James 3:13–4:6"], ["watchD", "The Lord declares, “Those who honor me I will honor, and those who despise me shall be treated with contempt.” 1 Samuel 2:30"], ["docT", "Or do you despise the riches of his kindness and forbearance and patience? Do you not realize that God’s kindness is meant to lead you to repentance? Romans 2:4"], ["prayer", "Our world is filled with ignorance and illusion. As Christians, we are in this world but not of it. Holy Spirit, guide us as we endeavor to illuminate the dark corners, shadows, and voids by sharing in every word and action the good news of God’s salvation through Christ. Amen."]], "293": [["dateVerse", "Friday, October 20", "Psalm 119:41–48", "Ezekiel 24:9–25:14", "James 4:7–17"], ["watchD", "The Lord used to speak to Moses face to face, as one speaks to a friend. Exodus 33:11"], ["docT", "Jesus said, “I do not call you servants any longer, because the servant does not know what the master is doing; but I have called you friends, because I have made known to you everything that I have heard from my Father.” John 15:15"], ["prayer", "We believe in you, God. You come to us as a personal savior, Jesus, whose name we speak with adoration. You know us, Lord, and you love us with tender affection. With deepest gratitude, we claim you as our dearest friend. Amen."]], "294": [["dateVerse", "Saturday, October 21", "Psalm 119:49–56", "Ezekiel 25:15–27:11", "James 5:1–12"], ["watchD", "Those who trust in the Lord shall be like a tree planted by water, sending out its roots by the stream. In the year of drought it is not anxious, and it does not cease to bear fruit. Jeremiah 17:7,8"], ["docT", "The fruit of the Spirit is love, joy, peace, patience, kindness, generosity, faithfulness, gentleness, and self-control. Galatians 5:22-23"], ["prayer", "Holy Gardener, source of all life, cultivate us this day and nourish us by your Spirit. As deep run the roots of the tree of life, so may our reverence of your grace keep us steadfast, thriving, and bearing good fruit. In Jesus’ name, we pray. Amen."]], "295": [["info", "Twenty-first Sunday after Pentecost"], ["watchO", "Watchword for the week — Sing to the Lord, bless his name; tell of his salvation from day to day. Psalm 96:2"], ["dateVerse", "Sunday, October 22", "Isaiah 45:1-7", "Psalm 96:1-9,(10-13)", "1 Thessalonians 1:1-10", "Matthew 22:15-22"], ["watchD", "You shall not hate in your heart anyone of your kin; you shall reprove your neighbor, or you will incur guilt yourself. Leviticus 19:17"], ["docT", "Brothers and sisters, if someone is caught in a sin, you who live by the Spirit should restore that person gently.  Galatians 6:1 NIV"], ["prayer", "Lord Jesus, as we attempt to love God’s children without condition, may we share kind and respectful words that honor the dignity inherent in others. H-A-T-E is a terrible four-letter word that should never be used, instead may we use the word love, just as you’ve taught us. Amen."]], "296": [["dateVerse", "Monday, October 23", "Psalm 119:57–64", "Ezekiel 27:12–28:10", "James 5:13–20"], ["watchD", "He is the living God, enduring forever. His kingdom shall never be destroyed. Daniel 6:26"], ["docT", "God has put all things under Christ’s feet and has made him the head over all things for the church. Ephesians 1:22"], ["prayer", "Christ, our Chief Elder, we are humbled that you have chosen to be our partner in ministry, moving among us and working by our side. We offer anew our talents and energy to further your kingdom on earth. Bless and invigorate your church, we pray. Amen."]], "297": [["dateVerse", "Tuesday, October 24", "Psalm 119:65–72", "Ezekiel 28:11–29:12", "1 Peter 1:1–12"], ["watchD", "You have multiplied, O Lord my God, your wondrous deeds and your thoughts towards us; none can compare with you. Psalm 40:5"], ["docT", "In Christ are hidden all the treasures of wisdom and knowledge. Colossians 2:3"], ["prayer", "Author of creation, we marvel at the infinite manifestations of your grace, which surround us and fill our lives to overflowing. We thank you, especially, for the gift of your holy word. May we read and study the Bible more each day as we seek to grow deeper in relationship with you. In Jesus’ name, we pray. Amen."]], "298": [["dateVerse", "Wednesday, October 25", "Psalm 119:73–80", "Ezekiel 29:13–30:26", "1 Peter 1:13–25"], ["watchD", "All the ends of the earth shall turn to the Lord. Psalm 22:27"], ["docT", "Jesus told them another parable, “The kingdom of heaven is like yeast that a woman took and mixed in with three measures of flour until all of it was leavened.” Matthew 13:33"], ["prayer", "Good Shepherd, we are people from diverse backgrounds, with varied interests and innumerable ideas. Transform our thinking and lead us away from self-minded activity. Move us, in accordance with the Holy Spirit, to serve you and bolster your church. Amen."]], "299": [["dateVerse", "Thursday, October 26", "Psalm 119:81–88", "Ezekiel 31:1–32:16", "1 Peter 2:1–12"], ["watchD", "He awakens me morning by morning, he awakens my ear to listen as a disciple. Isaiah 50:4 NASB"], ["docT", "Lydia, a worshiper of God, was listening to us; she was from the city of Thyatira and a dealer in purple cloth. The Lord opened her heart to listen eagerly to what was said by Paul. Acts 16:14"], ["prayer", "Thank you, Lord, for the opportunities awaiting us to praise your holy name and witness to your divine love. In our every interaction, may we exemplify our devotion to Jesus Christ by earnestly listening to others and responding with compassion. Amen."]], "300": [["dateVerse", "Friday, October 27", "Psalm 119:89–96", "Ezekiel 32:17–33:20", "1 Peter 2:13–25"], ["watchD", "The Lord is the stronghold of my life; of whom shall I be afraid? Psalm 27:1 "], ["docT", "I can do all things through him who strengthens me. Philippians 4:13"], ["prayer", "Resurrected Savior, who instructs us to resist evil, move us this day to disavow notions of power. Teach us to fashion our swords into plowshares, for we are called to be peacemakers. “Christ and Him crucified, remain our confession of faith.” Amen."]], "301": [["dateVerse", "Saturday, October 28", "Psalm 119:97–104", "Ezekiel 33:21–34:19", "1 Peter 3:1–7"], ["watchD", "Surely it was for my welfare that I had great bitterness; but you have held back my life from the pit of destruction, for you have cast all my sins behind your back. Isaiah 38:17"], ["docT", "By this we will know that we are from the truth and will reassure our hearts before him whenever our hearts condemn us; for God is greater than our hearts, and he knows everything. 1 John 3:19-20"], ["prayer", "Omniscient God, who makes no mistakes, open our minds and hearts to your mercy. Teach us to accept your grace without questioning your reasoning. Open our eyes, so that we can see ourselves as you see us. Amen."]], "302": [["info", "Twenty-second Sunday after Pentecost"], ["watchO", "Watchword for the week — You shall be holy, for I the Lord your God am holy. Leviticus 19:2"], ["dateVerse", "Sunday, October 29", "Leviticus 19:1-2,15-18", "Psalm 1", "1 Thessalonians 2:1-8", "Matthew 22:34-46"], ["watchD", "The Lord said, “Whom did you dread and fear so that you lied, and did not remember me?” Isaiah 57:11"], ["docT", "You did not receive the spirit of bondage again to fear, but you received the Spirit of adoption by whom we cry out, “Abba, Father.” Romans 8:15 NKJV"], ["prayer", "Forgive us, Father. Too often we think only of ourselves and become caught up in safeguarding our own interests. On this Sabbath day, let us visit with you. Restore us to right relationship with you. Keep us in the embrace of your holy presence. Amen."]], "303": [["dateVerse", "Monday, October 30", "Psalm 119:105–112", "Ezekiel 34:20–36:7", "1 Peter 3:8–22"], ["watchD", "The effect of righteousness will be peace, and the result of righteousness, quietness and trust forever. Isaiah 32:17"], ["docT", "If you know that Jesus Christ is righteous, you may be sure that everyone who does right has been born of him. 1 John 2:29"], ["prayer", "Divine Creator, sometimes we wonder about our purpose in life and struggle to make right choices. Forgive us when we lose sight of your most basic truth: you love us just as you made us. Remind us that we are yours and you are ours. In Jesus’ name, we pray. Amen."]], "304": [["dateVerse", "Tuesday, October 31", "Psalm 119:113–120", "Ezekiel 36:8–38", "1 Peter 4"], ["watchD", "We have all become like one who is unclean and all our righteous deeds are like a filthy cloth. Isaiah 64:6"], ["docT", "Jesus said, “The son said to him, ‘Father, I have sinned against heaven and before you; I am no longer worthy to be called your son.’ But the father said to his slaves, ‘Quickly, bring out a robe—the best one—and put it on him.’” Luke 15:21-22"], ["prayer", "We fall short in every way, O Lord. We sin every day. Your mercy, Father, is unbounded, and through the sacrifice of your one and only son, Jesus, you forgive us time and time again. Through your Spirit, empower us to go and sin no more. Amen."]], "305": [["info", "All Saints Day"], ["watchO", "Watchword for All Saints Day — Salvation belongs to our God who is seated on the throne, and to the Lamb! Revelation 7:10"], ["specialVerse", "All Saints Day", "Revelation 7:9-17", "Psalm 34:1-10,22", "1 John 3:1-3", "Matthew 5:1-12"], ["dateVerse", "Wednesday, November 1", "Psalm 119:121–128", "Ezekiel 37:1–38:6", "1 Peter 5"], ["watchD", "Remember the days of old; consider the generations long past. Ask your father and he will tell you, your elders, and they will explain to you. Deuteronomy 32:7 NIV"], ["docT", "I am reminded of your sincere faith, a faith that lived first in your grandmother Lois and your mother Eunice and now, I am sure, lives in you. 2 Timothy 1:5"], ["prayer", "Sustainer God, you care for humanity as a loving parent. We experience your love through the guidance of our faithful elders. Through their example, help us guide, care for, and deeply love those whom our lives touch each day. Amen."]], "306": [["dateVerse", "Thursday, November 2", "Psalm 119:129–136", "Ezekiel 38:7–39:13", "2 Peter 1:1–11"], ["watchD", "The Lord God has given me the tongue of disciples, that I may know how to sustain the weary one with a word. Isaiah 50:4 NASB"], ["docT", "When was it that we saw you sick or in prison and visited you? Matthew 25:39"], ["prayer", "Thank you for empowering each of us to serve and witness, dear Lord. We are grateful for those who have answered the call to ministry, who serve as pastors, teachers, or leaders. May we learn from them that our words and actions will help others come to know you. Amen."]], "307": [["dateVerse", "Friday, November 3", "Psalm 119:137–144", "Ezekiel 39:14–40:16", "2 Peter 1:12–21"], ["watchD", "Seek the Lord, all you humble of the land, who do his commands; seek righteousness, seek humility. Zephaniah 2:3"], ["docT", "As God’s chosen ones, holy and beloved, clothe yourselves with compassion, kindness, humility, meekness, and patience. Colossians 3:12"], ["prayer", "Your son, Jesus, taught us how to love unconditionally and serve humbly, dear Lord. May his example guide our thoughts and actions as we patiently, fervently, and graciously care for your children and your earth. Amen."]], "308": [["dateVerse", "Saturday, November 4", "Psalm 119:145–152", "Ezekiel 40:17–49", "2 Peter 2:1–10"], ["watchD", "As a mother comforts her child, so I will comfort you. Isaiah 66:13"], ["docT", "Jesus said, “Ask and you will receive, so that your joy may be complete.” John 16:24"], ["prayer", "Sustainer God, often when our lives feel out of control, we seek other sources to comfort us when we should first turn to you. Thank you for the saving grace that has been given to us through your son, Jesus Christ. Our joy is overflowing for your unconditional gift of love. Amen."]], "309": [["info", "Twenty-third Sunday after Pentecost"], ["watchO", "Watchword for the week — O send out your light and your truth; let them lead me. Psalm 43:3"], ["dateVerse", "Sunday, November 5", "Micah 3:5-12", "Psalm 43", "1 Thessalonians 2:9-13", "Matthew 23:1-12"], ["watchD", "Whoever pursues righteousness and kindness will find life and honor. Proverbs 21:21"], ["docT", "Strive first for the kingdom of God and his righteousness, and all these things will be given to you as well. Matthew 6:33"], ["prayer", "Each day is a gift from you, gracious God. The air we breathe, the trees that shade our paths, the water that nourishes us—are all gifts from you. Our congregation, our friends and family members, our coworkers, and our pets are blessings that we’ve received from you. In gratitude for all these gifts and more, let our lives be a blessing to you, to our earth, and to those around us. Amen."]], "310": [["dateVerse", "Monday, November 6", "Psalm 119:153–160", "Ezekiel 41:1–42:9", "2 Peter 2:11–22"], ["watchD", "Your way, O God, is holy. Psalm 77:13"], ["docT", "Jesus said, “I came from the Father and have come into the world.” John 16:28"], ["prayer", "God of all, since the beginning of time, you have provided for your people. Let us never take you for granted. May we always feel your presence, which upholds us and leads us to eternal life. Amen."]], "311": [["dateVerse", "Tuesday, November 7", "Psalm 119:161–168", "Ezekiel 42:10–43:21", "2 Peter 3:1–13"], ["watchD", "I will set up over them one shepherd and he shall feed them. Ezekiel 34:23"], ["docT", "When Jesus saw the crowds, he had compassion for them, because they were harassed and helpless, like sheep without a shepherd. Matthew 9:36"], ["prayer", "Christ our shepherd, lead us. It is so easy to be led astray by the din of the world and combative voices. As a shepherd makes wise decisions for his flock, may we make choices today that advance your way of love and compassionate care for others. Amen."]], "312": [["dateVerse", "Wednesday, November 8", "Psalm 119:169–176", "Ezekiel 43:22–44:27", "2 Peter 3:14–1 John 1:4"], ["watchD", "Blessed is the one who comes in the name of the Lord. Psalm 118:26"], ["docT", "But to all who received him, who believed in his name, he gave power to become children of God. John 1:12"], ["prayer", "Through you, Christ, we are joined together with people across our country and around the world; some we know well and many we will never meet. We thank you for this unity and look forward to the day when we will sing your praise together as one. Amen."]], "313": [["dateVerse", "Thursday, November 9", "Psalm 120", "Ezekiel 44:28–45:25", "1 John 1:5–2:11"], ["watchD", "I had said in my alarm, “I am driven far from your sight.” But you heard my supplications when I cried out to you for help. Psalm 31:22"], ["docT", "The Spirit helps us in our weakness; for we do not know how to pray as we ought, but that very Spirit intercedes with sighs too deep for words. Romans 8:26"], ["prayer", "When our pain and sadness keep us from feeling your light and we hear only silence, we still know that we are not alone. The Spirit is our companion. O Lord of the fertile ground and desert places, thank you for keeping us whole. Amen."]], "314": [["dateVerse", "Friday, November 10", "Psalm 121", "Ezekiel 46:1–47:12", "1 John 2:12–17"], ["watchD", "Woe to those who are wise in their own eyes and clever in their own sight. Isaiah 5:21 NIV"], ["docT", "All of you must clothe yourselves with humility. 1 Peter 5:5"], ["prayer", "Compassionate God, forgive us for our self-centeredness and for our love of having many things and amassing more stuff. Help us to live in the world, but not be consumed by its ways. Let all that we do, say, and own be a reflection of our love for you. Amen. "]], "315": [["dateVerse", "Saturday, November 11", "Psalm 122", "Ezekiel 47:13–48:22", "1 John 2:18–29"], ["watchD", "Jacob went on his way and the angels of God met him. Genesis 32:1"], ["docT", "Are not all angels spirits in the divine service, sent to serve for the sake of those who are to inherit salvation? Hebrews 1:14"], ["prayer", "For the many times that friends and strangers have served as angels in our lives, we thank you, God. Remind us not to be surprised, but to expect that others are moved by the Spirit, and together we can share your light as your gathered people. Amen. "]], "316": [["info", "Twenty-fourth Sunday after Pentecost"], ["watchO", "Watchword for the week — Keep awake therefore, for you know neither the day nor the hour. Matthew 25:13"], ["dateVerse", "Sunday, November 12", "Amos 5:18-24", "Psalm 70", "1 Thessalonians 4:13-18", "Matthew 25:1-13"], ["watchD", "Joseph said to his brothers, “Do not quarrel along the way.” Genesis 45:24"], ["docT", "Bear with one another and, if anyone has a complaint against another, forgive each other; just as the Lord has forgiven you, so you also must forgive. Colossians 3:13"], ["prayer", "Lord, it can be so difficult to forgive after we’ve been hurt. There is no shortage of stories of people being taken advantage of, done wrong to, or worse. We want justice. We want to know why. Christ has shown us that forgiveness must come first. Spirit, fill us with the strength to forgive, as this is the cornerstone of reconciliation. Amen. "]], "317": [["info", "Chief Elder Festival"], ["specialVerse", "Chief Elder Festival†", "Ezekiel 34:11-16,23-24", "Psalm 8", "Hebrews 4:14-16", "John 10:1-10"], ["dateVerse", "Monday, November 13", "Psalm 123", "Ezekiel 48:23–Daniel 1:21", "1 John 3:1–10"], ["watchD", "The Lord God has opened my ear; and I was not disobedient. Nor did I turn back. Isaiah 50:5 NASB"], ["docT", "Jesus said, “They will listen to my voice. So there will be one flock, one shepherd.” John 10:16"], ["prayer", "God, you have given us a story to share with all of humanity. Through your infinite love, you sent your son to bring salvation for all. Christ the shepherd will lead your flock. With Moravians around the world, today we celebrate that Christ is our shepherd and Chief Elder. With eternal gratefulness, we follow his loving example. Amen."], ["info", "†On this day in 1741, it was announced in all Moravian congregations that Jesus Christ had been chosen Chief Elder of the Moravian Church. The Moravian Church has had no single human chief executive since then, and now observes this is a festival day."]], "318": [["dateVerse", "Tuesday, November 14", "Psalm 124", "Daniel 2:1–33", "1 John 3:11–24"], ["watchD", "The Lord said, “I will not continually accuse, nor will I always be angry.” Isaiah 57:16"], ["docT", "In Christ God was reconciling the world to himself, not counting their trespasses against them, and entrusting the message of reconciliation to us. 2 Corinthians 5:19"], ["prayer", "Forgiving God, we have often fallen short of what you want from us. Thank you for not keeping a tally of those failures and help us extend that grace to our relationships. Strengthen us, so that we can stand firm in your love as challenges confront us today and always. Amen."]], "319": [["dateVerse", "Wednesday, November 15", "Psalm 125", "Daniel 2:34–3:18", "1 John 4:1–16a"], ["watchD", "Ho, everyone who thirsts, come to the waters. Isaiah 55:1"], ["docT", "That evening, at sunset, they brought to him all who were sick or possessed with demons. Mark 1:32"], ["prayer", "Lord, we are weary travelers. We don’t know what lies around the next corner or over the next hill. Thank you for walking with us, side by side. You offer us strength and guidance, particularly when we face our demons. Thank you for your companionship on our journey. Amen."]], "320": [["dateVerse", "Thursday, November 16", "Psalm 126", "Daniel 3:19–4:18", "1 John 4:16b–5:5"], ["watchD", "I will make an everlasting covenant with them, never to draw back from doing good to them. Jeremiah 32:40"], ["docT", "God’s love was revealed among us in this way: God sent his only Son into the world so that we might live through him. 1 John 4:9"], ["prayer", "Gracious God, you have called us in covenant to live in harmony with you, with others, and with the world that surrounds us. We know that you will not break this promise, because you sent your son, Jesus, to seal it with his life and death. May we always be faithful to you and forgive us when we falter. Amen."]], "321": [["dateVerse", "Friday, November 17", "Psalm 127", "Daniel 4:19–5:16", "1 John 5:6–21"], ["watchD", "My thoughts are not your thoughts, nor are your ways my ways, says the Lord. Isaiah 55:8"], ["docT", "For God’s foolishness is wiser than human wisdom, and God’s weakness is stronger than human strength. 1 Corinthians 1:25"], ["prayer", "Eternal God, you have always been and will always be. You extend beyond our capacity to comprehend. You chose to fashion us, care for us, and provide for us the opportunity for eternal life through your son, Jesus Christ. Thank you for your love beyond comprehension. Amen."]], "322": [["dateVerse", "Saturday, November 18", "Psalm 128", "Daniel 5:17–6:18", "2 John"], ["watchD", "The war horse is a vain hope for victory, and by its great might it cannot save. Truly the eye of the Lord is on those who fear him, on those who hope in his steadfast love. Psalm 33:17-18"], ["docT", "We boast in Christ Jesus and have no confidence in the flesh. Philippians 3:3"], ["prayer", "Christ our redeemer, in our hearts, we want to love and serve you. Help us not to be caught up with the temptations of our day, or to let our love for you grow lukewarm. The storms of life often push us into sinking sand. Thank you for not turning away from us. Amen."]], "323": [["info", "Twenty-fifth Sunday after Pentecost"], ["watchO", "Watchword for the week — So teach us, O God, to count our days that we may gain a wise heart. Psalm 90:12"], ["dateVerse", "Sunday, November 19", "Zephaniah 1:7,12-18", "Psalm 90:1-8,(9-11),12", "1 Thessalonians 5:1-11", "Matthew 25:14-30"], ["watchD", "The lips of a priest should guard knowledge, and people should seek instruction from his mouth, for he is the messenger of the Lord of hosts. Malachi 2:7"], ["docT", "Always be prepared to give an answer to everyone who asks you to give the reason for the hope that you have. 1 Peter 3:15 NIV"], ["prayer", "God, we thank you for those who have accepted your call to serve as leaders of our faith communities. We are grateful for their insights and instruction, and for the humanity they bring to your work here on earth. Help each of us to recognize that we, too, are called to be witnesses to your love to a world in need. Amen. "]], "324": [["dateVerse", "Monday, November 20", "Psalm 129", "Daniel 6:19–7:22", "3 John"], ["watchD", "Turn, O Lord! How long? Have compassion on your servants! Psalm 90:13"], ["docT", "Jesus said, “I will come again and will take you to myself, so that where I am, there you may be also.” John 14:3"], ["prayer", "Jesus, you are with us in times of distress and fear. Sometimes we don’t recognize you or hear your voice, but your steadfast hand is always there. Help us see and hear you and to feel your calming touch. Amen."]], "325": [["dateVerse", "Tuesday, November 21", "Psalm 130", "Daniel 7:23–8:27", "Jude 1:1–10"], ["watchD", "Thus far the Lord has helped us. 1 Samuel 7:12"], ["docT", "Paul said, “To this day I have had help from God, and so I stand here, testifying.” Acts 26:22"], ["prayer", "Gracious God, we rejoice in the constant assurance that you are with us. No matter how far we stray, you are always with us. You share our pain and delight in our joys. Today, we will make a point of telling a friend about the strength we receive from your love. What a joy it will be to share. Amen."]], "326": [["dateVerse", "Wednesday, November 22", "Psalm 131", "Daniel 9:1–10:7", "Jude 1:11–25"], ["watchD", "How can a mortal be just before God? If one wished to contend with him, one could not answer him once in a thousand. Job 9:2-3"], ["docT", "I will get up and go to my father, and I will say to him, “Father, I have sinned against heaven and before you.” Luke 15:18"], ["prayer", "The grace that you have extended to us, dear God, is difficult to comprehend. Your forgiveness of our sins is so radical in a world where people still seek an eye for an eye. Thank you for setting this example, and for being our strength when it is our turn to forgive a wrong done to us. Your grace is life-giving. Amen."]], "327": [["dateVerse", "Thursday, November 23", "Psalm 132", "Daniel 10:8–11:19", "Revelation 1:1–8"], ["watchD", "God, you know my folly; the wrongs I have done are not hidden from you. Psalm 69:5"], ["docT", "In him we have redemption through his blood, the forgiveness of our trespasses, according to the riches of his grace. Ephesians 1:7"], ["prayer", "Generous God, you have provided every blessing in abundance. As we acknowledge your gifts with thankfulness, we hear your call to share what we have received. And so, we pray that you give us glad and generous hearts and lives that abound in your service. Amen."]], "328": [["dateVerse", "Friday, November 24", "Psalm 133", "Daniel 11:20–12:7", "Revelation 1:9–20"], ["watchD", "I will say, “They are my people;” and they will say, “The Lord is our God.” Zechariah 13:9 "], ["docT", "God will dwell with them; they will be his peoples, and God himself will be with them; he will wipe every tear from their eyes. Revelation 21:3-4"], ["prayer", "Ever-present God, you know our thoughts before we speak and our pain before we cry out. Even in the darkest times, we are not alone, because your Spirit dwells within us. Thank you for holding us in your firm and comforting hand. Amen."]], "329": [["dateVerse", "Saturday, November 25", "Psalm 134", "Daniel 12:8–Hosea 2:15", "Revelation 2:1–11"], ["watchD", "All that the Lord has spoken we will do, and we will be obedient. Exodus 24:7"], ["docT", "But be doers of the word, and not merely hearers who deceive themselves. James 1:22"], ["prayer", "Lord, you have called us to be doers of the word. Grant us the courage and conviction to love all your children without judgement. Forgive us when we fall short and misrepresent your will. Let us serve you in gladness and find sheer joy in loving others unconditionally. Amen. "]], "330": [["info", "Reign of Christ Sunday"], ["watchO", "Watchword for the week — God said, “I will seek the lost, and I will bring back the strayed, and I will bind up the injured, and I will strengthen the weak.” Ezekiel 34:16"], ["dateVerse", "Sunday, November 26", "Ezekiel 34:11-16,20-24", "Psalm 95:1-7a", "Ephesians 1:15-23", "Matthew 25:31-46"], ["watchD", "The Lord is good, a stronghold in the day of trouble; and he knows those who trust in him. Nahum 1:7 NKJV"], ["docT", "Ask, and it will be given you; search, and you will find; knock, and the door will be opened for you. Matthew 7:7"], ["prayer", "Dear God, through your son, Jesus Christ, you have given us a blueprint for a purposeful life and an invitation to eternal life. Thank you for opening the door when we knock. May our lives reflect our gratitude for your love. May others come to know you through our joy. Amen."]], "331": [["dateVerse", "Monday, November 27", "Psalm 135:1–12", "Hosea 2:16–4:19", "Revelation 2:12–23"], ["watchD", "Do not oppress the widow, the orphan, the alien, or the poor. Zechariah 7:10"], ["docT", "That is not the way you learned Christ! Ephesians 4:20"], ["prayer", "Loving Christ, you were the master of doing remarkable acts of kindness—feeding the masses, healing the leper, loving the unlovable. Today, we resolve to reach out to a person we do not know and treat them with kindness in your name. Thank you for letting us know how to express compassion. Amen."]], "332": [["dateVerse", "Tuesday, November 28", "Psalm 135:13–21", "Hosea 5,6,7", "Revelation 2:24–3:6"], ["watchD", "The unfolding of your words gives light; it imparts understanding to the simple. Psalm 119:130"], ["docT", "For once you were darkness, but now in the Lord you are light. Live as children of light. Ephesians 5:8"], ["prayer", "Gracious God, surrounding me today are countless acts of healing, moments of learning, and opportunities to praise you for the wonders of your creation. We thank you for your wondrous embrace. May we be a light in the lives of others as Christ is the light in ours. Amen."]], "333": [["dateVerse", "Wednesday, November 29", "Psalm 136", "Hosea 8,9", "Revelation 3:7–18"], ["watchD", "Help, O Lord, for there is no longer anyone who is godly; the faithful have disappeared from humankind. Psalm 12:1"], ["docT", "So Jesus asked the twelve, “Do you also wish to go away?” John 6:67"], ["prayer", "Loving God, we can’t imagine how you feel when you see us continually hurt each other, tell lies, and discriminate because of gender, race, or economics. Thank you for not turning your back on us. Strengthen us with the Holy Spirit, and, with other faithful ones who know you so well, let us not turn away from taking a stand in your loving name. Amen. "]], "334": [["dateVerse", "Thursday, November 30", "Psalm 137", "Hosea 10,11,12", "Revelation 3:19–4:8"], ["watchD", "For you who revere my name the sun of righteousness shall rise, with healing in its wings. Malachi 4:2"], ["docT", "The night is far gone, the day is near. Romans 13:12"], ["prayer", "You so loved the world, O God, that you sent your son to bring light into the darkness. May we abide in that light, serving as instruments of your transforming love in our homes, our jobs, and our relationships. Amen."]], "335": [["dateVerse", "Friday, December 1", "Psalm 138:1–5", "Hosea 13,14", "Revelation 4:9–5:10"], ["watchD", "See, I will refine and test my people. Jeremiah 9:7 NIV"], ["docT", "The one who endures to the end will be saved. Mark 13:13"], ["prayer", "Enduring and everlasting God, we are your people. As we strive to follow your guidance in all areas of life, help us to pursue your holy will for humankind. Amen."]], "336": [["dateVerse", "Saturday, December 2", "Psalm 138:6–8", "Joel 1:1–2:14", "Revelation 5:11–6:8"], ["watchD", "Be gracious to me, O Lord, for I am in distress. Psalm 31:9"], ["docT", "His disciples awoke Jesus, saying, “Lord, save us! We are perishing!” But he said to them, “Why are you fearful, O you of little faith?” Then he arose and rebuked the winds and the sea, and there was a great calm. Matthew 8:25-26 NKJV"], ["prayer", "O Lord of sea and sky, calm our fears and grant to us a quiet spirit. As we transition from one season to another, let us find comfort in these words of hope and promise. Restore our faith. Amen."]], "337": [["info", "First Sunday in Advent"], ["watchO", "Watchword for the week — Then they will see ‘the Son of Man coming in clouds’ with great power and glory. Mark 13:26"], ["dateVerse", "Sunday, December 3", "Isaiah 64:1-9", "Psalm 80:1-7,17-19", "1 Corinthians 1:3-9", "Mark 13:24-37"], ["watchD", "The Lord will again comfort Zion. Zechariah 1:17"], ["docT", "Simeon was looking forward to the consolation of Israel, and the Holy Spirit rested on him. Luke 2:25"], ["prayer", "O promise-keeping God, through prophets and patriarchs, we hear the good news of salvation and restoration. May your spirit rest upon us in these days of Advent. In your name, we pray. Amen."]], "338": [["dateVerse", "Monday, December 4", "Psalm 139:1–6", "Joel 2:15–3:21", "Revelation 6:9–7:17"], ["watchD", "Do not fear, for I am with you; do not be afraid, for I am your God. Isaiah 41:10 NIV"], ["docT", "The children were crying out in the temple, “Hosanna to the Son of David.” Matthew 21:15"], ["prayer", "O God of children who sang prophetic praises in the streets long ago, amplify our voices into one resounding song of glory and promise in our days. Never let us forget your comforting presence as we journey through the week. We pray this, in Jesus’ name. Amen."]], "339": [["dateVerse", "Tuesday, December 5", "Psalm 139:7–12", "Amos 1,2,3", "Revelation 8"], ["watchD", "When deeds of iniquity overwhelm us, you forgive our transgressions. Psalm 65:3"], ["docT", "When the fullness of time had come, God sent his Son, born of a woman, born under the law, in order to redeem those who were under the law, so that we might receive adoption as children. Galatians 4:4-5"], ["prayer", "Forgiving Creator, we are humbled to see your great promise fulfilled in the birth of Jesus, the Christ. Forgive us of our sins as we grow in grace; bless us with grateful hearts and a new identity as children of God. Amen."]], "340": [["dateVerse", "Wednesday, December 6", "Psalm 139:13–16", "Amos 4,5", "Revelation 9:1–11"], ["watchD", "Your days of mourning shall be ended. Isaiah 60:20"], ["docT", "The Word became flesh and lived among us, and we have seen his glory, the glory as of a father’s only son, full of grace and truth. John 1:14"], ["prayer", "Mysterious and majestic God, we long for the coming of Jesus, our Lord, with grace and glory. May your divine word live in our hearts, so that we may bear witness to your love for the entire world. Amen."]], "341": [["dateVerse", "Thursday, December 7", "Psalm 139:17–24", "Amos 6,7", "Revelation 9:12–21"], ["watchD", "The Israelites cried to the Lord, saying, “We have sinned against you, because we have abandoned our God.” Judges 10:10"], ["docT", "Zechariah said, “You will go before the Lord to prepare his ways, to give knowledge of salvation to his people by the forgiveness of their sins.” Luke 1:76-77"], ["prayer", "O Holy One, ageless and forgiving, timeless and loving, we bow before you confessing our unrighteousness. We humbly ask that you restore us to a place of favor in your sight. In the name of Jesus, we pray. Amen."]], "342": [["dateVerse", "Friday, December 8", "Psalm 140:1–5", "Amos 8,9", "Revelation 10"], ["watchD", "Do not remember the former things, or consider the things of old. I am about to do a new thing; now it springs forth, do you not perceive it? Isaiah 43:18-19"], ["docT", "The kingdom of heaven is like a mustard seed that someone took and sowed in his field. Matthew 13:31"], ["prayer", "Like a gardener, O God, you plant seeds of hope in our world even when we do not perceive your work among us. As we prepare ourselves during this season of hope, give us a renewed sense of gratitude for your kingdom which is always unfolding. Amen."]], "343": [["dateVerse", "Saturday, December 9", "Psalm 140:6–13", "Obadiah 1", "Jonah 1,2", "Revelation 11:1–14"], ["watchD", "You, Lord, brought me up from the realm of the dead; you spared me from going down to the pit. Psalm 30:3 NIV"], ["docT", "Jesus said, “The hour is coming, and is now here, when the dead will hear the voice of the Son of God, and those who hear will live.” John 5:25"], ["prayer", "O God, death is not the end to those who love you. Thank you for the gift of life eternal as we confess our faith in you, our redeemer, friend, and savior. Amen."]], "344": [["info", "Second Sunday in Advent"], ["watchO", "Watchword for the week — He will feed his flock like a shepherd; he will gather the lambs in his arms, and carry them in his bosom. Isaiah 40:11"], ["dateVerse", "Sunday, December 10", "Isaiah 40:1-11", "Psalm 85:1-2,8-13", "2 Peter 3:8-15a", "Mark 1:1-8"], ["watchD", "What god in heaven or on earth can perform deeds and mighty acts like yours! Deuteronomy 3:24"], ["docT", "There are different kinds of working, but in all of them and in everyone it is the same God at work. 1 Corinthians 12:6 NIV"], ["prayer", "O divine Master, how great are you in all your works. Let your spirit fill our lives with gifts of power and purpose, so that your kingdom may prosper and fulfill your design. Amen."]], "345": [["dateVerse", "Monday, December 11", "Psalm 141:1–4", "Jonah 3,4", "Revelation 11:15–12:6"], ["watchD", "O Lord, all my longing is known to you; my sighing is not hidden from you. Psalm 38:9"], ["docT", "And this is the boldness we have in him, that if we ask anything according to his will, he hears us. 1 John 5:14"], ["prayer", "Healer of the nations, speak to our hearts this day as we consider the challenges and concerns of our lives. Sustain us with your spirit in all our endeavors this week. In your name, we pray. Amen."]], "346": [["dateVerse", "Tuesday, December 12", "Psalm 141:5–10", "Micah 1– 3:7", "Revelation 12:7–18"], ["watchD", "God blessed the seventh day and hallowed it, because on it God rested from all the work that he had done. Genesis 2:3"], ["docT", "And the peace of God, which surpasses all understanding, will guard your hearts and your minds in Christ Jesus. Philippians 4:7"], ["prayer", "Lord of creation, may we find sabbath rest in all our activities—work, leisure, tasks, and obligations. In this complex world in which we live, give us peace. Thank you, Lord. Amen."]], "347": [["dateVerse", "Wednesday, December 13", "Psalm 142", "Micah 3:8–5:15", "Revelation 12:19–13:10"], ["watchD", "Even before a word is on my tongue, O Lord, you know it completely. Psalm 139:4"], ["docT", "The Lord will bring to light what is hidden in darkness and will expose the motives of the heart. 1 Corinthians 4:5 NIV"], ["prayer", "Merciful God, in the assurance of your grace, we confess our sins and seek your guidance in both the light and dark moments of our lives. May your light bring us hope and restoration in our daily living. In your name, we pray. Amen."]], "348": [["dateVerse", "Thursday, December 14", "Psalm 143:1–6", "Micah 6,7", "Revelation 13:11–14:5"], ["watchD", "Light dawns for the righteous, and joy for the upright in heart. Psalm 97:11"], ["docT", "Jesus said, “Then the kingdom of heaven will be like this: Ten bridesmaids took their lamps and went to meet the bridegroom. Five of them were foolish, and five were wise.” Matthew 25:1-2"], ["prayer", "Keeper of promises, gather us to your bosom as we seek refuge from the challenges around us. As wise servants in your kingdom, let us choose peace, hope, and love. In your name, we pray. Amen."]], "349": [["dateVerse", "Friday, December 15", "Psalm 143:7–12", "Nahum 1,2", "Revelation 14:6–16"], ["watchD", "Some went down to the sea in ships, and saw the deeds of the Lord, his wondrous works in the deep. Let them thank the Lord for his steadfast love, for his wonderful works to humankind. Psalm 107:23,24,31"], ["docT", "After we had reached safety, we then learned that the island was called Malta. The natives showed us unusual kindness. They kindled a fire and welcomed all of us around it. Acts 28:1-2"], ["prayer", "Welcoming Creator, we thank you for your hospitality and provisions for all of us. In our daily work, may we be kind to others, and so become ambassadors of your royal law. Amen."]], "350": [["dateVerse", "Saturday, December 16", "Psalm 144:1–4", "Nahum 3", "Habakkuk 1", "Revelation 14:17–15:8"], ["watchD", "In response to his people the Lord said, “I am sending you grain, wine, and oil, and you will be satisfied.” Joel 2:19"], ["docT", "Taking the five loaves and the two fish, Jesus looked up to heaven, and blessed and broke the loaves, and gave them to the disciples, and the disciples gave them to the crowds. And all ate and were filled. Matthew 14:19-20"], ["prayer", "Through your sustaining spirit, we are fed with good provisions for all of us, O Lord. As people of faith, let us share the abundance of God’s provisions with those in need. Thank you, God. Amen."]], "351": [["info", "Third Sunday in Advent"], ["watchO", "Watchword for the week — May the God of peace sanctify you entirely; and may your spirit and soul and body be kept sound and blameless at the coming of our Lord Jesus Christ. 1 Thessalonians 5:23"], ["dateVerse", "Sunday, December 17", "Isaiah 61:1-4, 8-11", "Psalm 126", "1 Thessalonians 5:16-24", "John 1:6-8,19-28"], ["watchD", "God is not a human being, that he should lie, or a mortal, that he should change his mind. Numbers 23:19"], ["docT", "As surely as God is faithful, our word to you has not been “Yes and No.” For the Son of God, Jesus Christ, whom we proclaimed among you, Silvanus and Timothy and I, was not “Yes and No”; but in him it is always “Yes.” 2 Corinthians 1:18-19"], ["prayer", "Sustaining Provider, our faith is firmly placed in your divine “Yes.” May this Advent season be filled with the realization of your majestic presence in all that we ask or hope for in this life. In Jesus’ name, we pray. Amen."]], "352": [["dateVerse", "Monday, December 18", "Psalm 144:5–8", "Habakkuk 2,3", "Revelation 16:1–11"], ["watchD", "He changes times and seasons, deposes kings and sets up kings. Daniel 2:21"], ["docT", "He has brought down the powerful from their thrones, and lifted up the lowly. Luke 1:52"], ["prayer", "O God, like Mary, we sense the coming kingdom as one that confounds even the wise and powerful. As we continue this Advent journey, keep us focused on your eternal kingdom. Amen."]], "353": [["dateVerse", "Tuesday, December 19", "Psalm 144:9–15", "Zephaniah 1,2", "Revelation 16:12–21"], ["watchD", "The eyes of the Lord are on the righteous, and his ears are open to their cry. Psalm 34:15"], ["docT", "Rejoice in hope, be patient in suffering, persevere in prayer. Romans 12:12"], ["prayer", "Lord God of healing, let us find our wholeness in your constant provisions of deep concern and compassion for all your children. In your name, we pray. Amen."]], "354": [["dateVerse", "Wednesday, December 20", "Psalm 145:1–7", "Zephaniah 3", "Haggai 1", "Revelation 17:1–8"], ["watchD", "Bless the Lord, who forgives all your iniquity, who heals all your diseases. Psalm 103:2,3"], ["docT", "In this is love, not that we loved God but that he loved us and sent his Son to be the atoning sacrifice for our sins. 1 John 4:10"], ["prayer", "Forgiving God, as we confess our sins, restore us and renew our devotion to you. Thank you for the gift of your son, Jesus Christ, who forgives sin daily and abundantly. Amen."]], "355": [["dateVerse", "Thursday, December 21", "Psalm 145:8–16", "Haggai 2", "Revelation 17:9–18"], ["watchD", "I will put my Spirit in you and you will live, and I will settle you in your own land. Then you will know that I the Lord have spoken, and I have done it. Ezekiel 37:14 NIV"], ["docT", "Where the Spirit of the Lord is, there is freedom. 2 Corinthians 3:17"], ["prayer", "O Lord of ancient lands and places, let your Spirit rest upon us. Help us to claim your promises of freedom and new life in your heavenly kingdom. In your name, we pray. Amen."]], "356": [["dateVerse", "Friday, December 22", "Psalm 145:17–21", "Zechariah 1,2", "Revelation 18:1–10"], ["watchD", "If you will not listen to the voice of the Lord, then the hand of the Lord will be against you, as it was against your fathers. 1 Samuel 12:15 NASB"], ["docT", "But those who look into the perfect law, the law of liberty, and persevere, being not hearers who forget but doers who act—they will be blessed in their doing. James 1:25"], ["prayer", "Remembering God, throughout the ages, you have led your people in times of disobedience and obedience. As we observe your law, help us to choose wisely in all our actions. Amen."]], "357": [["dateVerse", "Saturday, December 23", "Psalm 146", "Zechariah 3–5", "Revelation 18:11–24"], ["watchD", "The Lord said, “I desire steadfast love and not sacrifice, the knowledge of God rather than burnt-offerings.” Hosea 6:6"], ["docT", "Therefore, love is the fulfilling of the law. Romans 13:10"], ["prayer", "Most holy God, let us love not only in word and deed, but in our devotion to you. In the deepest part of our being, instill within us the truth of your constant love for all people. In your name, we pray. Amen."]], "358": [["info", "Fourth Sunday in Advent"], ["watchO", "Watchword for the week — The Mighty One has done great things for me, and holy is his name. Luke 1:49"], ["dateVerse", "Sunday, December 24", "2 Samuel 7:1-11,16", "Luke 1:47-55", "Romans 16:25-27", "Luke 1:26-38"], ["watchD", "For darkness shall cover the earth, and thick darkness the peoples; but the Lord will arise upon you, and his glory will appear over you. Isaiah 60:2"], ["docT", "When the angels had left them and gone into heaven, the shepherds said to one another, “Let us go now to Bethlehem and see this thing that has taken place, which the Lord has made known to us.” Luke 2:15"], ["prayer", "With excitement, great God, we, like the shepherds, look for your glory to be revealed in the birth of Jesus. May our proclamation be filled with joy and promise. Come Lord Jesus, come. Amen."]], "359": [["info", "Nativity of the Lord (Christmas)"], ["watchO", "Watchword for the Nativity — Jesus is the reflection of God’s glory and the exact imprint of God’s very being, and he sustains all things by his powerful word. Hebrews 1:3"], ["specialVerse", "Nativity of the Lord (Christmas)", "Isaiah 52:7-10", "Psalm 98", "Hebrews 1:1-4,(5-12)", "John 1:1-14"], ["dateVerse", "Monday, December 25", "Psalm 147:1–6", "Zechariah 6,7", "Revelation 19:1–8"], ["watchD", "O Lord, I am oppressed; be my security! Isaiah 38:14"], ["docT", "To you is born this day a Savior. Luke 2:11"], ["prayer", "Today, we celebrate in our homes and churches; we rejoice in the Savior’s birth. Let our focus today be on the word that was made flesh, our Lord, Jesus Christ. We give thanks to God for this most wonderful gift today. Amen."]], "360": [["dateVerse", "Tuesday, December 26", "Psalm 147:7–14", "Zechariah 8,9", "Revelation 19:9–21"], ["watchD", "I, the Lord, am your Savior and your Redeemer, the Mighty One. Isaiah 60:16"], ["docT", "It has now been revealed through the appearing of our Savior Christ Jesus, who abolished death and brought life and immortality to light through the gospel. 2 Timothy 1:10"], ["prayer", "Lord God, revealed in Jesus, the closing days of a year provide for us a time of reflection. As we conclude the year, let us give thanks for the gifts of life, hope, and abundant joy that overcome death! Amen."]], "361": [["dateVerse", "Wednesday, December 27", "Psalm 147:15–20", "Zechariah 10,11", "Revelation 20:1–10"], ["watchD", "I am the first and I am the last; besides me there is no god. Isaiah 44:6"], ["docT", "Pray then in this way: Our Father in heaven, hallowed be your name. Matthew 6:9"], ["prayer", "Our Father in heaven, with our whole being we worship you. In your name, we offer our petitions and supplications. In the assurance of your great mercy and love, lead us forward with courage. Amen."]], "362": [["dateVerse", "Thursday, December 28", "Psalm 148:1–6", "Zechariah 12,13", "Revelation 20:11–21:8"], ["watchD", "You cause the grass to grow for the cattle, and plants for people to use, to bring forth food from the earth. Psalm 104:14"], ["docT", "Give thanks to God the Father at all times and for everything in the name of our Lord Jesus Christ. Ephesians 5:20"], ["prayer", "Creator of all things, as the world changes and seasons come and go, we reflect on your artistry in all of creation. We give thanks for the blessings of this beautiful, complex world. Amen."]], "363": [["dateVerse", "Friday, December 29", "Psalm 148:7–14", "Zechariah 14-Malachi 1", "Revelation 21:9–27"], ["watchD", "When you return to the Lord your God, then the Lord your God will restore you from captivity, and have compassion on you. Deuteronomy 30:2,3 NASB"], ["docT", "The time is fulfilled, and the kingdom of God has come near; repent, and believe in the good news. Mark 1:15"], ["prayer", "Merciful God, we confess our shortcomings and stubbornness in our behavior and actions. Help us to conform to your will in our thoughts and how we live. In your name, we pray. Amen."]], "364": [["dateVerse", "Saturday, December 30", "Psalm 149-150", "Malachi 2-4", "Revelation 22"], ["watchD", "Joseph said to his master’s wife, who tried to seduce him, “How then could I do this great wickedness, and sin against God?” Genesis 39:9"], ["docT", "For God did not call us to be impure, but to live a holy life. 1 Thessalonians 4:7 NIV"], ["prayer", "Lord God, we are often careless in our interactions with those around us. Cleanse our hearts from impurity and corruptness. Restore us to new life and keep us on the path to right living. Amen."]], "365": [["info", "First Sunday after Christmas"], ["watchO", "Watchword for the week — But when the fullness of time had come, God sent his Son, born of a woman, born under the law, in order to redeem those who were under the law, so that we might receive adoption as children. Galatians 4:4,5"], ["dateVerse", "Sunday, December 31", "Isaiah 61:10-62:3", "Psalm 148", "Galatians 4:4-7", "Luke 2:22-40"], ["watchD", "For a brief moment I abandoned you, but with great compassion I will gather you. Isaiah 54:7"], ["docT", "Now may our Lord Jesus Christ himself and God our Father, who loved us and through grace gave us eternal comfort and good hope, comfort your hearts and strengthen them in every good work and word. 2 Thessalonians 2:16-17"], ["prayer", "Gentle Savior, gracious God, and loving Spirit, you are consistent in your dealings with your children. As you gather us together in worship this day, let us renew our covenant with you. Bless us, O Lord, and help us to grow in grace this day. Amen."]]}