{"1": [["dateVerse", "Monday, January 1, 2024", "Psalm 1", "Genesis 1:1-2:3", "Matthew 1:1-17"], ["watchD", "Take heed, be quiet, do not fear, and do not let your heart be faint. Isaiah 7:4"], ["docT", "Jesus said, “The Spirit of the Lord is upon me, because he has anointed me. He has sent me to proclaim the year of the Lord’s favor. Today this scripture has been fulfilled in your hearing.” Luke 4:18,19,21"], ["prayer", "O God of new beginnings, like years past, the year ahead will bring its own experiences of success and joy, as well as failure and loss. Help us meet the unwritten with faith and the assurance of your presence. Amen."]], "2": [["dateVerse", "Tuesday, January 2, 2024", "Psalm 2", "Genesis 2:4-25", "Matthew 1:18-25"], ["watchD", "With a free will offering I will sacrifice to you; I will give thanks to your name, O Lord, for it is good. Psalm 54:6"], ["docT", "A poor widow came and put in two small copper coins. Mark 12:42"], ["prayer", "We forget, O God, it is not the size that makes a gift sacred, but it is the heart of the one who gives it. May all our gifts to you be gifts that come from our hearts, and not just from our wallets. Amen."]], "3": [["dateVerse", "Wednesday, January 3, 2024", "Psalm 3", "Genesis 3,4", "Matthew 2:1-12"], ["watchD", "Balaam answered them, “Even if Balak gave me all the silver and gold in his palace, I could not do anything great or small to go beyond the command of the Lord my God.” Numbers 22:18 NIV"], ["docT", "We must obey God rather than any human authority. Acts 5:29"], ["prayer", "We pray, O precious God, that others will see your love in our lives and actions. We also pray to keep our eyes, ears, and hearts open to the tasks you need us to do and the paths to take. In Jesus’ name, we pray. Amen."]], "4": [["dateVerse", "Thursday, January 4, 2024", "Psalm 4", "Genesis 5", "Matthew 2:13-23"], ["watchD", "Nations shall come to your light and kings to the brightness of your dawn. Isaiah 60:3"], ["docT", "The city has no need of sun or moon to shine on it, for the glory of God is its light, and its lamp is the Lamb The nations will walk by its light. Revelation 21:23-24"], ["prayer", "Guiding Light, shine into the dark places in our lives and in our world. Help us to see your grace, mercy, and love. Help us to follow and to walk in your Light. In Jesus’ name, we pray. Amen."]], "5": [["dateVerse", "Friday, January 5, 2024", "Psalm 5", "Genesis 6:1-7:10", "Matthew 3"], ["watchD", "Let us go to entreat the favor of the Lord and to seek the Lord of hosts; I myself am going. Zechariah 8:21"], ["docT", "When Lydia and her household were baptized, she urged us, saying, “If you have judged me to be faithful to the Lord, come and stay at my home.” Acts 16:15"], ["prayer", "Loving God, as we strive to be faithful to you and our calling, what we pray for, what we entreat of you, what we want most, is for you to make your home with us. Come, O God, and be our guest. Amen."]], "6": [["info", "Epiphany of the Lord"], ["specialVerse", "Epiphany of the Lord", "Isaiah 60:1-6", "Psalm 72:1-7,10-14", "Ephesians 3:1-12", "Matthew 2:1-12"], ["watchO", "Watchword for the Epiphany — Arise, shine; for your light has come, and the glory of the Lord has risen upon you. Isaiah 60:1"], ["dateVerse", "Saturday, January 6, 2024", "Psalm 6", "Genesis 7:11-8:22", "Matthew 4:1-11"], ["watchD", "Who are they who fear the Lord? He will teach them the way that they should choose. Psalm 25:12"], ["docT", "The magi, having been warned in a dream not to return to Herod, left for their own country by another road. Matthew 2:12"], ["prayer", "Leading God, often we beg for signs and wonders to lead us but miss the guiding stars and your voice in our dreams. Help us to trust that you are leading us, even before we ask. Amen."]], "7": [["info", "First Sunday after Epiphany"], ["watchO", "Watchword for the week — Ascribe to the Lord the glory of his name; worship the Lord in holy splendor. Psalm 29:2"], ["dateVerse", "Sunday, January 7, 2024", "Genesis 1:1-15", "Psalm 29", "Acts 19:1-7", "Mark 1:4-11"], ["watchD", "Do not be afraid, stand firm, and see the deliverance that the Lord will accomplish for you today.Exodus 14:13"], ["docT", "Paul replied, “Whether quickly or not, I pray to God that not only you but also all who are listening to me today might become such as I am—except for these chains.” Acts 26:29"], ["prayer", "Sometimes we are like David, confident before Goliath. Sometimes we are like Peter, confidently stepping out of the boat, but sinking when we feel the wind. Great Deliverer, help us to stand firm in our faith. In Jesus’ name, we pray. Amen."]], "8": [["dateVerse", "Monday, January 8, 2024", "Psalm 7:1-9", "Genesis 9", "Matthew 4:12-25"], ["watchD", "They rejoice before you as with joy at the harvest. Isaiah 9:3"], ["docT", "Ground that drinks up the rain falling on it repeatedly and that produces a crop useful to those for whom it is cultivated receives a blessing from God. Hebrews 6:7"], ["prayer", "When times are difficult, when winter storms come, when weeds threaten a good crop, it can be difficult to be thankful, O God. But with you, the storms will cease, and the harvest is sure. Thank you, God. Amen."]], "9": [["dateVerse", "Tuesday, January 9, 2024", "Psalm 7:10-17", "Genesis 10:1-11:9", "Matthew 5:1-16"], ["watchD", "The Lord will judge the ends of the earth; he will give strength to his king. 1 Samuel 2:10"], ["docT", "Here is the Lamb of God who takes away the sin of the world! John 1:29"], ["prayer", "We don’t know when, O Christ, but we know you will come again. By faith we know we are yours. By faith we know we are forgiven. By faith we find strength. So, come, Lord Jesus come, and grant us your peace. Amen."]], "10": [["dateVerse", "Wednesday, January 10, 2024", "Psalm 8", "Genesis 11:10-12:9", "Matthew 5:17-26"], ["watchD", "Depart from evil, and do good; seek peace, and pursue it. Psalm 34:14"], ["docT", "Let us then pursue what makes for peace and for mutual upbuilding. Romans 14:19"], ["prayer", "How do you do it, O God? Holding back when you want to lash out? Forgiving and not striking back? Loving enemies? Being kind to them? Peacemaking is hard, O God. We will try, but please give us wisdom and patience. Amen."]], "11": [["dateVerse", "Thursday, January 11, 2024", "Psalm 9:1-10", "Genesis 12:10-13:18", "Matthew 5:27-42"], ["watchD", "I have tested you in the furnace of adversity. Isaiah 48:10"], ["docT", "Devote yourselves to prayer. Colossians 4:2"], ["prayer", "You taught us, O Savior, that life is not always easy nor painless. When facing the fire, help us to respect its danger—to avoid it if possible—but if not, let us be comforted in knowing you will help us pass through it. Amen."]], "12": [["dateVerse", "Friday, January 12, 2024", "Psalm 9:11-20", "Genesis 14,15", "Matthew 5:43-6:4"], ["watchD", "I live as an alien in the land. Psalm 119:19"], ["docT", "For we know that, if the earthly tent we live in is destroyed, we have a building from God, a house not made with hands, eternal in the heavens. 2 Corinthians 5:1"], ["prayer", "It doesn’t matter, O God, where we live. It could be a mansion or a tent, a hut with a thatched roof or an igloo of snow. What matters is that you are there. If you are there, we are home. Amen."]], "13": [["dateVerse", "Saturday, January 13, 2024", "Psalm 10:1-11", "Genesis 16,17", "Matthew 6:5-18"], ["watchD", "You have made my days a mere handbreadth; the span of my years is as nothing before you. Everyone is but a breath, even those who seem secure. Psalm 39:5 NIV"], ["docT", "Paul wrote: So we do not lose heart. Even though our outer nature is wasting away, our inner nature is being renewed day by day. 2 Corinthians 4:16"], ["prayer", "Sometimes, O God, a day feels like an eternity; yet at other times, years pass in the blink of an eye. But not a moment goes by without you being with us. Thank you, our friend. Amen. "]], "14": [["info", "Second Sunday after Epiphany"], ["watchO", "Watchword for the week — How weighty to me are your thoughts, O God! How vast is the sum of them! Psalm 139:17"], ["dateVerse", "Sunday, January 14, 2024", "1 Samuel 3:1-10,(11-20)", "Psalm 139:1-6,13-18", "1 Corinthians 6:12-20", "John 1:43-51"], ["watchD", "Thus says the Lord, “Maintain justice, and do what is right, for soon my salvation will come and my deliverance be revealed.” Isaiah 56:1"], ["docT", "John would have prevented him, saying, “I need to be baptized by you, and do you come to me?” But Jesus answered him, “Let it be so now, for it is proper for us in this way to fulfill all righteousness.” Then he consented. Matthew 3:14-15"], ["prayer", "Lord, we try to do what you ask, but our voices are being drowned out, justice is being ignored, and people are hurting. Strengthen us as we feed, comfort, and advocate for those who are suffering. Amen."]], "15": [["dateVerse", "Monday, January 15, 2024", "Psalm 10:12-18", "Genesis 18", "Matthew 6:19-34"], ["watchD", "The Lord takes pleasure in those who fear him, in those who hope in his steadfast love. Psalm 147:11"], ["docT", "For you did not receive the spirit of bondage again to fear, but you received the Spirit of adoption by whom we cry out, “Abba, Father.” Romans 8:15 NKJV"], ["prayer", "O God, you do not want us to fear you, but to love and respect you, as a child should love and respect their parents. Abba, may we always show you the respect you deserve. Amen."]], "16": [["dateVerse", "Tuesday, January 16, 2024", "Psalm 11", "Genesis 19:1-29", "Matthew 7:1-12"], ["watchD", "Do not fear, for I have redeemed you; I have called you by name; you are mine. Isaiah 43:1"], ["docT", "Jesus looked up and said to him, “Zacchaeus, hurry and come down, for I must stay at your house today.” Luke 19:5"], ["prayer", "It is astonishing, O God, that you know our names! We are but one of billions, yet you know us—and our names! And you want to spend time with us. We want that, too. Thank you. Amen."]], "17": [["dateVerse", "Wednesday, January 17, 2024", "Psalm 12", "Genesis 19:30-20:18", "Matthew 7:13-23"], ["watchD", "It was I who taught Ephraim to walk; I took them up in my arms, but they did not know that I healed them. Hosea 11:3"], ["docT", "I will not leave you orphaned; I am coming to you. John 14:18"], ["prayer", "God, you have shown yourself faithful throughout scripture, and you have been faithful to us. You have heard our cries, healed our hurts, and held us when it was needed. Your faithfulness never runs dry. May we also be faithful to you. Amen."]], "18": [["dateVerse", "Thursday, January 18, 2024", "Psalm 13", "Genesis 21", "Matthew 7:24-8:4"], ["watchD", "Elijah said, “How long will you go limping with two different opinions? If the Lord is God, follow him, but if Baal, then follow him.” 1 Kings 18:21"], ["docT", "Jesus said, “You cannot serve God and wealth.” Matthew 6:24"], ["prayer", "Sometimes, O God, you ask us to make a choice. That is not surprising; we make choices every day. Some are easy; some are hard. The hard ones demand commitment and loyalty. They ask us to choose them and not you. Help us to always choose you. Amen."]], "19": [["dateVerse", "Friday, January 19, 2024", "Psalm 14", "Genesis 22", "Matthew 8:5-22"], ["watchD", "Give me neither poverty nor riches; feed me with the food that I need. Proverbs 30:8"], ["docT", "We brought nothing into the world, so that we can take nothing out of it, but if we have food and clothing, we will be content with these. 1 Timothy 6:7-8"], ["prayer", "Why, O God, do we do what we know we should not? We eat food that does not satisfy. We buy things we don’t need and accumulate wealth we can’t keep. Remind us to seek what is our true treasure, which is you and your love. Amen."]], "20": [["dateVerse", "Saturday, January 20, 2024", "Psalm 15", "Genesis 23:1-24:25", "Matthew 8:23-34"], ["watchD", "The Lord made the earth by his power, and by his understanding stretched out the heavens. Jeremiah 10:12"], ["docT", "God’s beloved Son is before all things, and in him all things hold together. Colossians 1:17"], ["prayer", "You are an awesome God! We marvel at your power to create, your understanding to provide the resources that we need, your wisdom to let us learn from our mistakes, your love to forgive. You are truly an awesome God. Amen. "]], "21": [["info", "Third Sunday after Epiphany"], ["watchO", "Watchword for the week — Trust in him at all times, pour out your heart before him; God is a refuge for us. Psalm 62:8"], ["dateVerse", "Sunday, January 21, 2024", "Jonah 3:1-5,10", "Psalm 62:5-12", "1 Corinthians 7:29-31", "Mark 1:14-20"], ["watchD", "Shall we indeed accept good from God, and shall we not accept adversity? Job 2:10 NKJV"], ["docT", "We know that all things work together for good for those who love God, who are called according to his purpose. Romans 8:28"], ["prayer", "Omniscient God, you know life isn’t fair. Accidents happen. Good guys lose; bad guys win. Viruses do not care about age, color, or nationality. Teach us that adversity is not punishment, but an opportunity to minister to the suffering with compassion and love. Amen. "]], "22": [["dateVerse", "Monday, January 22, 2024", "Psalm 16:1-6", "Genesis 24:26-67", "Matthew 9:1-13"], ["watchD", "Shower, O heavens, from above, and let the skies rain down righteousness; let the earth open, that salvation may spring up, and let it cause righteousness to sprout up also; I the Lord have created it. Isaiah 45:8"], ["docT", "In accordance with his promise, we wait for new heavens and a new earth, where righteousness is at home. 2 Peter 3:13"], ["prayer", "O God of righteousness, enter our hearts and make us new. Create a clean heart within us. Guide us to live lives of integrity and bless us with your righteousness. This is our humble prayer. Amen."]], "23": [["dateVerse", "Tuesday, January 23, 2024", "Psalm 16:7-11", "Genesis 25", "Matthew 9:14-26"], ["watchD", "For your name’s sake, O Lord, pardon my guilt, for it is great. Psalm 25:11"], ["docT", "When Jesus saw their faith, he said to the paralytic, “Child, your sins are forgiven.” Mark 2:5"], ["prayer", "Forgiving God, asking for forgiveness can be hard. We feel so guilty. We are embarrassed by our failures and our disrespect. But before we can ask, you have already forgiven us. Help us now to forgive ourselves. Amen."]], "24": [["dateVerse", "Wednesday, January 24, 2024", "Psalm 17:1-7", "Genesis 26", "Matthew 9:27-38"], ["watchD", "Earth and the heavens will perish, but you endure. Psalm 102:26"], ["docT", "Jesus said, “I am with you always, to the end of the age.” Matthew 28:20"], ["prayer", "Eternal God, everything around us changes, nothing is exactly the same from one day to the next. Even the mountains and oceans change. Everything changes except you. Thank you for being the one we can always count on. Amen."]], "25": [["dateVerse", "Thursday, January 25, 2024", "Psalm 17:8-15", "Genesis 27:1-29", "Matthew 10:1-16"], ["watchD", "Happy are the people who know the festal shout, who walk, O Lord, in the light of your countenance. Psalm 89:15"], ["docT", "Jesus said, “I am the light of the world. Whoever follows me will never walk in darkness but will have the light of life.” John 8:12"], ["prayer", "Light of the world, our journey through life is easier because your light guides us, keeps us on the right paths, and helps us avoid the hazards and pitfalls. We pray that we will always see and follow it. In Jesus’ name, we pray. Amen."]], "26": [["dateVerse", "Friday, January 26, 2024", "Psalm 18:1-6", "Genesis 27:30-28:9", "Matthew 10:17-25"], ["watchD", "You show me the path of life. Psalm 16:11"], ["docT", "Jesus said to his disciples, “Those who want to save their life will lose it, and those who lose their life for my sake will find it.” Matthew 16:25"], ["prayer", "God of opposites, often are we confused by your wisdom: love not hate; forgive not retaliate; lead in serving; lose one’s life to find it. Help us to learn that “us and ours” is more important than “me and mine.” Amen."]], "27": [["dateVerse", "Saturday, January 27, 2024", "Psalm 18:7-15", "Genesis 28:10-29:14", "Matthew 10:26-42"], ["watchD", "God said to Solomon, “Because you have not asked for yourself long life or riches or for the life of your enemies but have asked for yourself understanding to discern what is right, I now do according to your word.” 1 Kings 3:11-12"], ["docT", "Paul wrote: Do not be conformed to this age, but be transformed by the renewing of the mind, so that you may discern what is the will of God—what is good and acceptable and perfect. Romans 12:2"], ["prayer", "Does it humor you, our patient God, when we think we know it all, only to realize we don’t know as much as we thought? Help us to recognize the limits of our knowledge and abilities, and trust in your wisdom. Amen."]], "28": [["info", "Fourth Sunday after Epiphany"], ["watchO", "Watchword for the week — The fear of the Lord is the beginning of wisdom; all those who practice it have a good understanding. Psalm 111:10"], ["dateVerse", "Sunday, January 28, 2024", "Deuteronomy 18:15-20", "Psalm 111", "1 Corinthians 8:1-13", "Mark 1:21-28"], ["watchD", "All the nations you have made shall come and bow down before you, O Lord, and shall glorify your name. Psalm 86:9"], ["docT", "And I heard a loud voice from the throne saying, “See, the home of God is among mortals. He will dwell with them; they will be his peoples, and God himself will be with them and be their God.” Revelation 21:3"], ["prayer", "Ever-present God, how assuring it is to know that you have come to dwell with us, and are not just watching, judging, and commanding from a distance. Thank you for being our Emmanuel. Amen."]], "29": [["dateVerse", "Monday, January 29, 2024", "Psalm 18:16-24", "Genesis 29:15-30:24", "Matthew 11:1-10"], ["watchD", "All the peoples of the earth may know that the Lord is God; there is no other. 1 Kings 8:60"], ["docT", "Go therefore and make disciples of all nations, baptizing them in the name of the Father and of the Son and of the Holy Spirit and teaching them to obey everything that I have commanded you. Matthew 28:19-20"], ["prayer", "Sending God, when we become comfortable with watching and not doing the work of ministry, remind us we all have a role to fill, a part to play, and gifts to use, and that even small parts are essential. Amen."]], "30": [["dateVerse", "Tuesday, January 30, 2024", "Psalm 18:25-29", "Genesis 30:25-31:21", "Matthew 11:11-24"], ["watchD", "Jesse said to his son David, “See how your brothers fare.” 1 Samuel 17:18"], ["docT", "Just then some men came carrying a paralyzed man on a stretcher. They were trying to bring him in and lay him before Jesus. Luke 5:18"], ["prayer", "Compassionate God, open our eyes to the needs of our brothers and sisters, friends, and neighbors, and keep us from being complacent. We know we can’t do everything, but move us to do something—anything, but not nothing. Amen."]], "31": [["dateVerse", "Wednesday, January 31, 2024", "Psalm 18:30-36", "Genesis 31:22-55", "Matthew 11:25-12:8"], ["watchD", "Truly in the Lord our God is the salvation of Israel. Jeremiah 3:23"], ["docT", "Mary said, “My soul magnifies the Lord, and my spirit rejoices in God my Savior.” Luke 1:46-47"], ["prayer", "Gracious Savior, there is nothing that we can say or do that can express the depth of our gratitude for what you have done for us. Thank you alone isn’t enough, Gracias, merci, Благодарю, grazie, danke, děkuji vám, mahalo. (Spanish, French, Russian, Italian, German, Czech, Hawaiian.) Amen."]], "32": [["dateVerse", "Thursday, February 1, 2024", "Psalm 18:37-45", "Genesis 32:1-21", "Matthew 12:9-21"], ["watchD", "The Lord looks down from heaven on humankind to see if there are any who are wise, who seek after God. Psalm 14:2"], ["docT", "Grow in the grace and knowledge of our Lord and Savior Jesus Christ. 2 Peter 3:18"], ["prayer", "Gracious God, it is your desire that we seek after you so that we may grow in grace. With all that goes on around us, help us to be deliberate, and consciously pursue you for guidance. In Jesus’ name, we pray. Amen."]], "33": [["dateVerse", "Friday, February 2, 2024", "Psalm 18:46-50", "Genesis 32:22-33:20", "Matthew 12:22-32"], ["watchD", "Many peoples shall come and say, “Come, let us go up to the mountain of the Lord, to the house of the God of Jacob, that he may teach us his ways and that we may walk in his paths.” Isaiah 2:3"], ["docT", "When Jesus saw the crowds, he went up the mountain, and after he sat down, his disciples came to him. And he began to speak and taught them. Matthew 5:1-2"], ["prayer", "Great Teacher, thank you for lovingly and patiently teaching us, so that guidelines are clear as we seek to walk in the ways you have carved out for us. May we demonstrate these principles in our lives, for Christ’s sake. Amen."]], "34": [["dateVerse", "Saturday, February 3, 2024", "Psalm 19:1-6", "Genesis 34", "Matthew 12:33-45"], ["watchD", "I will counsel you with my eye upon you. Psalm 32:8 "], ["docT", "Jesus said to Simon and Andrew, “Follow me.” Matthew 4:19"], ["prayer", "Gracious Savior, help us to hear our names as you call us to follow you. May we be ever mindful of your presence as you watch over us and guide us on our way, for your name’s sake. Amen. "]], "35": [["info", "Fifth Sunday after Epiphany"], ["watchO", "Watchword for the week — Great is our Lord, and abundant in power; his understanding is beyond measure. Psalm 147:5"], ["dateVerse", "Sunday, February 4, 2024", "Isaiah 40:21-31", "Psalm 147:1-11,20c", "1 Corinthians 9:16-23", "Mark 1:29-39"], ["watchD", "He who vindicates me is near. Who will contend with me? Isaiah 50:8"], ["docT", "Jesus said to her, “Woman, where are they? Has no one condemned you?” She said, “No one, sir.” And Jesus said, “Neither do I condemn you. Go your way, and from now on do not sin again.” John 8:10-11"], ["prayer", "Loving God, you are the source of pure goodness. You see us for who we really are, yet you find it in your heart to extend grace and mercy. Help us to be grateful for the gift of salvation and a second chance at getting it right. In Jesus’ name, we pray. Amen."]], "36": [["dateVerse", "Monday, February 5, 2024", "Psalm 19:7-14", "Genesis 35:1-36:8", "Matthew 12:46-13:9"], ["watchD", "The Lord waits to be gracious to you. Isaiah 30:18"], ["docT", "We believe that we will be saved through the grace of the Lord Jesus. Acts 15:11"], ["prayer", "Gracious Redeemer, we are humbled by the depth of your love for us. We thank you for your sustaining grace that has safeguarded our salvation. Help us never to take your gracious kindness and compassion for granted. Amen."]], "37": [["dateVerse", "Tuesday, February 6, 2024", "Psalm 20", "Genesis 36:9-43", "Matthew 13:10-23"], ["watchD", "The Lord said, “You shall be for me a priestly kingdom and a holy nation.” Exodus 19:6"], ["docT", "From now on there is reserved for me the crown of righteousness, which the Lord, the righteous judge, will give me on that day, and not only to me but also to all who have longed for his appearing. 2 Timothy 4:8"], ["prayer", "Righteous Judge, thank you for the provisions made so that we may experience your kingdom in all its fullness, as a holy nation. Until then, we endure the realities of our challenges as we wait in anticipation of our crown of righteousness. In Jesus’ name, we pray. Amen."]], "38": [["dateVerse", "Wednesday, February 7, 2024", "Psalm 21", "Genesis 37", "Matthew 13:24-35"], ["watchD", "The Lord has punished me severely, but he did not give me over to death. Psalm 118:18"], ["docT", "One man was there who had been ill for thirty-eight years. Jesus said to him, “Stand up, take your mat and walk.” At once the man was made well, and he took up his mat and began to walk. John 5:5,8-9"], ["prayer", "Lover of humankind, it continues to amaze us just how special we are to you. You always find a way to heal us or set us free. May we be always mindful of the power of your love and be grateful for your mercy. In Jesus’ name, we pray. Amen."]], "39": [["dateVerse", "Thursday, February 8, 2024", "Psalm 22:1-8", "Genesis 38", "Matthew 13:36-46"], ["watchD", "It is good that one should wait quietly for the salvation of the Lord. Lamentations 3:26"], ["docT", "Let us run with perseverance the race that is set before us, looking to Jesus, the pioneer and perfecter of faith. Hebrews 12:1-2"], ["prayer", "Faithful Companion, we thank you for your constant presence while we run this race. May your presence rejuvenate and strengthen us on this journey as we anticipate our salvation in Jesus Christ. Amen."]], "40": [["dateVerse", "Friday, February 9, 2024", "Psalm 22:9-21", "Genesis 39", "Matthew 13:47-58"], ["watchD", "Speak tenderly to Jerusalem, and proclaim to her that her hard service has been completed, that her sin has been paid for. Isaiah 40:2 NIV"], ["docT", "Repentance and forgiveness of sins is to be proclaimed in Christ’s name to all nations, beginning from Jerusalem. Luke 24:47"], ["prayer", "Gracious Redeemer, sometimes we take for granted how powerful it is to be pardoned of our sins. Help us to always embrace this blessing and proclaim the joy of sins forgiven with confidence to the whole world. Amen."]], "41": [["dateVerse", "Saturday, February 10, 2024", "Psalm 22:22-28", "Genesis 40:1-41:16", "Matthew 14:1-14"], ["watchD", "My mouth will tell of your righteous acts, of your deeds of salvation all day long, though their number is past my knowledge. Psalm 71:15"], ["docT", "Mary said, “The Mighty One has done great things for me, and holy is his name.” Luke 1:49"], ["prayer", "Mighty God, your greatness is unsurpassable. We stand in awe of your goodness and righteousness as we sing praises to your matchless name. Our lips will always declare your glory, for you are holy. Amen."]], "42": [["info", "Last Sunday After Epiphany"], ["watchO", "Watchword for the week — For we do not proclaim ourselves; we proclaim Jesus Christ as Lord and ourselves as servants for Jesus’ sake. 2 Corinthians 4:5"], ["dateVerse", "Sunday, February 11, 2024", "2 Kings 2:1-12", "Psalm 50:1-6", "2 Corinthians 4:3-6", "Mark 9:2-9"], ["watchD", "My spirit abides among you; do not fear. Haggai 2:5"], ["docT", "Jesus said, “In this world you will have trouble. But take heart! I have overcome the world.” John 16:33 NIV"], ["prayer", "Spirit of God, your holy presence makes us confident in all things. We are assured that we do not need to fear because you have overcome the world. Grant us the strength to always trust in your abiding presence. Amen."]], "43": [["dateVerse", "Monday, February 12, 2024", "Psalm 22:29-31", "Genesis 41:17-57", "Matthew 14:15-24"], ["watchD", "Seek the welfare of the city and pray to the Lord on its behalf, for in its welfare you will find your welfare. Jeremiah 29:7"], ["docT", "When Jesus entered Jerusalem, the whole city was in turmoil, asking, “Who is this?” Matthew 21:10"], ["prayer", "Sovereign Lord, you desire for us to prosper and find peace where we are planted. Help us to understand the importance of our contribution to this process as we trust in the fulfillment of your word. Amen."]], "44": [["dateVerse", "Tuesday, February 13, 2024", "Psalm 23", "Genesis 42", "Matthew 14:25-15:9"], ["watchD", "The Lord said, “You shall not profane my holy name.” Leviticus 22:32"], ["docT", "Jesus said, “Why do you call me ‘Lord, Lord,’ and do not do what I tell you?” Luke 6:46"], ["prayer", "Gracious God, forgive us for our disrespect of your holy name as well as our disobedience to your instructions. As we prepare for the season of Lent, help us to consciously align ourselves with your will and your way. Amen."]], "45": [["specialVerse", "Ash Wednesday", "Joel 2:1-2,12-17", "Psalm 51:1-17", "2 Corinthians 5:20b-6:10", "Matthew 6:1-6,16-21"], ["dateVerse", "Wednesday, February 14, 2024", "Psalm 24", "Genesis 43", "Matthew 15:10-20"], ["watchD", "Who am I, and what is my people, that we should be able to make this freewill offering? For all things come from you, and of your own have we given you. 1 Chronicles 29:14"], ["docT", "Freely you have received, freely give. Matthew 10:8 NKJV"], ["prayer", "Loving God, on this Ash Wednesday, we cannot deny how much you have given to us. We do not have enough tongues to thank you. As we receive from your bounty, help us to find it within our hearts to give to others who are in need. For Christ’s sake. Amen."]], "46": [["dateVerse", "Thursday, February 15, 2024", "Psalm 25:1-7", "Genesis 44", "Matthew 15:21-28"], ["watchD", "The people came to Moses and said, “We have sinned by speaking against the Lord and against you; pray to the Lord to take away the serpents from us.” So Moses prayed for the people. Numbers 21:7"], ["docT", "We entreat you on behalf of Christ: be reconciled to God. 2 Corinthians 5:20"], ["prayer", "God of reconciliation and hope, we acknowledge that our sin has separated us from you. Forgive us, dear God, and restore our relationship with you that we may experience the peace that only you can give. Through Jesus Christ, our Lord. Amen."]], "47": [["dateVerse", "Friday, February 16, 2024", "Psalm 25:8-22", "Genesis 45", "Matthew 15:29-16:4"], ["watchD", "So teach us to count our days that we may gain a wise heart. Psalm 90:12"], ["docT", "If we live, we live to the Lord, and if we die, we die to the Lord; so then, whether we live or whether we die, we are the Lord’s. Romans 14:8"], ["prayer", "Alpha and Omega, we recognize that all things come from you and will return to you. Help us to be careful that we live out our lives in a manner that is pleasing to you. For Christ’s sake. Amen."]], "48": [["dateVerse", "Saturday, February 17, 2024", "Psalm 26", "Genesis 46:1-27", "Matthew 16:5-20"], ["watchD", "O mountains of Israel, I am for you; I will turn to you, and you shall be tilled and sown. Ezekiel 36:8,9"], ["docT", "Be patient, therefore, brothers and sisters, until the coming of the Lord. The farmer waits for the precious crop from the earth, being patient with it until it receives the early and the late rains. James 5:7"], ["prayer", "God, you are truly quite phenomenal! You are precious, and your patience and provisions are incomparable. Continue to deal bounteously with us; keep us faithful even as you are faithful. For Christ’s sake. Amen."]], "49": [["info", "First Sunday in Lent"], ["watchO", "Watchword for the week — Good and upright is the Lord; therefore he instructs sinners in the way. Psalm 25:8"], ["dateVerse", "Sunday, February 18, 2024", "Genesis 9:8-17", "Psalm 25:1-10", "1 Peter 3:18-22", "Mark 1:9-15"], ["watchD", "Let the righteous be joyful; let them exult before God; let them be jubilant with joy. Psalm 68:3"], ["docT", "His master said to him, “Well done, good and trustworthy slave; you have been trustworthy in a few things; I will put you in charge of many things; enter into the joy of your master.” Matthew 25:21"], ["prayer", "Great and awesome God, the kind of joy you bring into our lives makes us want to always lift you up in praise. Help us not to lose that disposition, but to use it to always worship and serve you with joyful exuberance. Amen."]], "50": [["dateVerse", "Monday, February 19, 2024", "Psalm 27:1-6", "Genesis 46:28-47:31", "Matthew 16:21-28"], ["watchD", "How great are your works, O Lord your thoughts are very deep! Psalm 92:5"], ["docT", "Great and amazing are your deeds, Lord God the Almighty! Just and true are your ways, King of the nations! Revelation 15:3"], ["prayer", "Great and mighty God, we acknowledge that we do not deserve all that you do for us, but your grace endures forever. You are just, and we bask in your mercy. Help us to feel your presence in your marvelous works all around us. Amen."]], "51": [["dateVerse", "Tuesday, February 20, 2024", "Psalm 27:7-14", "Genesis 48", "Matthew 17:1-13"], ["watchD", "The Lord said to Elijah, “I will leave seven thousand in Israel, all the knees that have not bowed to Baal.” 1 Kings 19:18"], ["docT", "But you, beloved, build yourselves up on your most holy faith; pray in the Holy Spirit; keep yourselves in the love of God; look forward to the mercy of our Lord Jesus Christ that leads to eternal life. Jude 20-21"], ["prayer", "Almighty God, in humility we bow to you. Renew us as we worship you daily and prepare to meet you in eternity. When you call us, Lord, you will equip us to keep our eyes firmly fixed on your will and give us the courage to do the right thing. Amen."]], "52": [["dateVerse", "Wednesday, February 21, 2024", "Psalm 28", "Genesis 49", "Matthew 17:14-27"], ["watchD", "Who can say, “I have made my heart clean; I am pure from my sin?” Proverbs 20:9"], ["docT", "When Jesus perceived their questionings, he answered them, “Why do you raise such questions in your hearts?” Luke 5:22"], ["prayer", "Lord, examine our hearts and see our faults. We have erred and strayed, but you, O Lord, are our shepherd. Guide us into the paths of righteousness. Forgive us when we have made excuses or questioned you. With pure hearts, help us to pursue your ways and do your will. Amen."]], "53": [["dateVerse", "Thursday, February 22, 2024", "Psalm 29", "Genesis 50", "Matthew 18:1-14"], ["watchD", "Serve the Lord with gladness; come into his presence with singing. Psalm 100:2"], ["docT", "So let us not grow weary in doing what is right, for we will reap at harvest time, if we do not give up. Galatians 6:9"], ["prayer", "Lord our God, give us the strength that will inspire us to do more. Grant to us the joy of seeing you at work in us and help us never to be tired of doing good. Help us to do more for you. Thank you for the privilege of serving you. Amen."]], "54": [["dateVerse", "Friday, February 23, 2024", "Psalm 30:1-5", "Exodus 1:1-2:10", "Matthew 18:15-35"], ["watchD", "My God, my God, why have you forsaken me? Why are you so far from helping me, from the words of my groaning? Psalm 22:1"], ["docT", "And the curtain of the temple was torn in two, from top to bottom. Mark 15:38"], ["prayer", "Sometimes, O God, we feel alone and forsaken but then we remember your promise—that you will go before us and will be with us. You will never leave us nor forsake us. Thank you that we do not need to be afraid because you are present in our lives when we need you most. Amen."]], "55": [["dateVerse", "Saturday, February 24, 2024", "Psalm 30:6-12", "Exodus 2:11-3:22", "Matthew 19:1-12"], ["watchD", "I will do more good to you than ever before. Then you shall know that I am the Lord. Ezekiel 36:11"], ["docT", "Paul wrote: I know that when I come to you I will come in the fullness of the blessing of Christ. Romans 15:29"], ["prayer", "God almighty, you never get tired of keeping us safe or providing for us. You are never tired of doing more than what we ask of you. Give us more strength to do good for you, too. Amen."]], "56": [["info", "Second Sunday in Lent"], ["watchO", "Watchword for the week — God said, “I will establish my covenant between me and you, and your offspring after you throughout their generations.” Genesis 17:7"], ["dateVerse", "Sunday, February 25, 2024", "Genesis 17:1-7,15-16", "Psalm 22:23-31", "Romans 4:13-25", "Mark 8:31-38"], ["watchD", "Keep these words that I am commanding you today in your heart. Recite them to your children and talk about them. Deuteronomy 6:6-7"], ["docT", "Jesus said, “The Advocate, the Holy Spirit, whom the Father will send in my name, will teach you everything and remind you of all that I have said to you.” John 14:26"], ["prayer", "Gracious God, thank you for every opportunity we have to praise you. Help us feel your guiding presence in these difficult times. We know there is hope when we do what is right. Help us to cling tightly to you. Amen."]], "57": [["dateVerse", "Monday, February 26, 2024", "Psalm 31:1-5", "Exodus 4:1-5:9", "Matthew 19:13-22"], ["watchD", "The eyes of the Lord range throughout the entire earth to strengthen those whose heart is true to him. 2 Chronicles 16:9"], ["docT", "I pray that the eyes of your heart may be enlightened in order that you may know the hope to which he has called you, and his incomparably great power for us who believe. Ephesians 1:18,19 NIV"], ["prayer", "God of all truth, daily we spend time thinking, planning, and worrying about our lives. Remind us that we make plans in our hearts, but you determine the outcome. We can do nothing without you, so help us to keep you central to our plans and give direction to our steps. In your name, we pray. Amen."]], "58": [["dateVerse", "Tuesday, February 27, 2024", "Psalm 31:6-9", "Exodus 5:10-6:12", "Matthew 19:23-30"], ["watchD", "Wash me thoroughly from my iniquity, and cleanse me from my sin. Psalm 51:2"], ["docT", "Jesus said, “There will be more joy in heaven over one sinner who repents than over ninety-nine righteous persons who need no repentance.” Luke 15:7"], ["prayer", "Almighty God, may your Spirit teach us all things and guide us as we make choices and decisions today. Remind us of your words and clear our minds to follow you with all our mind, all our heart, and all our strength. Through Jesus Christ, our Lord. Amen."]], "59": [["dateVerse", "Wednesday, February 28, 2024", "Psalm 31:10-20", "Exodus 6:13-7:24", "Matthew 20:1-16"], ["watchD", "O Lord my God, in you I take refuge; save me from all my pursuers and deliver me. Psalm 7:1"], ["docT", "When they hand you over, do not worry about how you are to speak or what you are to say, for what you are to say will be given to you at that time. Matthew 10:19"], ["prayer", "Faithful Lord, be with us every day. Watch over our steps—guide and keep us safe in all we do. Warn us from deceitful individuals and help us to discern those who are sincere. Keep us in your loving care. Amen."]], "60": [["dateVerse", "Thursday, February 29, 2024", "Psalm 31:21-24", "Exodus 8", "Matthew 20:17-28"], ["watchD", "In the Lord I take refuge; how can you say to me, “Flee like a bird to the mountains?” Psalm 11:1"], ["docT", "Therefore do not cast away your confidence, which has great reward. Hebrews 10:35 NKJV"], ["prayer", "Almighty God, thank you for your living word, which guides us through life. Your word is a lamp for our feet. Help us to be aware of your voice and listen. Give us the confidence to know which way to go, as you shine the light in our darkness. Amen."]], "61": [["info", "March 1, 1457: Beginning of the Unity of the Brethren in Bohemia"], ["dateVerse", "Friday, March 1, 2024", "Psalm 32", "Exodus 9", "Matthew 20:29-21:11"], ["watchD", "You have been my help, and in the shadow of your wings I sing for joy. Psalm 63:7"], ["docT", "If God is for us, who is against us? Romans 8:31"], ["prayer", "O divine Habitation, we take comfort in the assurance that wherever our lives may take us, or whatever life may throw at us, we are surrounded by your loving embrace. May we remain aware that your abiding presence is sufficient for all the challenges of our lives. In Jesus’ name, we pray. Amen."]], "62": [["dateVerse", "Saturday, March 2, 2024", "Psalm 33:1-5", "Exodus 10", "Matthew 21:12-22"], ["watchD", "How long, O Lord? Will you forget me forever? How long will you hide your face from me? Psalm 13:1"], ["docT", "Jesus cried with a loud voice, “My God, my God, why have you forsaken me?” Matthew 27:46"], ["prayer", "Gracious Lord, in our moments of distress, we can imagine ourselves to be far from you. When we are tempted to feel forsaken, may we listen for your voice in the silence. May we ever remember that you are only a prayer away. May we seek and always find you. Amen."]], "63": [["info", "Third Sunday in Lent"], ["watchO", "Watchword for the week — For the message about the cross is foolishness to those who are perishing, but to us who are being saved it is the power of God. 1 Corinthians 1:18"], ["dateVerse", "Sunday, March 3, 2024", "Exodus 20:1-17", "Psalm 19", "1 Corinthians 1:18-25", "John 2:13-22"], ["watchD", "No one who conceals transgressions will prosper, but one who confesses and forsakes them will obtain mercy. Proverbs 28:13"], ["docT", "Zacchaeus said to the Lord, “Look, half of my possessions, Lord, I will give to the poor, and if I have defrauded anyone of anything, I will pay back four times as much.” Then Jesus said to him, “Today salvation has come to this house.” Luke 19:8-9"], ["prayer", "Loving Savior, all of our words of confession and acts of contrition would be of no effect were it not for your open and loving heart awaiting our return. Let us always understand that you never began to love us; instead, your love was awaiting us at our birth, and will embrace us through all eternity. Amen."]], "64": [["dateVerse", "Monday, March 4, 2024", "Psalm 33:6-11", "Exodus 11:1-12:20", "Matthew 21:23-32"], ["watchD", "The Lord is a refuge for his people, a stronghold for the people of Israel. Joel 3:16"], ["docT", "The blind beggar cried out even more loudly, “Son of David, have mercy on me!” Jesus stood still and said, “Call him here.” Mark 10:48-49"], ["prayer", "Dear Jesus, every challenge of our lives can open our eyes and hearts to our need for you to bring us healing and wholeness.  Help us to see that our healing occurs and our rebirth begins when we respond to your call to come to you. Lord, make us whole and may we rise up to serve you. Amen."]], "65": [["dateVerse", "Tuesday, March 5, 2024", "Psalm 33:12-22", "Exodus 12:21-51", "Matthew 21:33-46"], ["watchD", "Who knows? God may relent and change his mind; he may turn from his fierce anger, so that we do not perish. Jonah 3:9"], ["docT", "Jesus said, “Whatever you ask for in prayer, believe that you have received it, and it will be yours.” Mark 11:24"], ["prayer", "Loving Creator, if you were to hold our sins against us, none of us could stand. Not only do you forgive us, but you shower us with blessings and help, sufficient for our needs. In our times of adversity, may we be quick and bold to turn to you for help and strength. Amen."]], "66": [["dateVerse", "Wednesday, March 6, 2024", "Psalm 34:1-7", "Exodus 13:1-14:18", "Matthew 22:1-14"], ["watchD", "The Lord will keep you from all evil; he will keep your life. Psalm 121:7"], ["docT", "Jesus prayed, “I am not asking you to take them out of the world, but I ask you to protect them from the evil one.” John 17:15"], ["prayer", "O blessed Bulwark, there is much in our world which can threaten to undo us and cause us to stray from your path. Be our protector. Strengthen us through scripture, the example of Jesus, and the presence of your spirit. Keep us faithful to you, as you are faithful to us. Amen."]], "67": [["dateVerse", "Thursday, March 7, 2024", "Psalm 34:8-18", "Exodus 14:19-15:21", "Matthew 22:15-22"], ["watchD", "The Lord filled Zion with justice and righteousness; he will be the stability of your times, abundance of salvation, wisdom, and knowledge. Isaiah 33:5,6"], ["docT", "Meanwhile the church throughout Judea, Galilee, and Samaria had peace and was built up. Living in the fear of the Lord and in the comfort of the Holy Spirit, it increased in numbers. Acts 9:31"], ["prayer", "Heavenly Father, you are the creator of a vast and varied universe in which you declared all to be good. Around us in the world and within the church which you created, we experience change and division. May we ever be mindful to look to Jesus as our trustworthy source of stability in the midst of change and a center for unity amid all division. Amen."]], "68": [["dateVerse", "Friday, March 8, 2024", "Psalm 34:19-22", "Exodus 15:22-16:36", "Matthew 22:23-40"], ["watchD", "The Lord turned toward Israel because of his covenant with Abraham, Isaac, and Jacob and would not destroy them, nor has he banished them from his presence until now. 2 Kings 13:23"], ["docT", "The gifts and the calling of God are irrevocable. Romans 11:29"], ["prayer", "God of Abraham, you have been faithful to your covenant in claiming us as your people. May we be equally faithful to that covenant by affirming you as our only God. May we demonstrate our faithfulness by living out the ministry of Jesus Christ through our lives. Amen."]], "69": [["dateVerse", "Saturday, March 9, 2024", "Psalm 35:1-10", "Exodus 17:1-18:6", "Matthew 22:41-23:12"], ["watchD", "Why is my pain unceasing, my wound incurable, refusing to be healed? Truly, you are to me like a deceitful brook, like waters that fail. Jeremiah 15:18"], ["docT", "Paul wrote: In Christ Jesus our Lord, we have access in boldness and confidence through faith in him. I pray, therefore, that you may not lose heart over my sufferings. Ephesians 3:12-13"], ["prayer", "Divine Mystery, when hardship is present in our lives, we are tempted to imagine that you are absent or of no avail. By your Holy Spirit, keep us ever mindful of your nearness. May we be emboldened to not lose heart over your presence and power to bring comfort and wholeness to our lives. In Jesus’ name, we pray. Amen."]], "70": [["info", "Fourth Sunday in Lent"], ["watchO", "Watchword for the week — By grace you have been saved through faith, and this is not your own doing; it is the gift of God. Ephesians 2:8"], ["dateVerse", "Sunday, March 10, 2024", "Numbers 21:4-9", "Psalm 107:1-3,17-22", "Ephesians 2:1-10", "John 3:14-21"], ["watchD", "I will delight in my people; no more shall the sound of weeping be heard in it or the cry of distress. Isaiah 65:19"], ["docT", "The Lamb at the center of the throne will be their shepherd, and he will guide them to springs of the water of life, and God will wipe away every tear from their eyes. Revelation 7:17"], ["prayer", "Great Deliverer, when our lives are sorely oppressed, our eyes filled with tears, and our voices dominated by cries of distress—turn our darkness into light. Refresh our hearts as water refreshes dry ground. In you, may we find cause to rejoice despite any burden in our lives. Amen."]], "71": [["dateVerse", "Monday, March 11, 2024", "Psalm 35:11-18", "Exodus 18:7-19:9", "Matthew 23:13-22"], ["watchD", "Then Jacob woke from his sleep, he was afraid and said, “How awesome is this place! This is none other than the house of God, and this is the gate of heaven.” Genesis 28:16,17"], ["docT", "Everything that becomes visible is light. Therefore it says, “Sleeper, awake! Rise from the dead, and Christ will shine on you.” Ephesians 5:14"], ["prayer", "O Light of the world, like the dawn’s early light shining through a window, awaken us to the splendor of your presence. Fill us with wonder at the presence of the living and triune God around us and within us. Amen."]], "72": [["dateVerse", "Tuesday, March 12, 2024", "Psalm 35:19-28", "Exodus 19:10-20:21", "Matthew 23:23-32"], ["watchD", "Do not plan harm against your neighbor who lives trustingly beside you. Proverbs 3:29"], ["docT", "Paul wrote: So deeply do we care for you that we are determined to share with you not only the gospel of God but also our own selves, because you have become very dear to us. 1 Thessalonians 2:8"], ["prayer", "Loving Shepherd, you taught us to expand our view of neighbor to include all persons both near and far. May we live by the example of your love to all, willing only good for them, and sharing with them the gospel of grace by the way we live. Amen."]], "73": [["dateVerse", "Wednesday, March 13, 2024", "Psalm 36", "Exodus 20:22-21:27", "Matthew 23:33-39"], ["watchD", "The Lord said, “I have chosen Abraham that he may charge his children and his household after him to keep the way of the Lord by doing righteousness and justice.” Genesis 18:19"], ["docT", "We know that the law is good, if one uses it properly. 1 Timothy 1:8 NIV "], ["prayer", "O Word of life, as we turn to scripture to guide our own feet and the paths of our children, may your teaching and example be the lens through which all scripture is read and interpreted. You alone are the Living Word through the guidance of your Spirit. Amen."]], "74": [["dateVerse", "Thursday, March 14, 2024", "Psalm 37:1-6", "Exodus 21:28-22:24", "Matthew 24:1-25"], ["watchD", "The Lord will surely be gracious to you at the sound of your cry; when he hears it, he will answer you. Isaiah 30:19"], ["docT", "Jesus answered the Canaanite woman, “Woman, great is your faith! Let it be done for you as you wish.” Matthew 15:28"], ["prayer", "Source of all goodness and truth, through your word, you promise to respond to our cries and answer our prayers. May our hearts and minds remain open to the varied ways in which you respond to us. May it always be that your will be done, rather than our wishes be fulfilled. Amen."]], "75": [["dateVerse", "Friday, March 15, 2024", "Psalm 37:7-15", "Exodus 22:25-23:26", "Matthew 24:26-35"], ["watchD", "You are children of the Lord your God. Deuteronomy 14:1"], ["docT", "In Christ Jesus you are all children of God through faith. Galatians 3:26"], ["prayer", "Heavenly Father, how easily the words roll off our lips—you are our heavenly father. May the truth flow as easily from our minds and hearts so that all persons—across the street and around the world—are seen by you as your children and our brothers and sisters. May they be recipients of our love and care. Amen. "]], "76": [["dateVerse", "Saturday, March 16, 2024", "Psalm 37:16-22", "Exodus 23:27-25:9", "Matthew 24:36-44"], ["watchD", "O give thanks to the Lord; call on his name; make known his deeds among the peoples. Psalm 105:1"], ["docT", "So faith comes from what is heard, and what is heard comes through the word of Christ. Romans 10:17"], ["prayer", "O priceless Treasure, we consider you a profound blessing in our lives, yet we can be slow to speak your praises to those around us. Make us as bold to proclaim your place in our lives and in the universe as we are quick to endorse a new product or service we have discovered. Your name be praised. Amen."]], "77": [["info", "Fifth Sunday in Lent"], ["watchO", "Watchword for the week — Create in me a clean heart, O God, and put a new and right spirit within me. Psalm 51:10"], ["dateVerse", "Sunday, March 17, 2024", "Jeremiah 31:31-34", "Psalm 51:1-12", "Hebrews 5:5-10", "John 12:20-33"], ["watchD", "I will pour water on the thirsty land and streams on the dry ground; I will pour my spirit upon your descendants and my blessing on your offspring. Isaiah 44:3"], ["docT", "Jesus said in a loud voice, “Let anyone who is thirsty come to me and drink.” John 7:37 NIV"], ["prayer", "Life-giving Lord, when our spirits become parched by the relentless pace of our lives, restore and refresh us with the living water you offer. May we ever keep our cup uplifted to you and be ready to drink deeply of your life-renewing grace. Amen."]], "78": [["dateVerse", "Monday, March 18, 2024", "Psalm 37:23-26", "Exodus 25:10-40", "Matthew 24:45-51"], ["watchD", "Woe to those who write oppressive statutes, to turn aside the needy from justice and to rob the poor of my people of their right. Isaiah 10:1-2"], ["docT", "In everything do to others as you would have them do to you. Matthew 7:12"], ["prayer", "Master, we learn too easily the ways of our world—to put ourselves and our own first. Let us, rather, learn by your example—putting others before ourselves. Give us the strength to do to others as we would have them do to us. Amen."]], "79": [["dateVerse", "Tuesday, March 19, 2024", "Psalm 37:27-33", "Exodus 26", "Matthew 25:1-13"], ["watchD", "The eternal God is your refuge. Deuteronomy 33:27 NIV"], ["docT", "Do not let your hearts be troubled. Believe in God; believe also in me. In my Father’s house there are many dwelling places. John 14:1-2"], ["prayer", "Risen and eternal Lord, what are we waiting for? Our hope is in you. Death looms ever before us, at times filling us with dread. Strengthen our faith, that when our time comes, we might anticipate with joy our entrance into your presence in a dwelling place prepared for us. Amen."]], "80": [["dateVerse", "Wednesday, March 20, 2024", "Psalm 37:34-40", "Exodus 27:1-28:14", "Matthew 25:14-30"], ["watchD", "What shall I return to the Lord for all his bounty to me? Psalm 116:12"], ["docT", "And one of them, when he saw that he was healed, returned, and with a loud voice glorified God, and fell down on his face at his feet, giving him thanks. And he was a Samaritan. Luke 17:15-16 NKJV"], ["prayer", "Giver of all good gifts, what can we give to you in response to your many blessings bestowed on your creation and each of us? Any sacrifice pales in comparison to your generosity. Therefore, we will give you what you desire most: our humble, thankful hearts. We will give to others what pleases you most: justice and mercy. In Jesus’ name, we pray. Amen."]], "81": [["dateVerse", "Thursday, March 21, 2024", "Psalm 38:1-8", "Exodus 28:15-43", "Matthew 25:31-46"], ["watchD", "God gives wisdom to the wise and knowledge to those who have understanding. Daniel 2:21"], ["docT", "Christ Jesus became for us wisdom from God, and righteousness and sanctification and redemption, in order that, as it is written, “Let the one who boasts, boast in the Lord.” 1 Corinthians 1:30-31"], ["prayer", "O Source of our being, if we are honest with ourselves and with you, we recognize that not one of us is self-made. All that we are and all that we have is the result of the blessings, gifts, and abilities with which you have blessed us. Cleanse us from vanity and pride. May we view ourselves through our gratitude to you for what you have made us. In Jesus’ name, we pray. Amen."]], "82": [["dateVerse", "Friday, March 22, 2024", "Psalm 38:9-16", "Exodus 29:1-30", "Matthew 26:1-13"], ["watchD", "Long ago you laid the foundation of the earth, and the heavens are the work of your hands. Psalm 102:25"], ["docT", "In Christ all things in heaven and on earth were created, things visible and invisible. Colossians 1:16"], ["prayer", "Divine Creator, the splendor of the universe and the intricacy of life declare themselves to be more than an accident. All that is, is the result of your desire to give of yourself. With your son Jesus Christ, you called the universe into being and brought beauty and order into the chaotic void. May we behold your glory in all that surrounds us. Amen."]], "83": [["dateVerse", "Saturday, March 23, 2024", "Psalm 38:17-22", "Exodus 29:31-30:16", "Matthew 26:14-30"], ["watchD", "Can mortals make for themselves gods? Jeremiah 16:20"], ["docT", "Put to death, therefore, whatever belongs to your earthly nature: sexual immorality, impurity, lust, evil desires and greed, which is idolatry. Colossians 3:5 NIV"], ["prayer", "Heavenly Master, we confess that at times we can value the things of the world more than you. We give ultimate value to things of little importance. We create idols that we worship through the investing of our time and money, leaving little time and treasure for you and your will. May we hear you calling us to reestablish our priorities, that you might truly be the only God we worship. Amen."]], "84": [["info", "Palm Sunday"], ["watchO", "Watchword for the week — Jesus said, “You will see the Son of Man seated at the right hand of Power, and ‘coming with the clouds of heaven’.” Mark 14:62"], ["dateVerse", "Sunday, March 24, 2024", "Isaiah 50:4-9a", "Psalm 31:9-16", "Philippians 2:5-11", "Mark 14:1-15:47"], ["watchD", "You have blessed it, O Lord, and it shall be blessed forever. 1 Chronicles 17:27 NKJV"], ["docT", "Then the king will say to those at his right hand, “Come, you who are blessed by my Father, inherit the kingdom prepared for you from the foundation of the world.” Matthew 25:34"], ["prayer", "God with us, you were not content to dwell in heaven afar or be confined to a temple built by human hands. You chose to come among us in human form to be God with us and God for us. You came as a humble servant and redefined for us our fitting response to you as being the loving response to the needs of your human family. Hosanna, blessed are you who came in the name of the Lord. Amen."]], "85": [["dateVerse", "Monday, March 25, 2024", "Psalm 39:1-6", "Exodus 30:17-31:11", "Matthew 26:31-35"], ["watchD", "As the Lord lives, whatever my God says, that I will speak. 2 Chronicles 18:13"], ["docT", "Proclaim the message; be persistent whether the time is favorable or unfavorable. 2 Timothy 4:2"], ["prayer", "O living Word, we confess that we are a people of many words who too frequently neglect to speak the word. Grant us a spirit of boldness that we might feel inspired to share with others the story of your life, love, death, and resurrection. We pray all of this in Jesus’ name. Amen."]], "86": [["dateVerse", "Tuesday, March 26, 2024", "Psalm 39:7-13", "Exodus 31:12-32:29", "Matthew 26:36-46"], ["watchD", "The Lord makes a way in the sea, a path in the mighty waters. Isaiah 43:16"], ["docT", "Jesus said, “And if I go and prepare a place for you, I will come again and will take you to myself, so that where I am, there you may be also. And you know the way to the place where I am going.” John 14:3-4"], ["prayer", "Holy Savior, we take comfort and rejoice in the path of salvation and service you have prepared for us. Strengthen our trust that you have indeed prepared a place for us when our lives here have ended, and that you will welcome us into the joy of your eternal presence on that bright shore. Amen."]], "87": [["dateVerse", "Wednesday, March 27, 2024", "Psalm 40:1-8", "Exodus 32:30-33:23", "Matthew 26:47-58"], ["watchD", "The Lord stands at the right hand of the needy, to save them from those who would condemn them. Psalm 109:31"], ["docT", "Listen, my beloved brothers and sisters. Has not God chosen the poor in the world to be rich in faith and to be heirs of the kingdom that he has promised to those who love him? James 2:5"], ["prayer", "O loving Father of all, when we survey the needs of the broken and hurting world in which we live, we can be overwhelmed by the task and humbled by our limitations. Empower and embolden us for the task unfinished. May we truly believe that, with you, all things are possible. Amen."]], "88": [["info", "Maundy Thursday"], ["info", "Maundy Thursday — He has gained renown by his wonderful deeds; the Lord is gracious and merciful. Psalm 111:4"], ["dateVerse", "Thursday, March 28, 2024", "Psalm 40:9-17", "Exodus 34", "Matthew 26:59-75"], ["watchD", "Righteousness exalts a nation, but sin is a reproach to any people. Proverbs 14:34"], ["docT", "Jesus went, as was his custom, to the Mount of Olives, and the disciples followed him. When he reached the place, he said to them, “Pray that you may not come into the time of trial.” Luke 22:39-40"], ["prayer", "Loving Savior, on this day we remember your last evening of fellowship with your disciples—a night of prayer, abandonment, and betrayal. May we examine our hearts this day and recommit ourselves to lives of willing obedience and commitment to you in response to your matchless love. Amen."]], "89": [["info", "Good Friday"], ["info", "Good Friday — For God so loved the world that he gave his only Son, so that everyone who believes in him may not perish but may have eternal life. John 3:16"], ["dateVerse", "Friday, March 29, 2024", "Psalm 41", "Exodus 35", "Matthew 27:1-10"], ["watchD", "Jacob called the place where God had spoken with him Bethel. Genesis 35:15"], ["docT", "Now when the centurion and those with him, who were keeping watch over Jesus, saw the earthquake and what took place, they were terrified and said, “Truly this man was God’s Son!” Matthew 27:54"], ["prayer", "O crucified Lord, as we gaze upon the cross this day, may we not be too tempted to see it as a place of defeat, but as the place in human history where God’s love and power triumphed. May we add our voices to the confession of faith of the centurion, “Truly this man was God’s son.” Amen."]], "90": [["info", "Great Sabbath"], ["dateVerse", "Saturday, March 30, 2024", "Psalm 42", "Exodus 36", "Matthew 27:11-31"], ["watchD", "The Lord will rise up to show mercy to you.Isaiah 30:18"], ["docT", "For God did not send his Son into the world to condemn the world, but that the world through him might be saved. John 3:17 NKJV"], ["prayer", "Dear Jesus, as we await the triumph of Easter joy, we remember that your crucifixion was not the condemnation of our sinfulness, but the profound expression of your love. On the cross, you spread wide your arms and declared to us, “I love you this much.” What wondrous love is this. Amen."]], "91": [["info", "Easter"], ["watchO", "Watchword for the week — But in fact Christ has been raised from the dead, the first fruits of those who have died. 1 Corinthians 15:20"], ["dateVerse", "Sunday, March 31, 2024", "Acts 10:34-43", "Psalm 118:1-2,14-24", "1 Corinthians 15:1-11", "Mark 16:1-8"], ["watchD", "I will turn the darkness before them into light, the rough places into level ground. Isaiah 42:16"], ["docT", "Jesus took bread, blessed and broke it, and gave it to them. Then their eyes were opened, and they recognized him, and he vanished from their sight. Luke 24:30-31"], ["prayer", "O risen Christ, as the dawn’s early light casts out the darkness of night from the earth, so may the light of your resurrection drive the shadows from our hearts. By the power of the new life you promise us, we will see each new each day as a personal Easter event, until that new day dawns for us in your eternal kingdom. Amen."]], "92": [["dateVerse", "Monday, April 1, 2024", "Psalm 43", "Exodus 37", "Matthew 27:32-44"], ["watchD", "Learn to do good; seek justice; rescue the oppressed. Isaiah 1:17"], ["docT", "Agabus predicted by the Spirit that there would be a severe famine over all the world, and this took place during the reign of Claudius. The disciples determined to send relief to the brothers and sisters living in Judea. Acts 11:28-29"], ["prayer", "O God, who calls us to care for one another, help us to seek justice, and rescue the oppressed. We pray especially for those experiencing food insecurity this day, that they may be fed. Amen."]], "93": [["dateVerse", "Tuesday, April 2, 2024", "Psalm 44:1-8", "Exodus 38", "Matthew 27:45-56"], ["watchD", "I dwell in the high and holy place and also with those who are contrite and humble in spirit, to revive the spirit of the humble and to revive the heart of the contrite. Isaiah 57:15"], ["docT", "The disciples urged him strongly, saying, “Stay with us, because it is almost evening and the day is now nearly over.” So he went in to stay with them. Luke 24:29"], ["prayer", "O Lord, in the high and holy place, we are in awe that you even hear our prayers. We thank you for your presence in our lives. Help us keep you in our hearts and minds today, so that we may be revived. Amen."]], "94": [["dateVerse", "Wednesday, April 3, 2024", "Psalm 44:9-16", "Exodus 39:1-31", "Matthew 27:57-66"], ["watchD", "They shall know that I am the Lord when I break the bars of their yoke and save them. Ezekiel 34:27"], ["docT", "God will wipe every tear from their eyes. Death will be no more; mourning and crying and pain will be no more, for the first things have passed away. Revelation 21:4"], ["prayer", "God of salvation, thank you for seeing the tears in our eyes, and for bearing our burdens. As we wait for the day when your peace will reign, give us patience and strength to endure. In Jesus’ name, we pray. Amen."]], "95": [["dateVerse", "Thursday, April 4, 2024", "Psalm 44:17-26", "Exodus 39:32-40:23", "Matthew 28"], ["watchD", "I am the Lord, and there is no other. I form light and create darkness, I make weal and create woe; I the Lord do all these things. Isaiah 45:6-7"], ["docT", "I was dead, and see, I am alive forever and ever, and I have the keys of Death and of Hades. Revelation 1:18"], ["prayer", "Creator of all things, we see you in everything. Your presence is felt in times of joy and sorrow. We praise you for breaking the bonds of death and for raising us to new life in you. In Jesus’ name, we pray. Amen."]], "96": [["dateVerse", "Friday, April 5, 2024", "Psalm 45:1-9", "Exodus 40:24-Leviticus 1:17", "Mark 1:1-8"], ["watchD", "I will remember my covenant with you in the days of your youth, and I will establish with you an everlasting covenant. Ezekiel 16:60"], ["docT", "He has made us qualified to be ministers of a new covenant, not of letter but of spirit. 2 Corinthians 3:6"], ["prayer", "Dearest Jesus, you are our shepherd, and we are your flock. You are the vine, and we are your branches. Thank you for your covenant with the church worldwide. Show us today the work that you would have us do for your kingdom. Amen."]], "97": [["dateVerse", "Saturday, April 6, 2024", "Psalm 45:10-17", "Leviticus 2,3", "Mark 1:9-20"], ["watchD", "My tongue shall tell of your righteousness and of your praise all day long. Psalm 35:28"], ["docT", "Let the word of Christ dwell in you richly; teach and admonish one another in all wisdom; and with gratitude in your hearts sing psalms, hymns, and spiritual songs to God. Colossians 3:16"], ["prayer", "Lord Jesus, we feel gratitude in our hearts for life and love. Our thankfulness grows and our praise overflows from prayer into songs and Alleluias. You are worthy, O Lord! Amen."]], "98": [["info", "Second Sunday of Easter"], ["watchO", "Watchword for the week — If we walk in the light as God is in the light, we have fellowship with one another, and the blood of Jesus his Son cleanses us from all sin. 1 John 1:7"], ["dateVerse", "Sunday, April 7, 2024", "Acts 4:32-35", "Psalm 133", "1 John 1:1-2:2", "John 20:19-31"], ["watchD", "The Israelites said to the Lord, “We have sinned; do to us whatever seems good to you, but deliver us this day!” Judges 10:15"], ["docT", "But the tax collector, standing far off, would not even lift up his eyes to heaven but was beating his breast and saying, ‘God, be merciful to me, a sinner!’ Luke 18:13"], ["prayer", "O loving God, we thank you for your mercy. Although we are all sinners, we are the benefactors of your tenderhearted care, grace, and forgiveness. Because of the offering of your beloved son, we are blessed to have been pardoned and to have received eternal salvation. Thanks be to God! Amen."]], "99": [["dateVerse", "Monday, April 8, 2024", "Psalm 46", "Leviticus 4", "Mark 1:21-34"], ["watchD", "Happy are those who fear the Lord, who greatly delight in his commandments. Psalm 112:1"], ["docT", "Christ suffered for you, leaving you an example, so that you should follow in his steps. 1 Peter 2:21"], ["prayer", "O Lord, we are truly happy, blessed, and full of goodness when we are lost in your love. We delight in your commandments and your example because it teaches us how we should live and how we should care for all people. Amen."]], "100": [["dateVerse", "Tuesday, April 9, 2024", "Psalm 47", "Leviticus 5:1-6:13", "Mark 1:35-45"], ["watchD", "Have I any pleasure in the death of the wicked, says the Lord God, and not rather that they should turn from their ways and live? Ezekiel 18:23"], ["docT", "The wages of sin is death, but the free gift of God is eternal life in Christ Jesus our Lord. Romans 6:23"], ["prayer", "O God of reconciliation and peace, please help us to learn to love and forgive our enemies, just as you continue to love us when we fail to follow you. Help us to understand that we are all sinners who have been set free by your gift of grace. We should delight with all who turn to you. Amen."]], "101": [["dateVerse", "Wednesday, April 10, 2024", "Psalm 48", "Leviticus 6:14-7:21", "Mark 2:1-12"], ["watchD", "I am the Lord your God, the Holy One of Israel, your Savior. Isaiah 43:3"], ["docT", "Then from the cloud came a voice that said, “This is my Son, my Chosen; listen to him!” When the voice had spoken, Jesus was found alone. Luke 9:35-36"], ["prayer", "Lord, you are our true king and the son of God. We know we are to follow your words of love with actions of love. Please help us to listen to your words of wisdom so that we can fulfill the loving purpose you have for our lives on this earthly world. Amen."]], "102": [["dateVerse", "Thursday, April 11, 2024", "Psalm 49:1-12", "Leviticus 7:22-8:17", "Mark 2:13-28"], ["watchD", "I, I am he who comforts you; why then are you afraid of a mere mortal who must die? Isaiah 51:12"], ["docT", "Always be ready to make your defense to anyone who demands from you an accounting for the hope that is in you. 1 Peter 3:15"], ["prayer", "O God, help us to prepare to live a life that is an example for others to follow. Help us to demonstrate to others through our actions that our lives are full of the Holy Spirit, and our hope and wonder is built on the solid rock of Christ. Amen."]], "103": [["dateVerse", "Friday, April 12, 2024", "Psalm 49:13-20", "Leviticus 8:18-9:11", "Mark 3:1-12"], ["watchD", "I will establish my covenant with you, and you shall know that I am the Lord. Ezekiel 16:62"], ["docT", "So it depends not on human will or exertion but on God who shows mercy. Romans 9:16"], ["prayer", "Lord, we know you are the light of the world. Because of your covenant with us, we know of your great love for us.  You have made it easier for us to see this love because of the guidance and strength you have provided to our ancestors. If we look closely, we can see your unconditional love and mercy everywhere and in everyone. Amen."]], "104": [["dateVerse", "Saturday, April 13, 2024", "Psalm 50:1-6", "Leviticus 9:12-10:20", "Mark 3:13-19"], ["watchD", "The living God delivers and rescues. Daniel 6:26,27"], ["docT", "It is no longer I who live, but it is Christ who lives in me. And the life I now live in the flesh I live by the faith of the Son of God, who loved me and gave himself for me. Galatians 2:20"], ["prayer", "Heavenly Father, thank you for rescuing us from ourselves. Help us remember the sacrifice of your son was an act of love to save us all. Amen."]], "105": [["info", "Third Sunday of Easter"], ["watchO", "Watchword for the week — See what love the Father has given us, that we should be called children of God; and that is what we are. 1 John 3:1"], ["dateVerse", "Sunday, April 14, 2024", "Acts 3:12-19", "Psalm 4", "1 John 3:1-7", "Luke 24:36b-48"], ["watchD", "It is God who arms me with strength. Psalm 18:32 NIV"], ["docT", "God’s weakness is stronger than human strength. 1 Corinthians 1:25"], ["prayer", "God of power and might, we know that you give us our strength. Help us to be faithful to you and your son as we wait for his return. Amen."]], "106": [["dateVerse", "Monday, April 15, 2024", "Psalm 50:7-15", "Leviticus 11:1-28", "Mark 3:20-35"], ["watchD", "Amos said, “O Lord God, forgive, I beg you! How can Jacob stand? He is so small!” The Lord relented concerning this; “It shall not be,” said the Lord. Amos 7:2-3"], ["docT", "Jesus said, “Simon, Simon, listen! Satan has demanded to sift all of you like wheat, but I have prayed for you that your own faith may not fail.” Luke 22:31-32"], ["prayer", "Dear faithful God, forgive us for our prideful ways. Compared to you, we are small and frail. We need your guidance to remain faithful always. Amen."]], "107": [["dateVerse", "Tuesday, April 16, 2024", "Psalm 50:16-23", "Leviticus 11:29-13:8", "Mark 4:1-20"], ["watchD", "The Lord, my God, lights up my darkness. Psalm 18:28"], ["docT", "Because of the tender mercy of our God, the dawn from on high will break upon us, to shine upon those who sit in darkness and in the shadow of death, to guide our feet into the way of peace. Luke 1:78-79"], ["prayer", "Loving God, help us see your light as it shines through the darkness in our lives. Guide us to learn peace as individuals and in the world. Amen."]], "108": [["dateVerse", "Wednesday, April 17, 2024", "Psalm 51:1-6", "Leviticus 13:9-46", "Mark 4:21-29"], ["watchD", "Bless the Lord, O my soul, and all that is within me, bless his holy name. Psalm 103:1"], ["docT", "Blessed be the God and Father of our Lord Jesus Christ! By his great mercy he has given us a new birth into a living hope through the resurrection of Jesus Christ from the dead. 1 Peter 1:3"], ["prayer", "Holy God, we bless you with our heart, soul, and mind. Thank you for your son, Jesus Christ. His death and resurrection give us hope in things to come. Amen."]], "109": [["dateVerse", "Thursday, April 18, 2024", "Psalm 51:7-12", "Leviticus 13:47-14:18", "Mark 4:30-41"], ["watchD", "Shout aloud and sing for joy, O royal Zion, for great in your midst is the Holy One of Israel. Isaiah 12:6"], ["docT", "The Word became flesh and lived among us, and we have seen his glory. John 1:14"], ["prayer", "God of love, thank you for sending us your son to show us your grace and truth. Through him, we experience the depth of your glory. We take comfort in your loving care. Amen."]], "110": [["dateVerse", "Friday, April 19, 2024", "Psalm 51:13-19", "Leviticus 14:19-57", "Mark 5:1-20"], ["watchD", "Noah did all that God commanded him. Genesis 6:22"], ["docT", "Jesus said, “Everyone, then, who hears these words of mine and acts on them will be like a wise man who built his house on rock.” Matthew 7:24"], ["prayer", "Patient God, we so often try to rely on our own strength, rather than on you. Help us remain faithful in our walk with you, no matter how impossible the path may seem. Help us live your word in our lives. Amen."]], "111": [["dateVerse", "Saturday, April 20, 2024", "Psalm 52", "Leviticus 15:1-24", "Mark 5:21-43"], ["watchD", "“I will surely save you, and you shall not fall by the sword, but you shall have your life as a prize of war, because you have trusted in me,” says the Lord. Jeremiah 39:18"], ["docT", "Jesus said to the criminal, “Truly I tell you, today you will be with me in paradise.” Luke 23:43"], ["prayer", "Gracious God, your love for us is immeasurable. You give us grace we don’t deserve. Help us trust and walk faithfully until we are home with you. Amen."]], "112": [["info", "Fourth Sunday of Easter"], ["watchO", "Watchword for the week — Jesus said, “I am the good shepherd. The good shepherd lays down his life for the sheep.” John 10:11"], ["dateVerse", "Sunday, April 21, 2024", "Acts 4:5-12", "Psalm 23", "1 John 3:16-24", "John 10:11-18"], ["watchD", "A gossip goes about telling secrets, but one who is trustworthy in spirit keeps a confidence. Proverbs 11:13"], ["docT", "Speaking the truth in love, we must grow up in every way into him who is the head, into Christ. Ephesians 4:15"], ["prayer", "Good Shepherd, thank you for your sacrifice—for loving us so much you laid down your life for our salvation. We pray for our sisters and brothers who feel lost. May they experience your truth through our love. In Jesus’ name, we pray. Amen."]], "113": [["dateVerse", "Monday, April 22, 2024", "Psalm 53", "Leviticus 15:25-16:25", "Mark 6:1-6"], ["watchD", "Blessed be the God who has sent his angel and delivered his servants who trusted in him. Daniel 3:28"], ["docT", "Jesus was in the wilderness forty days, tested by Satan, and he was with the wild beasts, and the angels waited on him. Mark 1:13"], ["prayer", "Jesus, being in the wilderness feels so lonely. When we are in a desolate place, help us to trust you and stay close to you. Help us remember we are never alone with you in our hearts. Amen."]], "114": [["dateVerse", "Tuesday, April 23, 2024", "Psalm 54", "Leviticus 16:26-18:5", "Mark 6:7-13"], ["watchD", "God’s way is perfect. Psalm 18:30"], ["docT", "Jesus said, “This is what the kingdom of God is like. A man scatters seed on the ground. Night and day, whether he sleeps or gets up, the seed sprouts and grows, though he does not know how. All by itself the soil produces grain.” Mark 4:26-28 NIV"], ["prayer", "Nourishing God, we desire to partner with you in flinging seeds of love, joy, compassion, and justice into the world. Forgive us when we stray from your fertile soil of abundant life. Set our feet back on the way. In Jesus’ name, we pray. Amen."]], "115": [["dateVerse", "Wednesday, April 24, 2024", "Psalm 55:1-8", "Leviticus 18:6-19:11", "Mark 6:14-29"], ["watchD", "Do not fear, for you will not be ashamed. Isaiah 54:4"], ["docT", "The angel said to the women, “Do not be afraid, for I know that you are looking for Jesus who was crucified. He is not here, for he has been raised.” Matthew 28:5-6"], ["prayer", "Loving God, you continually whisper to us to not be afraid. Still, our very human selves often give in to fear. Tune our ears to hear your voice of assurance. Embolden us to serve bravely. Open our hearts to receive your peace. Amen."]], "116": [["dateVerse", "Thursday, April 25, 2024", "Psalm 55:9-15", "Leviticus 19:12-20:8", "Mark 6:30-44"], ["watchD", "Deliverance belongs to the Lord, may your blessing be on your people! Psalm 3:8"], ["docT", "Jesus lifted up His hands and blessed them. Luke 24:50 NKJV"], ["prayer", "Every good and perfect gift comes from you, O Lord. May we receive the blessing of your abundant grace joyfully, and may we, in turn, abundantly and joyfully bless others. Amen."]], "117": [["dateVerse", "Friday, April 26, 2024", "Psalm 55:16-19", "Leviticus 20:9-21:12", "Mark 6:45-56"], ["watchD", "Fear God, and keep his commandments, for that is the whole duty of everyone. Ecclesiastes 12:13"], ["docT", "Jesus answered, “The first is, ‘Hear, O Israel: the Lord our God, the Lord is one; you shall love the Lord your God with all your heart and with all your soul and with all your mind and with all your strength.’ The second is this, ‘You shall love your neighbor as yourself.’ There is no other commandment greater than these.” Mark 12:29-31"], ["prayer", "Holy One, you have made it clear to us that it all comes down to love—love God, love one another. As we seek to live into your way of love, help us to see and honor your divine image in each and every living being. Amen."]], "118": [["dateVerse", "Saturday, April 27, 2024", "Psalm 55:20-23", "Leviticus 21:13-22:16", "Mark 7:1-8"], ["watchD", "You say, “I am innocent; surely the Lord’s anger has turned from me.” Now I am bringing you to judgment for saying, “I have not sinned.” Jeremiah 2:35"], ["docT", "Jesus, remember me when you come in your kingdom. Luke 23:42"], ["prayer", "Gracious Lord, our hearts need not be fearful or distrustful. We rejoice in knowing that because Jesus died for our sins, conquered death, and ascended into heaven, we will have life everlasting. Thank you, triumphant Lord. Amen."]], "119": [["info", "Fifth Sunday of Easter"], ["watchO", "Watchword for the week — Jesus said, “Abide in me as I abide in you. Just as the branch cannot bear fruit by itself unless it abides in the vine, neither can you unless you abide in me.” John 15:4"], ["dateVerse", "Sunday, April 28, 2024", "Acts 8:26-40", "Psalm 22:25-31", "1 John 4:7-21", "John 15:1-8"], ["watchD", "Give me an undivided heart to revere your name. Psalm 86:11"], ["docT", "God exalted Jesus Christ even more highly and gave him the name that is above every other name, so that at the name given to Jesus every knee should bend, in heaven and on earth and under the earth, and every tongue should confess that Jesus Christ is Lord, to the glory of God the Father. Philippians 2:9-11"], ["prayer", "Loving God, we pray for your guidance in aligning our hearts to love you and to love others as ourselves. We pray for the strength to love you with every fiber of our heart and soul. Help us to understand that our love for our neighbors is our truest expression of the love we have for you. In the name of Jesus, we pray. Amen."]], "120": [["dateVerse", "Monday, April 29, 2024", "Psalm 56:1-8", "Leviticus 22:17-23:22", "Mark 7:9-23"], ["watchD", "The Lord is in the right, for I have rebelled against his word. Lamentations 1:18"], ["docT", "What do you think? A man had two sons; he went to the first and said, ‘Son, go and work in the vineyard today.’ He answered, ‘I will not,’ but later he changed his mind and went. Matthew 21:28-29"], ["prayer", "Most perfect Lord, may our faith grow and deepen, just as the seed of your word is sown and grows until the end of time. Help us to plant seeds of hope in this world filled with such challenging days. Amen."]], "121": [["dateVerse", "Tuesday, April 30, 2024", "Psalm 56:9-13", "Leviticus 23:23-24:9", "Mark 7:24-37"], ["watchD", "Be mindful of your mercy, O Lord, and of your steadfast love, for they have been from of old. Psalm 25:6"], ["docT", "When the goodness and loving kindness of God our Savior appeared, he saved us, not because of any works of righteousness that we had done, but according to his mercy, through the water of rebirth and renewal by the Holy Spirit. Titus 3:4-5"], ["prayer", "Heavenly Father, we thank you for the blessings of good health, food and shelter, the sun and the moon, the four seasons. May we do all within our power to live lives filled with gratitude for how lovingly you care for us. Alleluia! We sing your praises. Amen."]], "122": [["dateVerse", "Wednesday, May 1, 2024", "Psalm 57:1-6", "Leviticus 24:10-25:17", "Mark 8:1-13"], ["watchD", "I am with you, says the Lord, to save you. Jeremiah 30:11"], ["docT", "Because he himself was tested by what he suffered, he is able to help those who are being tested. Hebrews 2:18"], ["prayer", "Our God and Savior, you know our human frailties, our problems, our failings. Be with us this day to guide us through each test and save us with your grace. Amen."]], "123": [["dateVerse", "Thursday, May 2, 2024", "Psalm 57:7-11", "Leviticus 25:18-55", "Mark 8:14-21"], ["watchD", "The Lord said, “O that my people would listen to me.” Psalm 81:13"], ["docT", "Continue securely established and steadfast in the faith, without shifting from the hope promised by the gospel that you heard. Colossians 1:23"], ["prayer", "O still small Voice, open our ears that we may hear what you are saying. Silence the clamor of the world around us for just an instant, that we may hear and act on your word. In Jesus’ name, we pray. Amen."]], "124": [["dateVerse", "Friday, May 3, 2024", "Psalm 58", "Leviticus 26:1-35", "Mark 8:22-38"], ["watchD", "You shall not revile the deaf or put a stumbling block before the blind; you shall fear your God. Leviticus 19:14"], ["docT", "Jesus said, “Be merciful, just as your Father is merciful.” Luke 6:36"], ["prayer", "O God of all, we praise you, that in your mercy, you accept us all as we are: varied in physical abilities, mental capacity, ethnic culture, chosen lifestyle. May we grant all of humanity the respect and love we give to sisters and brothers in the faith. Amen."]], "125": [["dateVerse", "Saturday, May 4, 2024", "Psalm 59:1-9", "Leviticus 26:36-27:15", "Mark 9:1-10"], ["watchD", "You shall eat in plenty and be satisfied and praise the name of the Lord your God. Joel 2:26"], ["docT", "Taking the five loaves and the two fish, Jesus looked up to heaven and blessed and broke the loaves and gave them to his disciples to set before the people, and he divided the two fish among them all. And all ate and were filled. Mark 6:41-42"], ["prayer", "Heavenly Provider, you give us an abundance of what we need, even when we cannot recognize it. Help us to be satisfied with what you give and to remember always that all we have comes from you. Amen."]], "126": [["info", "Sixth Sunday after Easter"], ["watchO", "Watchword for the week — Make a joyful noise to the Lord, all the earth; break forth into joyous song and sing praises. Psalm 98:4"], ["dateVerse", "Sunday, May 5, 2024", "Acts 10:44-48", "Psalm 98", "1 John 5:1-6", "John 15:9-17"], ["watchD", "As a deer longs for flowing streams, so my soul longs for you, O God. Psalm 42:1"], ["docT", "Increase our faith! Luke 17:5"], ["prayer", "O God, all living things need water to live. We also need the living water that only you can provide—to strengthen our spirits, enlighten our minds, and sustain our souls. We praise you for your goodness and we worship you forever. Amen."]], "127": [["dateVerse", "Monday, May 6, 2024", "Psalm 59:10-17", "Leviticus 27:16-Numbers 1:16", "Mark 9:11-29"], ["watchD", "The Lord will hide me in his shelter in the day of trouble; he will conceal me under the cover of his tent. Psalm 27:5"], ["docT", "The Lord is faithful; he will strengthen you and guard you from the evil one. 2 Thessalonians 3:3"], ["prayer", "O God of the ages, we are grateful that you always protect us. Shelter us this day and strengthen us to meet life’s challenges, now and into the future. Amen."]], "128": [["dateVerse", "Tuesday, May 7, 2024", "Psalm 60", "Numbers 1:17-54", "Mark 9:30-37"], ["watchD", "From Zion, perfect in beauty, God shines forth. Our God comes and will not be silent. Psalm 50:2-3 NIV"], ["docT", "The scribe said to Jesus, “You are right, teacher; you have truly said that ‘he is one, and besides him there is no other.’” Mark 12:32"], ["prayer", "O holy One, we acknowledge with word and song that you are our redeemer, the triune God, who brings salvation, life, and healing. We respond with gratitude and praise. Amen."]], "129": [["dateVerse", "Wednesday, May 8, 2024", "Psalm 61", "Numbers 2", "Mark 9:38-50"], ["watchD", "The Lord put a new song in my mouth, a song of praise to our God. Psalm 40:3"], ["docT", "Be renewed in the spirit of your minds. Ephesians 4:23"], ["prayer", "Lord our God, you are eternal. It is we who change, who forsake, and it is you who renews and restores. We thank you for your abiding faith in humanity, even as humanity’s faith in you wavers. As we praise you, we ask for your renewal of our faith. Amen."]], "130": [["info", "Ascension Day"], ["watchO", "Watchword for Ascension Day — Jesus said, “I, when I am lifted up from the earth, will draw all people to myself.” John 12:32"], ["dateVerse", "Thursday, May 9, 2024", "Psalm 62", "Numbers 3:1-32", "Mark 10:1-12"], ["specialVerse", "Ascension of the Lord", "Acts 1:1-11", "Psalm 47", "Ephesians 1:15-23", "Luke 24:44-53"], ["watchD", "The Lord had made them joyful. Ezra 6:22"], ["docT", "Rejoice always. 1 Thessalonians 5:16"], ["prayer", "O Giver of all good gifts, our hearts are joyful when we think of your many blessings to us—our life, our freedom to worship, and the many other blessings on our hearts. We thank you, now and forever. Amen."]], "131": [["dateVerse", "Friday, May 10, 2024", "Psalm 63", "Numbers 3:33-4:14", "Mark 10:13-31"], ["watchD", "The Lord said, “I will look with favor upon you and make you fruitful and multiply you, and I will maintain my covenant with you.” Leviticus 26:9"], ["docT", "Do not be afraid, little flock, for it is your Father’s good pleasure to give you the kingdom. Luke 12:32"], ["prayer", "Gracious God, we are your favored ones, recipients of your blessings, even though we are unworthy. All you ask in return is for us to love you, serve you, praise you. In humility, we seek to obey. In your name, we pray. Amen."]], "132": [["dateVerse", "Saturday, May 11, 2024", "Psalm 64", "Numbers 4:15-49", "Mark 10:32-45"], ["watchD", "God wounds, but he binds up; he strikes, but his hands heal. Job 5:18"], ["docT", "For from him and through him and to him are all things. To him be the glory forever. Amen. Romans 11:36"], ["prayer", "O divine Healer, we come to you with sickness and infirmity—some obvious and visible, some invisible or hidden. Help us to recognize our illnesses and frailties, and to take what steps we need to restore ourselves to wholeness, so that we may fully worship and praise you forever. Amen."]], "133": [["info", "Ascension Sunday"], ["watchO", "Watchword for the week — Jesus said, “Sanctify them in the truth; your word is truth.” John 17:17"], ["dateVerse", "Sunday, May 12, 2024", "Acts 1:15-17,21-26", "Psalm 1", "1 John 5:9-13", "John 17:6-19"], ["watchD", "For you, O God, have tested us; you have tried us as silver is tried. Psalm 66:10"], ["docT", "Jesus said to him the third time, “Simon son of John, do you love me?” Peter felt hurt because he said to him the third time, “Do you love me?” And he said to him, “Lord, you know everything; you know that I love you.” Jesus said to him, “Feed my sheep.” John 21:17"], ["prayer", "Divine Judge, we know that we constantly fall short in our love and service to you, no matter how hard we try. Yet even in our failings, we can still feed your sheep—spiritually and physically. Give us earthly and heavenly food, that we may share both with others. Amen."]], "134": [["dateVerse", "Monday, May 13, 2024", "Psalm 65:1-8", "Numbers 5", "Mark 10:46-52"], ["watchD", "Keep your voice from weeping and your eyes from tears, for there is a reward for your work, says the Lord. Jeremiah 31:16"], ["docT", "Jesus said, “You have pain now, but I will see you again, and your hearts will rejoice, and no one will take your joy from you.” John 16:22"], ["prayer", "Our God now and forever, we believe that when we die, when pain and troubles are over we will be with you for eternity. Until that day, while we are on earth, remind us that you are still with us, even through pain, tribulation, and grief. In Jesus’ name, we pray. Amen."]], "135": [["dateVerse", "Tuesday, May 14, 2024", "Psalm 65:9-13", "Numbers 6", "Mark 11:1-11"], ["watchD", "The hand of our God is gracious to all who seek him, but his power and his wrath are against all who forsake him. Ezra 8:22"], ["docT", "So Jesus asked the twelve, “Do you also wish to go away?” John 6:67"], ["prayer", "Loving and merciful God, we know that too often we forget or forsake you. We think that we can handle things by ourselves, or we blame you for what is wrong with our lives. Pardon these transgressions in your mercy, and mend our hearts and spirits to seek you always. Amen."]], "136": [["dateVerse", "Wednesday, May 15, 2024", "Psalm 66:1-7", "Numbers 7:1-35", "Mark 11:12-26"], ["watchD", "O Lord, be our arm every morning, our salvation in the time of trouble. Isaiah 33:2"], ["docT", "Who are these, robed in white, and where have they come from? These are they who have come out of the great ordeal; they have washed their robes and made them white in the blood of the Lamb. They will hunger no more and thirst no more. Revelation 7:13-14,16"], ["prayer", "O morning Star and evening Rest, we know that you are with us always, throughout all our days, nights, and years. Give us grace to remember that all our time is a gift from you, to use for your work and praise, to bring your kingdom to earth. In Jesus’ name, we pray. Amen."]], "137": [["dateVerse", "Thursday, May 16, 2024", "Psalm 66:8-15", "Numbers 7:36-71", "Mark 11:27-12:12"], ["watchD", "From your lofty abode you water the mountains; the earth is satisfied with the fruit of your work. Psalm 104:13"], ["docT", "When they were satisfied, Jesus told his disciples, “Gather up the fragments left over, so that nothing may be lost.” So they gathered them up, and from the fragments of the five barley loaves, left by those who had eaten, they filled twelve baskets. John 6:12-13"], ["prayer", "Bountiful Provider, you bless us with an abundance of what we need, even when we think we are lacking. Help us to see and appreciate your richness toward us, and to share, so that others may also experience your many blessings. In Jesus’ name, we pray. Amen."]], "138": [["dateVerse", "Friday, May 17, 2024", "Psalm 66:16-20", "Numbers 7:72-8:4", "Mark 12:13-17"], ["watchD", "You shall not oppress a resident alien; you know the heart of an alien, for you were aliens in the land of Egypt. Exodus 23:9"], ["docT", "Then the righteous will answer him, ‘Lord, when was it that we saw you a stranger and welcomed you?’ And the king will answer them, ‘Truly I tell you, just as you did it to one of the least of these brothers and sisters of mine, you did it to me.’ Matthew 25:37,38,40"], ["prayer", "O God of all, there is so much need in this world! So many people are hungry; too many people must flee their homelands, and there is so much injustice that it seems there is no hope. Yet, you give us gifts of time and talent and treasure to use to bring hope and healing to a hurting world. May we always remember that sharing food, refuge, and justice is ministry. Amen."]], "139": [["dateVerse", "Saturday, May 18, 2024", "Psalm 67", "Numbers 8:5-9:14", "Mark 12:18-34"], ["watchD", "The Lord said, “I have observed the misery of my people who are in Egypt; I have heard their cry on account of their taskmasters.” Exodus 3:7"], ["docT", "If a brother or sister is naked and lacks daily food and one of you says to them, “Go in peace; keep warm and eat your fill,” and yet you do not supply their bodily needs, what is the good of that? James 2:15-16"], ["prayer", "O Lord of sea and sky, wind and flame, here I am, Lord. I have heard you calling in the night. I will go, Lord, if you lead me. I too, will hold your people in my heart. Amen.*"], ["info", "* ©1981 by Daniel L. Schutte and New Dawn Music, P.O. Box 13248, Portland, OR 97213. "]], "140": [["info", "Pentecost"], ["watchO", "Watchword for the week — O Lord, how manifold are your works! In wisdom you have made them all. Psalm 104:24"], ["dateVerse", "Sunday, May 19, 2024", "Acts 2:1-21", "Psalm 104:24-34,35b", "Romans 8:22-27", "John 15:26-27,16:4b-15"], ["watchD", "Let justice roll down like water and righteousness like an ever-flowing stream. Amos 5:24"], ["docT", "When the Spirit of truth comes, he will guide you into all the truth, for he will not speak on his own but will speak whatever he hears, and he will declare to you the things that are to come. John 16:13"], ["prayer", "O Spirit of truth, our world cries out for justice, for an end to conflicts, for harmony and peace. Give us the will, the strength, the conviction, and the inspiration to be your hands and your voice in our communities, that we may help bring the world just one step closer to your perfect realm. In Jesus’ name, we pray. Amen."]], "141": [["dateVerse", "Monday, May 20, 2024", "Psalm 68:1-6", "Numbers 9:15-10:36", "Mark 12:35-44"], ["watchD", "Thus says the Lord, “Heaven is my throne, and the earth is my footstool; so what kind of house could you build for me?” Isaiah 66:1"], ["docT", "Do you not know that you are God’s temple and that God’s Spirit dwells in you? 1 Corinthians 3:16"], ["prayer", "Indwelling God, make us mindful that you are a part of us, that you inhabit our minds and our hearts, that you direct our thoughts and our actions. Help us always to remember that we are a reflection of you to the world. We want to be a fitting temple, mind, and body for you. Amen."]], "142": [["dateVerse", "Tuesday, May 21, 2024", "Psalm 68:7-18", "Numbers 11", "Mark 13:1-13"], ["watchD", "I, the Lord, am the vineyard’s keeper; every moment I water it. I guard it night and day so that no one can harm it. Isaiah 27:3"], ["docT", "God is faithful, and he will not let you be tested beyond your strength, but with the testing he will also provide the way out so that you may be able to endure it. 1 Corinthians 10:13"], ["prayer", "Faithful God, you are our protector and guard along life’s journey. As you guide us, give us strength to face the hourly and daily temptations. Let us remember that you are the ruler of the earth, and that you care for us and all of your creation. In thanks, may we serve you through humanity. Amen."]], "143": [["dateVerse", "Wednesday, May 22, 2024", "Psalm 68:19-27", "Numbers 12:1-13:16", "Mark 13:14-27"], ["watchD", "He sent redemption to his people; he has commanded his covenant forever. Psalm 111:9"], ["docT", "Jesus Christ is the atoning sacrifice for our sins, and not for ours only but also for the sins of the whole world. 1 John 2:2"], ["prayer", "Our Redeemer, it is difficult to comprehend fully what you have done for humanity. You suffered torture on our behalf, and you died a cruel and painful death in our place. In return, we owe you eternal gratitude, loyalty, and praise. May we remember this each day of our lives. Amen."]], "144": [["dateVerse", "Thursday, May 23, 2024", "Psalm 68:28-35", "Numbers 13:17-33", "Mark 13:28-37"], ["watchD", "The people walking in darkness have seen a great light; on those living in the land of deep darkness a light has dawned. Isaiah 9:2 NIV"], ["docT", "When the magi saw that the star had stopped, they were overwhelmed with joy. On entering the house, they saw the child with Mary his mother, and they knelt down and paid him homage. Matthew 2:10-11"], ["prayer", "Most holy Lord, you brought light into a world of darkness with the birth of your son. Some days it seems that the world has returned to darkness, as violence, injustice, and conflicts increase. Let your glorious light be seen anew, that we may be reminded that you hold all things in your hand. Amen."]], "145": [["dateVerse", "Friday, May 24, 2024", "Psalm 69:1-12", "Numbers 14", "Mark 14:1-11"], ["watchD", "Far be it from us that we should forsake the Lord. Joshua 24:16"], ["docT", "Simon Peter answered him, “Lord, to whom can we go? You have the words of eternal life.” John 6:68"], ["prayer", "Forgiving God, we seem to forsake you every day. Sometimes it is intentional, sometimes we simply forget. Sometimes we are sorry, sometimes we repent of our sins. We humbly ask that you do not forsake us, unworthy though we are. Pardon these our sins of omission and commission and help us return to you. Amen."]], "146": [["dateVerse", "Saturday, May 25, 2024", "Psalm 69:13-21", "Numbers 15:1-31", "Mark 14:12-31"], ["watchD", "O Lord, be gracious to me; heal me, for I have sinned against you. Psalm 41:4"], ["docT", "Paul wrote: I am the least of the apostles, unfit to be called an apostle, because I persecuted the church of God. But by the grace of God I am what I am, and his grace toward me has not been in vain. 1 Corinthians 15:9-10"], ["prayer", "Holy One, we act against you every day, unfit to be your followers. We have done nothing to deserve your forgiveness. Yet by your grace, you still guide us, love us, save us. Remind us every day that we owe you our lives, our gratitude, our praise. In Jesus’ name, we pray. Amen."]], "147": [["info", "Trinity Sunday"], ["watchO", "Watchword for the week — Holy, holy, holy is the Lord of hosts; the whole earth is full of his glory. Isaiah 6:3"], ["dateVerse", "Sunday, May 26, 2024", "Isaiah 6:1-8", "Psalm 29", "Romans 8:12-17", "John 3:1-17"], ["watchD", "But you do see! Indeed, you note trouble and grief, that you may take it into your hands. Psalm 10:14"], ["docT", "When Jesus saw the bent-over woman, he called her over and said, “Woman, you are set free from your ailment.” When he laid his hands on her, immediately she stood up straight and began praising God. Luke 13:12-13"], ["prayer", "Holy One, your hands bring relief from pain and suffering, your hands bring healing of minds and bodies, your hands bring blessing and peace. We praise you for the work of your hands, reflected through our hands, to bring healing and blessing to the world. Amen."]], "148": [["dateVerse", "Monday, May 27, 2024", "Psalm 69:22-29", "Numbers 15:32-16:27", "Mark 14:32-42"], ["watchD", "With God we shall do valiantly. Psalm 60:12"], ["docT", "I appeal to you therefore, brothers and sisters, on the basis of God’s mercy, to present your bodies as a living sacrifice, holy and acceptable to God, which is your reasonable act of worship. Romans 12:1"], ["prayer", "O God, today we remember those who have given their lives in service. Inspired by their sacrifice, let us work to bring about a world where all people and all nations turn away from violence and conflict to know justice, compassion, peace, and love. May your kingdom come. Amen."]], "149": [["dateVerse", "Tuesday, May 28, 2024", "Psalm 69:30-36", "Numbers 16:28-17:13", "Mark 14:43-52"], ["watchD", "The hearing ear and the seeing eye–the Lord has made them both. Proverbs 20:12"], ["docT", "Philip ran up to it and heard him reading the prophet Isaiah. He asked, “Do you understand what you are reading?” The Ethiopian eunuch replied, “How can I, unless someone guides me?” And he invited Philip to get in and sit beside him. Acts 8:30-31"], ["prayer", "Almighty God, for your inspiration to proclaim the wonders of your creation, we give you thanks. For your guidance to interpret and follow your teachings, we give you thanks. For giving us this day with its opportunities and challenges, we give you thanks. In your blest name, we pray. Amen."]], "150": [["dateVerse", "Wednesday, May 29, 2024", "Psalm 70", "Numbers 18:1-24", "Mark 14:53-65"], ["watchD", "Moses said to them, “Take to heart all the words that I am giving in witness against you today. This is no trifling matter for you but rather your very life.” Deuteronomy 32:46,47"], ["docT", "It is the spirit that gives life; the flesh is useless. The words that I have spoken to you are spirit and life. John 6:63"], ["prayer", "O Lord and Spirit, we thank you for giving us your words of life. As we hear them read or spoken, as we silently read and study them, give us the wisdom to interpret and understand them so that we may, through the Spirit’s leading, bring harmony and life to our communities. Amen."]], "151": [["dateVerse", "Thursday, May 30, 2024", "Psalm 71:1-8", "Numbers 18:25-19:22", "Mark 14:66-72"], ["watchD", "When the Lord restored the fortunes of Zion, we were like those who dream. Psalm 126:1"], ["docT", "Love never ends. But as for prophecies, they will come to an end; as for tongues, they will cease; as for knowledge, it will come to an end. For now we see only a reflection, as in a mirror, but then we will see face to face. 1 Corinthians 13:8,12"], ["prayer", "Lord God of hosts, as we go through our daily lives, we rarely think about what happens after this world. There is too much to do on this earth, too much to enjoy and appreciate. But we know, in the back of our minds, that eventually we will join the Church Triumphant, and that it will be beyond anything that we can imagine. Alleluia! Amen."]], "152": [["dateVerse", "Friday, May 31, 2024", "Psalm 71:9-18a", "Numbers 20:1-21:9", "Mark 15:1-20"], ["watchD", "All who were incensed against him shall come to him and be ashamed. Isaiah 45:24"], ["docT", "Again the high priest asked him, “Are you the Messiah, the Son of the Blessed one?” Jesus said, “I am, and you will see the Son of Man seated at the right hand of the Power and coming with the clouds of heaven.” Mark 14:61-62"], ["prayer", "O blessed One, we await your coming in glory. Until that day, direct us to work to prepare for your kingdom on earth, bringing justice and healing to the nations, and humility and wisdom to our leaders. Let us join our alleluias with our actions in worship of you. Amen."]], "153": [["dateVerse", "Saturday, June 1, 2024", "Psalm 71:18b-24", "Numbers 21:10-22:6", "Mark 15:21-32"], ["watchD", "I have been pouring out my soul before the Lord. 1 Samuel 1:15"], ["docT", "The woman stood behind Jesus at his feet, weeping, and began to bathe his feet with her tears and to dry them with her hair, kissing his feet and anointing them with the ointment. Luke 7:38"], ["prayer", "Friend Jesus, it is a comfort knowing that we can open our hearts to you. Even as we speak our prayers, we can feel our burdens become lighter. Receive our tears, not only as expressions of our pain, but also as evidence of the depth of our gratitude for your love and care. Amen."]], "154": [["info", "Second Sunday after Pentecost"], ["watchO", "Watchword for the week — I delight to do your will, O my God; your law is within my heart. Psalm 40:8"], ["dateVerse", "Sunday, June 2, 2024", "Deuteronomy 5:12-15", "Psalm 81:1-10", "2 Corinthians 4:5-12", "Mark 2:23-3:6"], ["watchD", "Surely goodness and mercy shall follow me all the days of my life, and I shall dwell in the house of the Lord my whole life long. Psalm 23:6"], ["docT", "Day by day, as they spent much time together in the temple, they broke bread at home and ate their food with glad and generous hearts, praising God and having the goodwill of all the people. Acts 2:46-47"], ["prayer", "Loving Shepherd, we thank you for your tender care and the promise of future joy with you. We also thank you for the flock into which you have called us. It is good not to be alone, but to live in fellowship with other Christians with whom we can share our joys and sorrows, and experience a foretaste of the joy which will be ours in your presence. May we be sources of love and care for those around us. Amen."]], "155": [["dateVerse", "Monday, June 3, 2024", "Psalm 72:1-11", "Numbers 22:7-41", "Mark 15:33-47"], ["watchD", "O Lord, you are God, you alone, of all the kingdoms of the earth; you have made heaven and earth. 2 Kings 19:15"], ["docT", "There is no distinction between Jew and Greek; the same Lord is Lord of all and is generous to all who call on him. Romans 10:12"], ["prayer", "Divine Creator, the universe proclaims your power and glory from the wonder of unnumbered galaxies to the most fragile of lifeforms. Despite your position above and beyond all things, you chose to enter into your creation, in Jesus Christ, to reveal yourself to humankind as one who loves us and longs to receive our love in return. We praise you for your reconciling love and yield ourselves to you. In Jesus’ name, we pray. Amen."]], "156": [["dateVerse", "Tuesday, June 4, 2024", "Psalm 72:12-20", "Numbers 23", "Mark 16:1-13"], ["watchD", "The Lord said, “My presence will go with you, and I will give you rest.” Exodus 33:14"], ["docT", "So then, a Sabbath rest still remains for the people of God. Hebrews 4:9"], ["prayer", "Our Refuge and our Rest, by entering into your presence we find comfort and peace. Whether in sorrow or serenity, may we crawl into your loving heart to find renewal and refreshment. Thus renewed, may we go forward to meet the challenges and opportunities of our lives. In Jesus’ name, we pray. Amen."]], "157": [["dateVerse", "Wednesday, June 5, 2024", "Psalm 73:1-12", "Numbers 24,25", "Mark 16:14-Luke 1:4"], ["watchD", "As my life was ebbing away, I remembered the Lord, and my prayer came to you. Jonah 2:7"], ["docT", "Do not be anxious about anything, but in everything by prayer and supplication with thanksgiving let your requests be made known to God. Philippians 4:6"], ["prayer", "Comforting Presence, when the storms of life assail us, may we remember that you are as near as an open heart and a heartfelt prayer. As the tempests roar without or within us, as we turn to you, may we be confident that we will find grace and strength sufficient to our need. In Jesus’ name, we pray. Amen."]], "158": [["dateVerse", "Thursday, June 6, 2024", "Psalm 73:13-20", "Numbers 26:1-25", "Luke 1:5-25"], ["watchD", "Do not fear, for I am with you. Isaiah 43:5"], ["docT", "One night the Lord said to Paul in a vision, “Do not be afraid, but speak and do not be silent, for I am with you, and no one will lay a hand on you to harm you.” Acts 18:9-10"], ["prayer", "O God, our help and stay, whatever challenges or problems may come our way, reassure us of your presence to comfort, strengthen and embolden us. Grant us the grace to feel your strong hands upholding and protecting us as your Spirit leads us forth. Amen."]], "159": [["dateVerse", "Friday, June 7, 2024", "Psalm 73:21-28", "Numbers 26:26-56", "Luke 1:26-38"], ["watchD", "The Lord said, “I am going to send an angel in front of you, to guard you on the way and to bring you to the place that I have prepared.” Exodus 23:20"], ["docT", "Now after the magi had left, an angel of the Lord appeared to Joseph in a dream and said, “Get up, take the child and his mother, and flee to Egypt, and remain there until I tell you, for Herod is about to search for the child, to destroy him.” Matthew 2:13"], ["prayer", "O holy Guardian and Guide, we are blessed in knowing that we are not left to our own devices, wandering through life. We rejoice at your Spirit’s leading us, as we seek your will and guidance. We pray that you will lead us day by day to places of safety and opportunity, where we can fulfill ourselves and minister to others. Amen."]], "160": [["dateVerse", "Saturday, June 8, 2024", "Psalm 74:1-9", "Numbers 26:57-27:23", "Luke 1:39-45"], ["watchD", "If my father and mother forsake me, the Lord will take me up. Psalm 27:10"], ["docT", "Paul wrote: Though my condition put you to the test, you did not scorn or despise me but welcomed me as an angel of God, as Christ Jesus. Galatians 4:14"], ["prayer", "O loving, heavenly Parent, because of your love for us, none of us is left motherless or fatherless. We are your children. Because of your love for all your children, none of us lives without brothers and sisters. Open our eyes and hearts to see and feel others to truly be worthy of our love, care, and forbearance, as if they were beloved siblings. In Jesus’ name, we pray. Amen."]], "161": [["info", "Third Sunday after Pentecost"], ["watchO", "Watchword for the week — Lord, hear my voice! Let your ears be attentive to the voice of my supplications! Psalm 130:2"], ["dateVerse", "Sunday, June 9, 2024", "Genesis 3:8-15", "Psalm 130", "2 Corinthians 4:13-5:1", "Mark 3:20-35"], ["watchD", "Does God not see my ways and number all my steps? Job 31:4"], ["docT", "Are not five sparrows sold for two pennies? Yet not one of them is forgotten in God’s sight. Luke 12:6"], ["prayer", "God of the sparrow, in a universe of innumerable galaxies, and on a planet with billions of people, it is so easy for us to think of ourselves as being insignificant individuals. Guide us into Jesus’ truth, that just as God values each individual sparrow, how much more does God value each of us, crafted in God’s image and filled with the spirit. Help each of us to feel the truth: “I am loved by the Master of the Universe.” Amen."]], "162": [["dateVerse", "Monday, June 10, 2024", "Psalm 74:10-17", "Numbers 28:1-29:6", "Luke 1:46-56"], ["watchD", "Moses and Aaron went to Pharaoh and said to him, “Thus says the Lord ‘Let my people go, so that they may serve me.’” Exodus 10:3"], ["docT", "For freedom Christ has set us free. Stand firm, therefore, and do not submit again to a yoke of slavery. Galatians 5:1"], ["prayer", "Almighty Savior, as the Israelites were liberated from their bondage in Egypt, so you have set us free from the tyranny of sin and the fear of death. Grant us confidence to live as victors. May we feel and use the strength you have given us to resist the temptation to sin. By the hope given us through the resurrection of Jesus Christ, may we face death with a sense of victory and peace. Amen."]], "163": [["dateVerse", "Tuesday, June 11, 2024", "Psalm 74:18-23", "Numbers 29:7-40", "Luke 1:57-66"], ["watchD", "Those who counsel peace have joy. Proverbs 12:20"], ["docT", "If it is possible, so far as it depends on you, live peaceably with all. Romans 12:18"], ["prayer", "O Prince of peace, in a world torn asunder by wars and in a nation polarized by differences, we know there is a better way. May we, as your disciples, be examples to the world and our neighbors of that better way. As we strive to be at peace with one another, may others see in us a way to live peacefully and productively despite our differences. May we be instruments of your peace and channels of your love. Amen."]], "164": [["dateVerse", "Wednesday, June 12, 2024", "Psalm 75", "Numbers 30:1-31:12", "Luke 1:67-80"], ["watchD", "You have given humans dominion over the works of your hands; you have put all things under their feet. Psalm 8:6"], ["docT", "“All things are permitted for me,” but not all things are beneficial. “All things are permitted for me,” but I will not be dominated by anything. 1 Corinthians 6:12"], ["prayer", "Generous Creator, you have defined our relationship to the creation as one of responsible stewardship, keeping and tilling the garden as those accountable to you for its care. Forgive us for acting as if we ourselves are the owners, recklessly using and abusing the earth and sky and sea. Call us back to our role as stewards, gently caring for what is entrusted to us only for a time. Amen."]], "165": [["dateVerse", "Thursday, June 13, 2024", "Psalm 76", "Numbers 31:13-47", "Luke 2:1-20"], ["watchD", "Moses said, “You must diligently observe everything that I command you; do not add to it or take anything from it.” Deuteronomy 12:32"], ["docT", "Jesus said, “My teaching is not mine but his who sent me. Anyone who resolves to do the will of God will know whether the teaching is from God or whether I am speaking on my own.” John 7:16-17"], ["prayer", "O Eternal Word, Jesus Christ, we give you thanks and praise for coming to us as the definitive expression of the will and ways of God. May you be for us the only trustworthy lens through which we seek to discern the will of God, for you are one with the Father and the brightness of God’s glory. Show us the Father, and we shall be satisfied. Amen."]], "166": [["dateVerse", "Friday, June 14, 2024", "Psalm 77:1-9", "Numbers 31:48-32:27", "Luke 2:21-32"], ["watchD", "All the people responded with a great shout when they praised the Lord because the foundation of the house of the Lord had been laid. Ezra 3:11"], ["docT", "No one can lay any foundation other than the one that has been laid; that foundation is Jesus Christ. 1 Corinthians 3:11"], ["prayer", "Christ, our cornerstone, we can so easily become focused on the bricks and mortar of the church that we forget that the church is your body of believers, and you are the foundation. Remind us that we, as the church, are your body called out to be your heart and hands in ministry to the world. Open us to opportunities to serve in your name, to lighten the burdens of others, and to make you known to those who have not heard of your love. Amen."]], "167": [["dateVerse", "Saturday, June 15, 2024", "Psalm 77:10-15", "Numbers 32:28-42", "Luke 2:33-40"], ["watchD", "Sow righteousness for yourselves, reap the fruit of unfailing love. Hosea 10:12 NIV"], ["docT", "The land of a rich man produced abundantly. And he thought to himself, ‘Soul, you have ample goods laid up for many years; relax, eat, drink, be merry.’ But God said to him, ‘You fool!’ Luke 12:16-17,19-20"], ["prayer", "O Fount of every blessing, we seek to be faithful stewards of the resources that are ours: spending wisely and saving for the future. Guide us in balancing our own needs and wants in scale with the needs of others. May we sow seeds of righteousness that your will for justice and wholeness for all your children may, in part, be realized through our efforts and faithfulness. In Jesus’ name, we pray. Amen."]], "168": [["info", "Fourth Sunday after Pentecost"], ["watchO", "Watchword for the week — It is good to give thanks to the Lord, to sing praises to your name, O Most High. Psalm 92:1"], ["dateVerse", "Sunday, June 16, 2024", "Ezekiel 17:22-24", "Psalm 92:1-4,12-15", "2 Corinthians 5:6-10,14-17", "Mark 4:26-34"], ["watchD", "All look to you to give them their food in due season; when you give to them, they gather it up; when you open your hand, they are filled with good things. Psalm 104:27-28"], ["docT", "Jesus said to them, “I am the bread of life. Whoever comes to me will never be hungry, and whoever believes in me will never be thirsty.” John 6:35"], ["prayer", "O Bread from heaven, when we measure the blessings of our lives, our minds too often drift to the tangible things we can see and touch. Beyond shelter, food, physical possessions, and loved ones, may we ever be mindful of the intangible things that come only from you. You are the source of forgiveness, love, comfort of spirit, and the promise of eternal life. Feed us as only you can. In Jesus’ name, we pray. Amen."]], "169": [["dateVerse", "Monday, June 17, 2024", "Psalm 77:16-20", "Numbers 33", "Luke 2:41-52"], ["watchD", "O sing to the Lord a new song, for he has done marvelous things. Psalm 98:1"], ["docT", "From his fullness we have all received, grace upon grace. John 1:16"], ["prayer", "Source of all goodness, we praise you for who you are and all you have done. You called the universe to life and began your work of creation. You breathed your spirit into humankind and invited us into relationship with yourself and one another. You offered Jesus to the world to bridge the chasm that sin had created between yourself and us, to teach us your will, and to open for us the pathway to eternal life in your presence. Each day of our lives you offer yourself to us in fellowship and love. We praise you for your unequalled goodness. Amen."]], "170": [["dateVerse", "Tuesday, June 18, 2024", "Psalm 78:1-8", "Numbers 34", "Luke 3:1-20"], ["watchD", "I gave them my statutes and showed them my ordinances, by whose observance everyone shall live. Ezekiel 20:11"], ["docT", "God’s love was revealed among us in this way: God sent his only son into the world so that we might live through him. 1 John 4:9"], ["prayer", "O Giver of law and love, we thank you for offering to us, through the lives and teaching of patriarchs and prophets, guidance for righteous and productive living. Even more, we thank you for your gift of Jesus Christ whose life and teaching call us to his new law of love for you and our neighbor. Through Christ’s life, suffering, death and resurrection, he reconciled us to yourself through the forgiveness of sin and the gift of your Spirit. We give you the glory for the great things you have done. Amen. "]], "171": [["dateVerse", "Wednesday, June 19, 2024", "Psalm 78:9-16", "Numbers 35:1-21", "Luke 3:21-38"], ["watchD", "Listen to me, my people; hear me, my nation: Instruction will go out from me; my justice will become a light to the nations. Isaiah 51:4 NIV"], ["docT", "Simeon praised God, saying, “My eyes have seen your salvation, which you have prepared in the presence of all peoples, a light for revelation to the gentiles and for glory to your people Israel.” Luke 2:28,30-32"], ["prayer", "O God of justice and peace, we thank you for revealing your will to us. Because of your instruction, we need not stumble in the dark wondering what you require of us or what awaits your faithful people in the future. You offer us hope and a vision of where you are leading us. May we follow where you are leading that we might be instruments of your will and recipients of your blessing. Amen."]], "172": [["dateVerse", "Thursday, June 20, 2024", "Psalm 78:17-31", "Numbers 35:22-36:13", "Luke 4:1-13"], ["watchD", "May your hearts be fully committed to the Lord our God. 1 Kings 8:61 NIV"], ["docT", "Paul wrote: One thing I do: forgetting what is behind and straining toward what is ahead, I press on toward the goal to win the prize for which God has called me heavenward in Christ Jesus. Philippians 3:13-14 NIV"], ["prayer", "Lord Jesus, you referred to yourself as the way. May we see our faith not as a destination or accomplishment, but as a way of living—a process of giving ourselves more fully to you. As we follow, may we see you more clearly, love you more dearly, follow you more nearly, day by day. Amen."]], "173": [["dateVerse", "Friday, June 21, 2024", "Psalm 78:32-39", "Deuteronomy 1", "Luke 4:14-21"], ["watchD", "You shall not murder. Exodus 20:13"], ["docT", "Jesus said to his disciples, “This is my commandment, that you love one another as I have loved you.” John 15:12"], ["prayer", "O Author of love, we pray that our lives might demonstrate a better way of living. In the face of racism, violence, and conflict, may our relationships and interactions with others be centered in love, forbearance, and compassion, so that the world might learn through us to live by love. In Jesus’ name, we pray. Amen."]], "174": [["dateVerse", "Saturday, June 22, 2024", "Psalm 78:40-55", "Deuteronomy 2", "Luke 4:22-30"], ["watchD", "Be gracious to me, O Lord, for I am languishing; O Lord, heal me, my soul also is struck with terror. Psalm 6:2,3"], ["docT", "Jesus said, “Come to me, all you who are weary and are carrying heavy burdens, and I will give you rest.” Matthew 11:28"], ["prayer", "O divine Physician of the soul, many of us carry heavy burdens. We are grateful that you invite us to bring those burdens to you that we might find rest for our souls. Whether it be illness of body or spirit, broken relationships, emptiness of life, or concern for the world and culture around us, we are hurting and fearful. Lord, grant us comfort, peace, and hope. Amen."]], "175": [["info", "Fifth Sunday after Pentecost"], ["watchO", "Watchword for the week — O give thanks to the Lord, for he is good; for his steadfast love endures forever. Psalm 107:1"], ["dateVerse", "Sunday, June 23, 2024", "Job 38:1-11", "Psalm 107:1-3,23-322", "Corinthians 6:1-13", "Mark 4:35-41"], ["watchD", "I will tell of your name to my brothers and sisters. Psalm 22:22"], ["docT", "Paul wrote: I want you to know, brothers and sisters, that the gospel that was proclaimed by me is not of human origin. Galatians 1:11"], ["prayer", "O Savior of all, in you we have found our answer to the needs of our lives and the world. We confess that, at times, we are reluctant to share the good news of your love and power with those whose lives we touch. We shrink back from being your witnesses. Forgive us. Cause your spirit to move within us, inspiring and emboldening us to share the good news we have found in you. Amen."]], "176": [["dateVerse", "Monday, June 24, 2024", "Psalm 78:56-64", "Deuteronomy 3", "Luke 4:31-44"], ["watchD", "Lord, let your mercy come to me, that I may live. Psalm 119:77"], ["docT", "This is my prayer, that your love may overflow more and more with knowledge and full insight. Philippians 1:9"], ["prayer", "Merciful Father, we confess that we are a sinful people. We divide your human family into those like us and those different from us. Cleanse our hearts of judgment, bigotry, and pride. Open our eyes and minds and hearts to our interconnectedness to those of different nations, races, tongues, and viewpoints. Show us how we can be enriched by our differences and strengthened through our diversity. Amen."]], "177": [["dateVerse", "Tuesday, June 25, 2024", "Psalm 78:65-72", "Deuteronomy 4:1-31", "Luke 5:1-11"], ["watchD", "Listen to me, you stubborn-hearted, you who are now far from my righteousness. I am bringing  my righteousness near, it is not far away. Isaiah 46:12-13 NIV"], ["docT", "It is with your heart that you believe and are justified, and it is with your mouth that you profess your faith and are saved. Romans 10:10 NIV"], ["prayer", "God of all nations, news of your salvation continues to spread throughout the world. Still, the hard-hearted resist your will. Make yourself known to those who have not yet surrendered themselves to your love and reign. Continue your re-creation of the world, one heart at a time, beginning with us. Amen. "]], "178": [["dateVerse", "Wednesday, June 26, 2024", "Psalm 79:1-8", "Deuteronomy 4:32-5:21", "Luke 5:12-26"], ["watchD", "Remember the wonderful works he has done, his miracles and the judgments he has uttered. Psalm 105:5"], ["docT", "Give thanks in all circumstances, for this is the will of God in Christ Jesus for you. 1 Thessalonians 5:18"], ["prayer", "Wondrous God, the earth and heavens display your handiwork. Our hearts swell with gratitude for your blessings as numerous as the stars. Grant us the grace to remain grateful to you in all the circumstances of our lives. Whether in times of bounty or need, health or illness, joy or sorrow, pleasure or pain, may we lift our hearts and voices to you in praise of your goodness. Amen."]], "179": [["dateVerse", "Thursday, June 27, 2024", "Psalm 79:9-13", "Deuteronomy 5:22-6:25", "Luke 5:27-39"], ["watchD", "Lift up your voice like a trumpet! Announce to my people their rebellion. Isaiah 58:1"], ["docT", "Jesus began to proclaim, “Repent, for the kingdom of heaven has come near.” Matthew 4:17"], ["prayer", "O Guardian of our souls, we thank you for your spirit’s voice that calls us to repentance when we have strayed from your will. We pray that you will continue to speak to us through your spirit, leading us away from sin and into righteous living. May we ever be attentive to your guidance and respond with gratitude as you show us the way. In Jesus’ name, we pray. Amen."]], "180": [["dateVerse", "Friday, June 28, 2024", "Psalm 80:1-7", "Deuteronomy 7", "Luke 6:1-11"], ["watchD", "In the Lord my heart trusts; so I am helped, and my heart exults, and with my song I give thanks to him. Psalm 28:7"], ["docT", "Through Jesus, then, let us continually offer a sacrifice of praise to God, that is, the fruit of lips that confess his name. Hebrews 13:15"], ["prayer", "Divine Companion, it makes such a difference when we remember that you travel the road of life with us. Our burdens are lightened; the colors are brightened when we feel you near. The darkness is less threatening, and our fears are less frightening when we remember you are here. Feeling you by our side, our joy is multiplied, and our praise is magnified. May we ever remember you are near so that we might find blessing and glorify your name. In Jesus’ name, we pray. Amen."]], "181": [["dateVerse", "Saturday, June 29, 2024", "Psalm 80:8-11", "Deuteronomy 8:1-9:6", "Luke 6:12-26"], ["watchD", "Remember your creator in the days of your youth, before the days of trouble come and the years draw near when you will say, “I have no pleasure in them.” Ecclesiastes 12:1"], ["docT", "I will get up and go to my father, and I will say to him, “Father, I have sinned against heaven and before you; I am no longer worthy to be called your son; treat me like one of your hired hands.” Luke 15:18-19"], ["prayer", "Loving Father, when times of trouble come, we are sometimes tempted to see you as the cause and turn away from you. We take comfort in the trust that when we reject you, you do not abandon us. We thank you that you remain faithful to us even in times of our indifference. May we not test your patience, but may we remember your goodness and return to you, knowing that you await us with a forgiving and open heart. Amen. "]], "182": [["info", "Sixth Sunday after Pentecost"], ["watchO", "Watchword for the week — The steadfast love of the Lord never ceases, his mercies never come to an end. Lamentations 3:22"], ["dateVerse", "Sunday, June 30, 2024", "Lamentations 3:22-33", "Psalm 302", "Corinthians 8:7-15", "Mark 5:21-43"], ["watchD", "I will give them one heart and put a new spirit within them. Ezekiel 11:19"], ["docT", "God did not give us a spirit of cowardice but rather a spirit of power and of love and of self-discipline. 2 Timothy 1:7"], ["prayer", "Almighty God, we praise you for your gentleness toward us. In our loneliness you offer us your love. In our waywardness you offer us renewal. In our weakness you offer us your strength. May we not only enjoy the blessings which you shower upon us, but may we use them to lighten the burdens of others. Give us gentle hearts, that we might be blessings to others. Amen."]], "183": [["dateVerse", "Monday, July 1, 2024", "Psalm 80:12-19", "Deuteronomy 9:7-10:22", "Luke 6:27-38"], ["watchD", "O give thanks to the Lord, for he is good, for his steadfast love endures forever. Psalm 106:1"], ["docT", "Whatever you do, in word or deed, do everything in the name of the Lord Jesus, giving thanks to God the Father through him. Colossians 3:17"], ["prayer", "Creator God, the landscape and people around us are evidence of your power and majesty. When considering your all-encompassing love, we can’t help but enter this day praising your holy name. Enable each day’s thoughts and actions to be an expression of gratitude. Through Christ, our Lord. Amen."]], "184": [["dateVerse", "Tuesday, July 2, 2024", "Psalm 81:1-5", "Deuteronomy 11", "Luke 6:39-49"], ["watchD", "O Lord! May your friends be like the sun as it rises in its might. Judges 5:31"], ["docT", "Jesus said, “You are the light of the world. A city built on a hill cannot be hid. In the same way, let your light shine before others.” Matthew 5:14,16"], ["prayer", "O Giver of light, we ask that you take the flame of faith within us—fanning it to burn so brightly that others will be guided to places of safety, security, and serenity—seeing in us the very light of the Christ, in whose name, we pray. Amen."]], "185": [["dateVerse", "Wednesday, July 3, 2024", "Psalm 81:6-10", "Deuteronomy 12", "Luke 7:1-17"], ["watchD", "Rend your hearts and not your clothing. Return to the Lord your God! Joel 2:13"], ["docT", "You were bought with a price; therefore glorify God in your body. 1 Corinthians 6:20"], ["prayer", "Lord, God, among and within us are pressures causing us to withdraw and turn inward, closing ourselves off for self-protection. Instead, enable us to turn to the Christ in whom we find the way out of ourselves, discovering life to be found in serving others in ministries that bring mercy, justice, and encouragement. In Jesus’ name, we pray. Amen."]], "186": [["dateVerse", "Thursday, July 4, 2024", "Psalm 81:11-16", "Deuteronomy 13:1-14:21", "Luke 7:18-30"], ["watchD", "Happy are those who consider the poor; the Lord delivers them in the day of trouble. Psalm 41:1"], ["docT", "Do not neglect to do good and to share what you have, for such sacrifices are pleasing to God. Hebrews 13:16"], ["prayer", "O listening God, we confess that too often we overlook the needs of the poor, caught up in the web of our own challenges and concerns. We ask for the brilliant light of Christ to break the darkness of our selfishness, discovering that happiness is found in meeting others’ needs, just as did our Lord Jesus. Amen."]], "187": [["dateVerse", "Friday, July 5, 2024", "Psalm 82:1-4", "Deuteronomy 14:22-15:18", "Luke 7:31-38"], ["watchD", "You who fear the Lord, trust in the Lord! Psalm 115:11"], ["docT", "Look at the birds of the air: they neither sow nor reap nor gather into barns, and yet your heavenly Father feeds them. Matthew 6:26"], ["prayer", "O trustworthy God, we seek to trust and be confident in our daily walk, more fully giving testimony to what is true, what is just, what is pure, and what is honorable. Thinking on these things, we will face this day boldly trusting in your promises. Through Christ our Lord, we pray. Amen."]], "188": [["specialVerse", "John Hus Festival", "Isaiah 49:1-7", "Psalm 135:1-131", "Corinthians 1:18-24", "Mark 8:34-38"], ["dateVerse", "Saturday, July 6, 2024", "Psalm 82:5-8", "Deuteronomy 15:19-17:7", "Luke 7:39-50"], ["watchD", "You who live in the shelter of the Most High, who abide in the shadow of the Almighty, will say to the Lord, “My refuge and my fortress; my God, in whom I trust.” Psalm 91:1-2"], ["docT", "To this day I have had help from God, and so I stand here, testifying to both small and great. Acts 26:22"], ["prayer", "Great Author of life, you put a story in our hearts by claiming us as your beloved children. Your servant, John Hus, has written his story in the life of our church. Enable us to become storytellers in our own day, sharing the message of help and hope to be found in Christ. Amen."]], "189": [["info", "Seventh Sunday after Pentecost"], ["watchO", "Watchword for the week — Jesus said, “My grace is sufficient for you, for power is made perfect in weakness.” 2 Corinthians 12:9"], ["dateVerse", "Sunday, July 7, 2024", "Ezekiel 2:1-5", "Psalm 123", "2Corinthians 12:2-10", "Mark 6:1-13"], ["watchD", "When the wicked turn away from the wickedness they have committed and do what is lawful and right, they shall save their life. Ezekiel 18:27"], ["docT", "For what will it profit them if they gain the whole world but forfeit their life? Matthew 16:26"], ["prayer", "God of wisdom, you invite us to an inward journey. Enable us to see the innermost places where resentments, bitterness, and grudges lie in festering pools—all too often rising up and tainting our attitudes and actions. We ask you to cleanse our inner most places. In Jesus’ name, we pray. Amen."]], "190": [["dateVerse", "Monday, July 8, 2024", "Psalm 83:1-8", "Deuteronomy 17:8-18:22", "Luke 8:1-15"], ["watchD", "It is your own eyes that have seen every great deed that the Lord did. Deuteronomy 11:7"], ["docT", "We did not follow cleverly devised myths when we made known to you the power and coming of our Lord Jesus Christ, but we had been eyewitnesses of his majesty. 2 Peter 1:16"], ["prayer", "Ever-present God of all, if we but take the time to consider, we will discover the many ways in which you have impacted our lives—to bless, guide, and empower us. We shout it to the mountaintop, praising your holy name, grateful for your abiding presence. Through Jesus Christ, our Lord. Amen."]], "191": [["dateVerse", "Tuesday, July 9, 2024", "Psalm 83:9-12", "Deuteronomy 19:1-20:9", "Luke 8:16-25"], ["watchD", "May God be gracious to us and bless us. Psalm 67:1"], ["docT", "Jesus took the children up in his arms, laid his hands on them, and blessed them. Mark 10:16"], ["prayer", "Looking into the face of a child, we acknowledge each one is created in your image, Lord God. Motivate us all to guide and protect them, and by our own example, enable them to develop a personal relationship with your son, our Savior, Christ the Lord. Amen."]], "192": [["dateVerse", "Wednesday, July 10, 2024", "Psalm 83:13-18", "Deuteronomy 20:10-21:23", "Luke 8:26-39"], ["watchD", "Indeed, since that day I am he; there is no one who can deliver from my hand; I work, and who can hinder it? Isaiah 43:13"], ["docT", "So let no one boast about people. For all things are yours, and you are Christ’s, and Christ is  1 Corinthians 3:21,23"], ["prayer", "O Lord our Lord, how long will we insist on finding meaning and purpose in the things of this world? Move us, we ask, to break out of our struggles and simply turn to your son Jesus, listening to the one who is the way, the truth, and the life. In his name, we pray. Amen."]], "193": [["dateVerse", "Thursday, July 11, 2024", "Psalm 84:1-7", "Deuteronomy 22", "Luke 8:40-56"], ["watchD", "In the place where it was said to them, “You are not my people,” it shall be said to them, “Children of the living God.” Hosea 1:10"], ["docT", "So you are no longer a slave but a child, and if a child then also an heir through God. Galatians 4:7"], ["prayer", "O holy God, whose arms are wide open to all your children, we offer praise and thanksgiving. Lead us to extend equally open arms to those from whom we are separated by the barriers of prejudice, mistrust, resentment, and fear. In Jesus’ reconciling name, we pray. Amen."]], "194": [["dateVerse", "Friday, July 12, 2024", "Psalm 84:8-12", "Deuteronomy 23:1-24:13", "Luke 9:1-11"], ["watchD", "Not one word has failed of all his good promise that he spoke through his servant Moses. 1 Kings 8:56"], ["docT", "Beginning with Moses and all the prophets, Jesus interpreted to them the things about himself in all the scriptures. Luke 24:27"], ["prayer", "O living Word, enable us to approach your word with integrity and openness of mind and heart, reading what you have stated, not what we want the Bible to say. Your word is a lamp unto our feet and a guide unto our paths. Amen."]], "195": [["dateVerse", "Saturday, July 13, 2024", "Psalm 85:1-7", "Deuteronomy 24:14-25:19", "Luke 9:12-27"], ["watchD", "Who has performed and done this, calling the generations from the beginning? I, the Lord, am first and will be with the last. Isaiah 41:4"], ["docT", "Do not be afraid; I am the First and the Last and the Living One. Revelation 1:17-18"], ["prayer", "Everlasting God, you have always been and will always be. You remain amazingly present, available, and steadfast while so much in our lives is adrift, fleeting, and senseless. We trust in your abiding presence in every moment of our lives. Thanks be to you. Amen."]], "196": [["info", "Eighth Sunday after Pentecost"], ["watchO", "Watchword for the week — Surely God’s salvation is at hand for those who fear him, that his glory may dwell in our land. Psalm 85:9"], ["dateVerse", "Sunday, July 14, 2024", "Amos 7:7-15", "Psalm 85:8-13", "Ephesians 1:3-14", "Mark 6:14-29"], ["watchD", "The earth is the Lord’s and all that is in it, the world, and those who live in it. Psalm 24:1"], ["docT", "So then, you are no longer strangers and aliens, but you are fellow citizens with the saints and also members of the household of God. Ephesians 2:19"], ["prayer", "Wondrous Builder of community, your constant and never-changing message is that we all belong in your household. Inspire us to show our gratitude by working faithfully to welcome and include others into our circles of family, friends, and neighbors. In Christ’ name, we pray. Amen."]], "197": [["dateVerse", "Monday, July 15, 2024", "Psalm 85:8-13", "Deuteronomy 26:1-27:13", "Luke 9:28-36"], ["watchD", "The Lord of hosts is with us; the God of Jacob is our refuge. Psalm 46:7"], ["docT", "As Jesus went ashore, he saw a great crowd, and he had compassion for them, because they were like sheep without a shepherd. Mark 6:34"], ["prayer", "Great Shepherd, you confirm assurance of God’s presence in our lives in all times and places. Enable us to more fully rely on your ability to guide us through the struggles of life’s storms and the difficulties we have created for ourselves. In your name, we pray. Amen."]], "198": [["dateVerse", "Tuesday, July 16, 2024", "Psalm 86:1-10", "Deuteronomy 27:14-28:24", "Luke 9:37-50"], ["watchD", "Why do you say, O Jacob, and assert, O Israel, “My way is hidden from the Lord, and my right is disregarded by my God”? Isaiah 40:27"], ["docT", "Jesus said to the disciples, “Oh, how foolish you are and how slow of heart to believe all that the prophets have declared! Was it not necessary that the Messiah should suffer these things and then enter into his glory?” Luke 24:25-26"], ["prayer", "O God of each day, how refreshing to learn your children long ago questioned you, and at times felt disregarded. Still, we trust you in moments of uncertainty and continue to turn to you for courage and wisdom to live through each day’s struggles. Amen."]], "199": [["dateVerse", "Wednesday, July 17, 2024", "Psalm 86:11-17", "Deuteronomy 28:25-57", "Luke 9:51-62"], ["watchD", "This is the covenant that I will make with the house of Israel after those days, says the Lord: I will put my law within them, and I will write it on their hearts, and I will be their God, and they shall be my people. Jeremiah 31:33"], ["docT", "They are Israelites, and to them belong the adoption, the glory, the covenants, the giving of the law, the worship, and the promises. Romans 9:4"], ["prayer", "O God, the keeper of all promises, we ask that you remind us each and every day that you have made covenant with us, your children; that your promises are ever before us; that despite who we are, you remain our God, instilling your life in us. Through Christ our Lord, we pray. Amen."]], "200": [["dateVerse", "Thursday, July 18, 2024", "Psalm 87", "Deuteronomy 28:58-29:21", "Luke 10:1-16"], ["watchD", "The Lord said, “I will protect those who know my name.” Psalm 91:14"], ["docT", "Cast all your anxiety on him, because he cares for you. 1 Peter 5:7"], ["prayer", "Attentive God, your word calls us to place our fears and anxieties before you, that you will hear and already have promised to protect and care for us. By your Spirit, enable us to trust more and more in your abounding grace. In Jesus’ name, we pray. Amen."]], "201": [["dateVerse", "Friday, July 19, 2024", "Psalm 88:1-5", "Deuteronomy 29:22-31:8", "Luke 10:17-24"], ["watchD", "I am about to create new heavens and a new earth; the former things shall not be remembered. Isaiah 65:17"], ["docT", "John wrote: Then I saw a new heaven and a new earth, for the first heaven and the first earth had passed away. Revelation 21:1"], ["prayer", "O renewing God, when we make the effort to pause and put our lives on hold, we are reminded of your promise to make all things new, transforming our world and each of us to be who you hope us to be and what you hope us to do. By your Spirit. Amen."]], "202": [["dateVerse", "Saturday, July 20, 2024", "Psalm 88:6-12", "Deuteronomy 31:9-32:9", "Luke 10:25-42"], ["watchD", "Consider then and realize how evil and bitter it is for you when you forsake the Lord your God and have no awe of me. Jeremiah 2:19 NIV"], ["docT", "When the younger son had spent everything, a severe famine took place throughout that region, and he began to be in need. So he went and hired himself out to one of the citizens of that region, who sent him to his fields to feed the pigs. Luke 15:14-15"], ["prayer", "O waiting God, it is so easy to turn our backs on you, to fall off the right paths, to be seduced into thinking we have all the answers. Relying on your abundant grace, we confess these moments and return to your side to fix our eyes on you. Through the Christ, we pray. Amen."]], "203": [["info", "Nineth Sunday after Pentecost"], ["watchO", "Watchword for the week — So then you are no longer strangers and aliens, but you are citizens with the saints and members of the household of God. Ephesians 2:19"], ["dateVerse", "Sunday, July 21, 2024", "Jeremiah 23:1-6", "Psalm 23", "Ephesians 2:11-22", "Mark 6:30-34,53-56"], ["watchD", "Look! On the mountains the feet of one who brings good tidings, who proclaims peace! Nahum 1:15"], ["docT", "Christ came and proclaimed peace to you who were far off and peace to those who were near. Ephesians 2:17"], ["prayer", "This fervent prayer we offer, Lord God, for peace to prevail in our families, our churches, our communities, and among all peoples of this world. Enable us to be peacemakers in all we think, do, and say, your Spirit being our inspiration. Amen."]], "204": [["dateVerse", "Monday, July 22, 2024", "Psalm 88:13-18", "Deuteronomy 32:10-43", "Luke 11:1-13"], ["watchD", "They will fight against you, but they shall not prevail against you, for I am with you, says the Lord, to deliver you. Jeremiah 1:19"], ["docT", "Jesus prays for his disciples, “I am asking on their behalf; I am not asking on behalf of the world but on behalf of those whom you gave me, because they are yours.” John 17:9"], ["prayer", "O living Word among us, repeatedly you declare that we belong, that each is precious in your sight, that we all are of value. You offer this promise, “I am with you always.” Enable us to let go and trust more fully. In Jesus’ name, we pray. Amen."]], "205": [["dateVerse", "Tuesday, July 23, 2024", "Psalm 89:1-8", "Deuteronomy 32:44-33:17", "Luke 11:14-28"], ["watchD", "Your decrees are my delight; they are my counselors. Psalm 119:24"], ["docT", "Jesus said, “Do not think that I have come to abolish the Law or the Prophets; I have come not to abolish but to fulfill.” Matthew 5:17"], ["prayer", "Forever-building God, still etching your word into our souls, enable us, we ask, to bear evidence to your mercy, patience, grace, and peace among all with whom we come in contact. Help us bear a good witness for racial equality and justice. By the power of the Holy Spirit, we pray. Amen."]], "206": [["dateVerse", "Wednesday, July 24, 2024", "Psalm 89:9-18", "Deuteronomy 33:18-34:12", "Luke 11:29-36"], ["watchD", "The Lord has sent me to comfort all who mourn. Isaiah 61:1,2"], ["docT", "Blessed be the God and Father of our Lord Jesus Christ, the Father of mercies and the God of all consolation, who consoles us in all our affliction, so that we may be able to console those who are in any affliction with the consolation with which we ourselves are consoled by God. 2 Corinthians 1:3-4"], ["prayer", "Listening God, we place before you our cries for mercy and laments, wistful longings, and wavering faith. Though at the end of our rope, we still trust in your promises, opening our entire beings to receive you anew. In Jesus’ name, we pray. Amen."]], "207": [["dateVerse", "Thursday, July 25, 2024", "Psalm 89:19-29", "Joshua 1,2", "Luke 11:37-54"], ["watchD", "God said, “I have set my bow in the clouds, and it shall be a sign of the covenant between me and the earth.” Genesis 9:13"], ["docT", "By the same word the present heavens and earth have been reserved. 2 Peter 3:7"], ["prayer", "O God, always perceptive of our needs, you provide many signs of your power and love. In crystal clear waters tumbling down the rocks, in the support and presence of our faith community, when a voice speaks out to us, “thanks for making a difference,” we are convinced. Amen."]], "208": [["dateVerse", "Friday, July 26, 2024", "Psalm 89:30-37", "Joshua 3,4", "Luke 12:1-12"], ["watchD", "If God tears down, no one can rebuild; if he shuts someone in, no one can open up. Job 12:14"], ["docT", "Jesus said to him, “All things can be done for the one who believes.” Immediately the father of the child cried out, “I believe; help my unbelief!” Mark 9:23-24"], ["prayer", "Great God of restoration, we admit that our notions, opinions, and beliefs have to be broken down in order that we might rebuild and be renewed. Underneath are your everlasting arms to catch and sustain us as we let go, so that we can take hold of the new. Thanks be to you. Amen."]], "209": [["dateVerse", "Saturday, July 27, 2024", "Psalm 89:38-45", "Joshua 5,6", "Luke 12:13-21"], ["watchD", "God will never forget the needy; the hope of the afflicted will never perish. Psalm 9:18 NIV"], ["docT", "Jesus said, “Blessed are you who are poor, for yours is the kingdom of God.” Luke 6:20"], ["prayer", "Merciful God, amidst all the clutter of our days, we need constant reminders that you do not forget us; our hope in you and your promises remains strong. Further remind us that we are never alone, as Jesus has promised us, “I will be with you always.” Amen."]], "210": [["info", "Tenth Sunday after Pentecost"], ["watchO", "Watchword for the week — The Lord is faithful in all his words, and gracious in all his deeds. Psalm 145:13"], ["dateVerse", "Sunday, July 28, 2024", "2 Kings 4:42-44", "Psalm 145:10-18", "Ephesians 3:14-21", "John 6:1-21"], ["watchD", "With the Lord on my side I do not fear. What can mortals do to me? Psalm 118:6"], ["docT", "Who will separate us from the love of Christ? Will affliction or distress or persecution or famine or nakedness or peril or sword? Romans 8:35"], ["prayer", "O Lord, Jesus Christ, when you are at our side, we do not fear anything that mortals can say or do; every evidence demonstrates that absolutely nothing can separate us from you. May our lives clearly and boldly demonstrate this inseparable love. In Jesus’ name, we pray. Amen."]], "211": [["dateVerse", "Monday, July 29, 2024", "Psalm 89:46-52", "Joshua 7", "Luke 12:22-34"], ["watchD", "The Lord our God incline our hearts to him, to walk in all his ways. 1 Kings 8:57,58"], ["docT", "No one can say “Jesus is Lord” except by the Holy Spirit. 1 Corinthians 12:3"], ["prayer", "We pray, wondrous God of all, for refreshing spirit-winds to blow through the musty and stale chambers of our lives, clearing the air and driving out all that separates us from you. Stir us to engage our passions for all that is just, right, pure, and true. Through Christ our Lord, we pray. Amen."]], "212": [["dateVerse", "Tuesday, July 30, 2024", "Psalm 90", "Joshua 8:1-29", "Luke 12:35-48"], ["watchD", "I give water in the wilderness, rivers in the desert, to give drink to my chosen people. Isaiah 43:20"], ["docT", "Jesus said to the woman, “Those who drink of the water that I will give them will never be thirsty. The water that I will give will become in them a spring of water gushing up to eternal life.” John 4:14"], ["prayer", "Great Giver of what is satisfying and good, help us discard the junk foods of this life to take hold of what is life-giving—bread that satisfies, waters that quench thirst, and your light that shines in the darkest places of our being. Fill us, we ask, in your name. Amen."]], "213": [["dateVerse", "Wednesday, July 31, 2024", "Psalm 91:1-8", "Joshua 8:30-9:27", "Luke 12:49-59"], ["watchD", "And you shall know that I am the Lord when I deal with you for my name’s sake, not according to your evil ways or corrupt deeds. Ezekiel 20:44"], ["docT", "God proves his love for us in that while we still were sinners Christ died for us. Romans 5:8"], ["prayer", "Transforming and restoring God, we shout our thanksgiving for meeting us where we are, leading us to become more fully in Christ. Even more, energize us to share the joy of living out precisely those things Jesus called us to do: listening, understanding, forgiving and reconciling. All in Jesus’ name, we pray. Amen."]], "214": [["dateVerse", "Thursday, August 1, 2024", "Psalm 91:9-16", "Joshua 10:1-27", "Luke 13:1-17"], ["watchD", "Truly the day of the Lord is great, terrible indeed—who can endure it? Yet even now, says the Lord, return to me with all your heart. Joel 2:11-12"], ["docT", "Jesus came to Galilee proclaiming the good news of God and saying, “The time is fulfilled, and the kingdom of God has come near; repent, and believe in the good news.” Mark 1:14-15"], ["prayer", "Comforter God, we are deeply grateful for your forgiving and welcoming heart. We trust your presence, your promise, and your pardon. Guide our hearts toward your desires and a life grounded in prayer. Amen."]], "215": [["dateVerse", "Friday, August 2, 2024", "Psalm 92:1-8", "Joshua 10:28-11:23", "Luke 13:18-30"], ["watchD", "God, you have caused the land to quake; you have torn it open; repair the cracks in it, for it is tottering. Psalm 60:2"], ["docT", "And the disciples awoke Jesus and said to him, “Teacher, do you not care that we are perishing?” Then he arose and rebuked the wind, and said to the sea, “Peace, be still!” And the wind ceased and there was a great calm. Mark 4:38-39 NKJV"], ["prayer", "God of peace, the quakes and storms of life can leave us frightened and alone. Help us turn to your calming assurance as we open to the stillness of your peace. We are profoundly grateful for your welcome and love. Amen."]], "216": [["dateVerse", "Saturday, August 3, 2024", "Psalm 92:9-15", "Joshua 12:1-13:7", "Luke 13:31-14:6"], ["watchD", "Those who know your name put their trust in you, for you, O Lord, have not forsaken those who seek you. Psalm 9:10"], ["docT", "Jesus said, “Anyone who comes to me I will never drive away.” John 6:37"], ["prayer", "Trustworthy God, we praise you for your faithfulness. Our hearts know we are always welcome in your loving embrace. You will never forsake us, your beloved children. We are deeply grateful and sing your praises! Amen."]], "217": [["info", "Eleventh Sunday after Pentecost"], ["watchO", "Watchword for the week — Jesus said, “I am the bread of life. Whoever comes to me will never be hungry, and whoever believes in me will never be thirsty.” John 6:35"], ["dateVerse", "Sunday, August 4, 2024", "Exodus 16:2-4,9-15", "Psalm 78:23-29", "Ephesians 4:1-16", "John 6:24-35"], ["watchD", "Whatever the Lord pleases he does, in heaven and on earth, in the seas and all deeps. Psalm 135:6"], ["docT", "Do not lag in zeal; be ardent in spirit; serve the Lord. Romans 12:11"], ["prayer", "Creating God, you invite us to partner with you in loving and caring for our planet Earth. Thank you for entrusting us with this mission. May we serve you zealously, knowing that our contribution, large or small, matters to all of creation and matters to you. Amen."]], "218": [["dateVerse", "Monday, August 5, 2024", "Psalm 93", "Joshua 13:8-14:5", "Luke 14:7-24"], ["watchD", "The Lord will go before you, and the God of Israel will be your rear guard. Isaiah 52:12"], ["docT", "As Jesus was walking along, he saw Levi son of Alphaeus sitting at the tax-collection station, and he said to him, “Follow me.” And he got up and followed him. Mark 2:14"], ["prayer", "God of invitation, it is not always easy to follow you. Strengthen our willingness to trust you, to get up and follow where you lead. As others once shared the good news and invited us to follow, so may we be the ones to share and invite, sharing the news that God indeed gives new life. May we live your love with joy. Amen."]], "219": [["dateVerse", "Tuesday, August 6, 2024", "Psalm 94:1-11", "Joshua 14:6-15:19", "Luke 14:25-35"], ["watchD", "God, on my bed I remember you; I think of you through the watches of the night. Psalm 63:6 NIV"], ["docT", "Jesus Christ died for us, so that whether we are awake or asleep we may live with him. 1 Thessalonians 5:9-10"], ["prayer", "God of light and darkness, we are yours day and night, awake or asleep. May we greet each morning as a precious gift and look forward to the graces of the day, moments when we touch others with your love. May we close the day with confession, gratitude, and hope, trusting always in your presence. Amen."]], "220": [["dateVerse", "Wednesday, August 7, 2024", "Psalm 94:12-23", "Joshua 15:20-63", "Luke 15:1-10"], ["watchD", "The fear of the Lord is instruction in wisdom. Proverbs 15:33"], ["docT", "For since, in the wisdom of God, the world did not know God through wisdom, God decided, through the foolishness of the proclamation, to save those who believe. 1 Corinthians 1:21"], ["prayer", "God of wisdom, some days we forget the wisdom of your teachings, and can easily lose our way. Open our heart, holy one, in faith, hope, and love, that we may help carry out the precious work needed to sustain the needs of the world in wisdom and grace. We trust you to give us exactly what we need to live your wisdom all day, every day. You are Immanuel, God with us. Amen."]], "221": [["dateVerse", "Thursday, August 8, 2024", "Psalm 95", "Joshua 16,17", "Luke 15:11-32"], ["watchD", "The Lord was with Joseph, and whatever he did, the Lord made it prosper. Genesis 39:23"], ["docT", "The fruit of the Spirit is love, joy, peace, patience, kindness, generosity, faithfulness, gentleness, and self-control. Galatians 5:22-23"], ["prayer", "Dear Lord, in this quiet time, we breathe in the suffering of the world. We pause and invite love to transform it as we exhale. We breathe in the joy of the world, pause, and exhale with gratitude. We are aware that your presence is the web that connects each piece of creation. In this quiet time, with each breath, may the fruit of the spirit feed our souls. Amen."]], "222": [["dateVerse", "Friday, August 9, 2024", "Psalm 96:1-9", "Joshua 18:1-19:9", "Luke 16:1-15"], ["watchD", "Deliver those who are drawn toward death, and hold back those stumbling to the slaughter. If you say, “Surely we did not know this,” Does not he who weighs the hearts consider it? Proverbs 24:10-12 NKJV"], ["docT", "If one member suffers, all suffer together with it; if one member is honored, all rejoice together with it. 1 Corinthians 12:26"], ["prayer", "Holy Trinity—Abba, Jesus, and Spirit—you dwell in community. You invite us to imagine that we can do the same—sharing joy, sharing burdens, knowing one another as sister or brother. Your love gives us the strength to live together for the sake of the whole, rather than only for self-centered gain. Teach us to love with heart, soul, and mind. Amen."]], "223": [["dateVerse", "Saturday, August 10, 2024", "Psalm 96:10-13", "Joshua 19:10-39", "Luke 16:16-31"], ["watchD", "I, the Lord, love justice, I hate robbery and wrongdoing. Isaiah 61:8"], ["docT", "No one wrong or exploit a brother or sister in this matter, because the Lord is an avenger in all these things. 1 Thessalonians 4:6"], ["prayer", "Justice-loving God, we forget that we too are tools for justice. Open our hearts to a daily awareness of the decisions we make that may rob or exploit another. Renew our desire to show your love in all that we do. May we love our neighbors in word and deed. Amen."]], "224": [["info", "Twelfth Sunday after Pentecost"], ["watchO", "Watchword for the week — Jesus said, “Very truly, I tell you, whoever believes has eternal life.” John 6:47"], ["dateVerse", "Sunday, August 11, 2024", "1 Kings 19:4-8", "Psalm 34:1-8", "Ephesians 4:25-5:2", "John 6:35,41-51"], ["watchD", "I will manifest my holiness among you in the sight of the nations. You shall know that I am the Lord when I bring you into the land of Israel, the country that I swore to give to your ancestors. Ezekiel 20:41-42"], ["docT", "By faith Abraham obeyed when he was called to set out for a place that he was to receive as an inheritance, and he set out, not knowing where he was going. Hebrews 11:8"], ["prayer", "God of the ages, we recognize and hold the witness of generations before us. May our obedience and trust be a witness to the generations that follow us, that they too will know the story, trust your promises, and live faithfully. Thank you for calling us to be your witnesses. Amen."]], "225": [["dateVerse", "Monday, August 12, 2024", "Psalm 97:1-6", "Joshua 19:40-21:8", "Luke 17:1-10"], ["watchD", "I hope for your salvation, O Lord. Psalm 119:166"], ["docT", "The one who testifies to these things says, “Surely I am coming soon.” Revelation 22:20"], ["prayer", "Blessed Jesus, though you taught that the kingdom of God is here, we sometimes think the kingdom is about some time in the future, after our lives on Earth are complete. If we are not looking for you, we won’t see the way you show up day after day in all that we do, say, plan, and hope. Open our hearts to hear the promise, “I am coming soon,” to be a word for this day. Come quickly! We want to see you, here and now! Amen."]], "226": [["specialVerse", "August Thirteenth Festival", "Joshua 24:16-24", "Psalm 133", "1 John 4:1-13", "John 17:1-2,6-19"], ["dateVerse", "Tuesday, August 13, 2024", "Psalm 97:7-12", "Joshua 21:9-45", "Luke 17:11-19"], ["watchD", "O sing to the Lord a new song; sing to the Lord, all the earth. Psalm 96:1"], ["docT", "The disciples began to praise God saying, “Blessed is the king who comes in the name of the Lord! Peace in heaven, and glory in the highest heaven!” Luke 19:37-38"], ["prayer", "God of new beginnings, on this day, centuries ago, you offered a new tune to our ancestors in the faith in Herrnhut. We confess, we’re not always excited about another new song, another adjustment, another change! So, please, holy one, open our hearts to the new song the Spirit may be inviting today. May singing it help us be it. Amen."]], "227": [["dateVerse", "Wednesday, August 14, 2024", "Psalm 98", "Joshua 22", "Luke 17:20-25"], ["watchD", "The Lord your God knows your going through this great wilderness. Deuteronomy 2:7"], ["docT", "Therefore lift your drooping hands and strengthen your weak knees. Hebrews 12:12"], ["prayer", "Accompanying God, the wilderness is often scary to us. We know you, too, have spent time there. Show us how to welcome what our wilderness has to teach us, to strengthen us, to help us prepare for your mission. Then, we will know how to accompany others when they are in the midst of their wilderness time themselves. In Jesus’ name, we pray. Amen."]], "228": [["dateVerse", "Thursday, August 15, 2024", "Psalm 99", "Joshua 23:1-24:13", "Luke 17:26-37"], ["watchD", "I am the Lord your God who brought you out of the land of Egypt, to be their slaves no more; I have broken the bars of your yoke and made you walk erect. Leviticus 26:13"], ["docT", "I do not call you servants any longer, because the servant does not know what the master is doing, but I have called you friends. John 15:15"], ["prayer", "Friend Jesus! What a grace! What an honor you freely give! You encourage us to grow in awareness and action, seeking freedom from enslavement for ourselves and all your children. It is what friends do. Give us the courage to be your friend, and a friend to all we meet along the way. Amen."]], "229": [["dateVerse", "Friday, August 16, 2024", "Psalm 100", "Joshua 24:14-Judges 1:16", "Luke 18:1-17"], ["watchD", "Honor your father and your mother. Exodus 20:12"], ["docT", "Welcome one another, therefore, just as Christ has welcomed you, for the glory of God. Romans 15:7"], ["prayer", "Christ of welcoming and open arms, in fear, we often cross our arms tightly across our vulnerable hearts, keeping out those we name “Other.” May our desire be to imitate your cruciform invitation, arms open wide, risking all for the sake of welcoming all. Fulfill this desire in us, please! Amen."]], "230": [["dateVerse", "Saturday, August 17, 2024", "Psalm 101", "Judges 1:17-2:23", "Luke 18:18-30"], ["watchD", "David prayed, “For your word’s sake, and according to your own heart, you have done all these great things.” 2 Samuel 7:21 NKJV"], ["docT", "If you belong to Christ, then you are Abraham’s offspring, heirs according to the promise. Galatians 3:29"], ["prayer", "Promise Maker, you speak and we inhale your life-giving words. We belong to you! We wonder at that remarkable promise. May the world see our faith, love and hope, so that all people may inhale the life of our promise maker God. Amen."]], "231": [["info", "Thirteenth Sunday after Pentecost"], ["watchO", "Watchword for the week — Lay aside immaturity, and live, and walk in the way of insight. Proverbs 9:6"], ["dateVerse", "Sunday, August 18, 2024", "Proverbs 9:1-6", "Psalm 34:9-14", "Ephesians 5:15-20", "John 6:51-58"], ["watchD", "You have made humans a little lower than God and crowned them with glory and honor. Psalm 8:5"], ["docT", "His divine power has given us everything needed for life and godliness, through the knowledge of him who called us by his own glory and excellence. 2 Peter 1:3"], ["prayer", "Holy, beloved Lord, in the beginning you breathed life into us, sharing your very own breath. You give life to body and soul. Each day you continue to give, inviting us to share each gift for the sake of the life of the world. With joy and gratitude, we praise you. To you, O God, all praise and glory. Amen."]], "232": [["dateVerse", "Monday, August 19, 2024", "Psalm 102:1-11", "Judges 3", "Luke 18:31-43"], ["watchD", "Refrain from anger and forsake wrath. Do not fret—it leads only to evil. Psalm 37:8"], ["docT", "See that none of you repays evil for evil, but always seek to do good to one another and to all. 1 Thessalonians 5:15"], ["prayer", "Healer of all ills, it is hard for us to love fully and freely each day. Heal within us that which is afraid, jealous, or lonely. May we be open to receive your love each and every day, and then live that love in such a way that healing can come to earth and all her creatures. May your love flow through us into the world, for the sake of the world. Amen."]], "233": [["dateVerse", "Tuesday, August 20, 2024", "Psalm 102:12-22", "Judges 4", "Luke 19:1-10"], ["watchD", "Abraham’s servant remained silent so as to know whether the Lord had made his journey prosperous or not. Genesis 24:21 NKJV"], ["docT", "While they were worshiping the Lord and fasting, the Holy Spirit said, “Set apart for me Barnabas and Saul for the work to which I have called them.” Then after fasting and praying they laid their hands on them and sent them off. Acts 13:2-3"], ["prayer", "We so easily forget, Lord Jesus, to be still and quiet. We forget daily practices of prayer and fasting, singing and moving. Thus, we are often unable to hear you when you speak to our hearts. Our desire, beloved, is to listen, to share, to make room for you. Today, we set aside time to be only with you. Fill our hearts with the power of silence. Amen."]], "234": [["dateVerse", "Wednesday, August 21, 2024", "Psalm 102:23-28", "Judges 5", "Luke 19:11-27"], ["watchD", "Let us lift up our hearts as well as our hands to God in heaven. Lamentations 3:41"], ["docT", "Are any among you suffering? They should pray. Are any cheerful? They should sing songs of praise. James 5:13"], ["prayer", "Creator of community, we gratefully and easily reach out to one another in joy and in suffering. It is so comforting to know we are not alone. We pray, we sing, we extend care to and for one another. When we lift our hearts and hands to you, may we remember to extend our hearts and hands to those around us, and remember that love is our web of life. In that love, we praise you and give you thanks. Amen."]], "235": [["dateVerse", "Thursday, August 22, 2024", "Psalm 103:1-5", "Judges 6", "Luke 19:28-44"], ["watchD", "Thus says the Lord, “If you turn back, I will take you back.” Jeremiah 15:19"], ["docT", "Jesus said, “Everyone, therefore, who acknowledges me before others, I also will acknowledge before my Father in heaven.” Matthew 10:32"], ["prayer", "Beloved and holy God of all, your gracious gifts touch our hearts with wonder, amazement, and joy! We are most especially grateful that you long for us as much as we long for you. Thank you for your forgiving, healing, and welcoming heart. Amen."]], "236": [["dateVerse", "Friday, August 23, 2024", "Psalm 103:6-18", "Judges 7", "Luke 19:45-20:8"], ["watchD", "When I thought, “My foot is slipping,” your steadfast love, O Lord, held me up. Psalm 94:18"], ["docT", "My grace is sufficient for you, for power is made perfect in weakness. 2 Corinthians 12:9"], ["prayer", "Loving God, we can feel your love around us, ready to catch, comfort, cajole, or cry—whatever we need in the moment. We long to notice your presence, and your gifts more fully, day after day, night after night, and to acknowledge your grace is our home. Amen."]], "237": [["dateVerse", "Saturday, August 24, 2024", "Psalm 103:19-22", "Judges 8", "Luke 20:9-19"], ["watchD", "See, I have taken your guilt away from you, and I will clothe you with festal apparel. Zechariah 3:4"], ["docT", "The father said to his slaves, ‘Quickly, bring out a robe—the best one—and put it on him; for this son of mine was dead and is alive again; he was lost and is found!’ Luke 15:22,24"], ["prayer", "We smile, divine Tailor, at the wonder of your handiwork. You have been clothing your children since you walked the coolness of the night in the Garden of Eden. You clothe us in faith, love, and hope. And behold, we are radiant—as are all your sons and daughters—ready for the banquet feast. In gladness, we rejoice! Thank you. In Jesus’ name, we pray. Amen."]], "238": [["info", "Fourteenth Sunday after Pentecost"], ["watchO", "Watchword for the week — Jesus said, “The words that I have spoken to you are spirit and life.” John 6:63"], ["dateVerse", "Sunday, August 25, 2024", "Joshua 24:1-2a,14-18", "Psalm 34:15-22", "Ephesians 6:10-20", "John 6:56-69"], ["watchD", "Lord, I thank you that you have answered me and have become my salvation. Psalm 118:21"], ["docT", "This is right and acceptable before God our Savior, who desires everyone to be saved and to come to the knowledge of the truth. 1 Timothy 2:3-4"], ["prayer", "God who is the giver of blessings, you offer wholeness for a broken world; you offer well-being to each and every person; you offer the holy work of sharing your good news through all we say and do. May we receive what you offer in gratitude and awe. May we then share what you so freely give, so others will know the truth of your salvation, your healing. Amen. "]], "239": [["dateVerse", "Monday, August 26, 2024", "Psalm 104:1-9", "Judges 9:1-33", "Luke 20:20-26"], ["watchD", "For you have delivered my soul from death and my feet from falling, so that I may walk before God in the light of life. Psalm 56:13"], ["docT", "Taking her by the hand, Jesus said to her, “Talitha koum,” which means, “Little girl, get up!” And immediately the girl stood up and began to walk about. Mark 5:41-42"], ["prayer", "We confess, O God of light and life, trust is hard for us. We easily turn to the foolishness of trusting ourselves, our gifts, our plans, and forget that all of it, all of it, is from you. In this moment, we return to you our hearts and will and being. Free us from seeing only ourselves; free us to live life through and in you. Amen."]], "240": [["dateVerse", "Tuesday, August 27, 2024", "Psalm 104:10-18", "Judges 9:34-10:18", "Luke 20:27-40"], ["watchD", "The precepts of the Lord are right, rejoicing the heart. Psalm 19:8"], ["docT", "Jesus said, “Blessed are those who hear the word of God and keep it!” Luke 11:28 NKJV"], ["prayer", "Dear Lord, stir my heart; stir my soul. Stir all my senses, and gently fold in your grace, your love, your word. Then, we who offer this prayer, will fill the world with your teachings. Then, our hearts shall rejoice; then, our love for you will deepen; then, your desires will be our choice. In Jesus’ name, we pray. Amen."]], "241": [["dateVerse", "Wednesday, August 28, 2024", "Psalm 104:19-23", "Judges 11:1-27", "Luke 20:41-21:4"], ["watchD", "Now set your mind and heart to seek the Lord your God. 1 Chronicles 22:19"], ["docT", "Philip found Nathanael and said to him, “We have found him about whom Moses in the Law and also the Prophets wrote, Jesus son of Joseph from Nazareth.” John 1:45"], ["prayer", "Creator of the universe, holy womb of life, “seek” and “find” seem strange words to describe our desire for you. You are always here; wherever we are, there you are. Open our hearts to see this truth when we feel lost, abandoned, or forlorn. To find you, we have only to open the eyes of our hearts. In Jesus’ name, we pray. Amen."]], "242": [["dateVerse", "Thursday, August 29, 2024", "Psalm 104:24-30", "Judges 11:28-12:15", "Luke 21:5-28"], ["watchD", "Who provides for the raven its prey, when its young ones cry to God and wander about for lack of food? Job 38:41"], ["docT", "So neither the one who plants nor the one who waters is anything, but only God who gives the growth. 1 Corinthians 3:7"], ["prayer", "We’re pondering you, Beloved, as gracious gardener— tilling, planting, tending, harvesting—all to feed us and all of creation. The earth is your garden; our hearts are your garden. May we, together, bear the fruit of healing, wholeness, life, light, and love. Thank you, gardening God, for your love and trust. Amen."]], "243": [["dateVerse", "Friday, August 30, 2024", "Psalm 104:31-35", "Judges 13", "Luke 21:29-38"], ["watchD", "The counsel of the Lord stands forever. Psalm 33:11"], ["docT", "In Christ we have also obtained an inheritance, having been destined according to the purpose of him who accomplishes all things according to his counsel and will. Ephesians 1:11"], ["prayer", "Sometimes, Counselor of wisdom and grace, we sing or speak words as if they are truth, as if they are already the reality of our lives. In fact, they are often more truly our hopes, our desires. We repeat these words as our prayer: “Be the treasure of great worth in our lives, first in our hearts.” This is our longing. We open our hearts to you. In Jesus’ name, we pray. Amen."]], "244": [["dateVerse", "Saturday, August 31, 2024", "Psalm 105:1-7", "Judges 14,15", "Luke 22:1-13"], ["watchD", "They shall be mine, says the Lord of hosts, my special possession on the day when I act, and I will spare them as parents spare their children who serve them. Malachi 3:17"], ["docT", "Blessed are the peacemakers, for they will be called children of God. Matthew 5:9"], ["prayer", "We end this month, loving God, with the reminder that we are your children, children of the one and only God! You bless us, bringing us into this world at this time to be peacemakers, to create shalom. With your nurture and guidance, may it be so! May we be your instruments of peace on the planet. In Jesus’ name, we pray. Amen."]], "245": [["info", "Fifteenth Sunday after Pentecost"], ["watchO", "Watchword for the week — Let everyone be quick to listen, slow to speak, slow to anger. James 1:19"], ["dateVerse", "Sunday, September 1, 2024", "Deuteronomy 4:1-2,6-9", "Psalm 15", "James 1:17-27", "Mark 7:1-8,14-15,21-23"], ["watchD", "Lord, you have been our dwelling place in all generations. Before the mountains were brought forth or ever you had formed the earth and the world, from everlasting to everlasting you are God. Psalm 90:1-2"], ["docT", "Jesus said to his disciples, “Have faith in God.” Mark 11:22"], ["prayer", "God, all that we see, feel, and touch was created by you. May this be a reminder of your love for us and may our faith continue to grow stronger. Thank you for your blessings. Amen. "]], "246": [["dateVerse", "Monday, September 2, 2024", "Psalm 105:8-15", "Judges 16,17", "Luke 22:14-23"], ["watchD", "The Lord heals the brokenhearted and binds up their wounds. Psalm 147:3"], ["docT", "By his wounds you have been healed. 1 Peter 2:24"], ["prayer", "When we turn to you with our pain, O God, you heal our wounds. May we remember and be thankful for this healing and praise you for making us whole. Amen."]], "247": [["dateVerse", "Tuesday, September 3, 2024", "Psalm 105:16-22", "Judges 18", "Luke 22:24-38"], ["watchD", "You hem me in, behind and before, and lay your hand upon me. Psalm 139:5"], ["docT", "Paul said to the Areopagus: “Indeed God is not far from each one of us. For ‘In him we live and move and have our being.’” Acts 17:27-28"], ["prayer", "Gracious Father, as we move along our daily lives, you are not far. May we feel your everlasting presence in all that we do, so that we know we are not alone. We pray this in your holy name. Amen."]], "248": [["dateVerse", "Wednesday, September 4, 2024", "Psalm 105:23-36", "Judges 19", "Luke 22:39-51"], ["watchD", "An angel touched Elijah and said to him, “Get up and eat.” He got up and ate and drank; then he went in the strength of that food forty days and forty nights to Horeb the mount of God. 1 Kings 19:5,8"], ["docT", "Therefore do not worry, saying, ‘What will we eat?’ or ‘What will we drink?’ or ‘What will we wear?’ Matthew 6:31"], ["prayer", "God, in times when we fear we don't have enough, may we remember that you will provide food when we are hungry and clothing when we are in need, just as you did for Elijah. Amen."]], "249": [["dateVerse", "Thursday, September 5, 2024", "Psalm 105:37-45", "Judges 20:1-31", "Luke 22:52-62"], ["watchD", "O save your people and bless your heritage; be their shepherd and carry them forever. Psalm 28:9"], ["docT", "When Jesus saw the crowds, he had compassion for them because they were harassed and helpless, like sheep without a shepherd. Matthew 9:36"], ["prayer", "Gracious God, you are the shepherd and we are your sheep. Please lead us into peaceful settings. Amen."]], "250": [["dateVerse", "Friday, September 6, 2024", "Psalm 106:1-5", "Judges 20:32-21:25", "Luke 22:63-71"], ["watchD", "We do not present our supplication before you on the ground of our righteousness but on the ground of your great mercies. Daniel 9:18"], ["docT", "By grace you have been saved through faith, and this is not your own doing; it is the gift of God—not the result of works, so that no one may boast. Ephesians 2:8-9"], ["prayer", "Gracious Lord, we may fail sometimes, but we find comfort in your great mercy. Help us to live lives that are pleasing to you, for we are redeemed by your grace. We pray this in your holy name. Amen."]], "251": [["dateVerse", "Saturday, September 7, 2024", "Psalm 106:6-12", "Ruth 1", "Luke 23:1-12"], ["watchD", "The Lord said to Solomon, “Ask what I should give you.” And Solomon said, “Give your servant, therefore, an understanding mind to govern your people, able to discern between good and evil.” 1 Kings 3:5,6,9"], ["docT", "The devil took Jesus to a very high mountain and showed him all the kingdoms of the world and their glory, and he said to him, “All these I will give you, if you will fall down and worship me.” Then Jesus said to him, “Away with you, Satan!” Matthew 4:8-10"], ["prayer", "Grant us the courage to always do right by you and others, dear God. We run into situations in our daily lives where we have to choose between right and wrong. We look to you to guide us; help us make the right choices. Amen."]], "252": [["info", "Sixteenth Sunday after Pentecost"], ["watchO", "Watchword for the week — I will praise the Lord as long as I live; I will sing praises to my God all my life long. Psalm 146:2"], ["dateVerse", "Sunday, September 8, 2024", "Isaiah 35:4-7a", "Psalm 146", "James 2:1-10,(11-13),14-17", "Mark 7:24-37"], ["watchD", "Teach me good judgment and knowledge, for I believe in your commandments. Psalm 119:66"], ["docT", "Paul wrote to Timothy: Have nothing to do with stupid and senseless controversies; you know that they breed quarrels. 2 Timothy 2:23"], ["prayer", "God, we were taught through the Ten Commandments to make good judgements. In all that we do, may we always remember that you are with us and will help us do right by you. Amen."]], "253": [["dateVerse", "Monday, September 9, 2024", "Psalm 106:13-23", "Ruth 2,3", "Luke 23:13-31"], ["watchD", "Happy are those who make the Lord their trust. Psalm 40:4"], ["docT", "Andrew first found his brother Simon and said to him, “We have found the Messiah.” John 1:41"], ["prayer", "God, those who have faith find the happiness in life you have provided. Please help us guide others to find that same happiness. Amen. "]], "254": [["dateVerse", "Tuesday, September 10, 2024", "Psalm 106:24-31", "Ruth 4", "Luke 23:32-43"], ["watchD", "Praise the Lord! I will give thanks to the Lord with my whole heart, in the company of the upright, in the congregation. Psalm 111:1"], ["docT", "Praise our God, all you his servants and all who fear him, small and great. Revelation 19:5"], ["prayer", "Lord, you gave us your whole heart. May we remember this and give thanks to you for all the days of our lives. We, your thankful servants, pray this in Jesus’ name. Amen. "]], "255": [["dateVerse", "Wednesday, September 11, 2024", "Psalm 106:32-39", "1 Samuel 1:1-2:11", "Luke 23:44-56"], ["watchD", "Create in me a clean heart, O God, and put a new and right spirit within me. Psalm 51:10"], ["docT", "The aim of such instruction is love that comes from a pure heart, a good conscience, and sincere faith. 1 Timothy 1:5"], ["prayer", "God, please guide us to follow your faith in our daily routines. Create in us a clean heart and watch over us as we make better choices in how we live, love, and follow you. Amen."]], "256": [["dateVerse", "Thursday, September 12, 2024", "Psalm 106:40-48", "1 Samuel 2:12-36", "Luke 24:1-12"], ["watchD", "Maintain the right of the lowly and the destitute. Psalm 82:3"], ["docT", "May the Lord make you increase and abound in love for one another and for all. 1 Thessalonians 3:12"], ["prayer", "God, we know you are the defender of the weak and those in need. Lead us not to do them injustice but to share your love with them. As you provide for us, may we be good stewards and provide for those in need as well. Amen. "]], "257": [["dateVerse", "Friday, September 13, 2024", "Psalm 107:1-9", "1 Samuel 3,4", "Luke 24:13-27"], ["watchD", "Wondrously show your steadfast love, O savior of those who seek refuge from their adversaries at your right hand. Psalm 17:7"], ["docT", "If you are reviled for the name of Christ, you are blessed, because the spirit of glory, which is the Spirit of God, is resting on you. 1 Peter 4:14"], ["prayer", "Gracious Father, we are truly blessed by your steadfast love which you show us in all aspects of life. May our lives demonstrate your love to the world as we thank you for all your blessings. Amen."]], "258": [["dateVerse", "Saturday, September 14, 2024", "Psalm 107:10-16", "1 Samuel 5:1-7:1", "Luke 24:28-35"], ["watchD", "When the cares of my heart are many, your consolations cheer my soul. Psalm 94:19"], ["docT", "Jesus said, “Father, if you are willing, remove this cup from me, yet not my will but yours be done.” Then an angel from heaven appeared to him and gave him strength. Luke 22:42-43"], ["prayer", "God, when our days are tiresome, please reveal your presence and give us the patience to move on. When our days are filled with joy, continue to sing your songs from heaven above to cheer us. Amen."]], "259": [["info", "Seventeenth Sunday after Pentecost"], ["watchO", "Watchword for the week — Jesus asked, “But who do you say that I am?” Mark 8:29"], ["dateVerse", "Sunday, September 15, 2024", "Isaiah 50:4-9a", "Psalm 116:1-9", "James 3:1-12", "Mark 8:27-38"], ["watchD", "When you have eaten your fill, take care that you do not forget the Lord. Deuteronomy 6:11-12"], ["docT", "Jesus said, “Very truly, I tell you, it was not Moses who gave you the bread from heaven, but it is my Father who gives you the true bread from heaven.” John 6:32"], ["prayer", "Glorious God, thank you for giving us your one and only son. We will not hunger or thirst, for our lives are satisfied with knowing Jesus as our “Bread of Life.” May we forever give you thanks when we sit down to have a meal. Amen."]], "260": [["info", "Minister’s Covenant Day†"], ["dateVerse", "Monday, September 16, 2024", "Psalm 107:17-22", "1 Samuel 7:2-8:22", "Luke 24:36-53"], ["watchD", "The Lord God helps me; therefore I have not been disgraced. Isaiah 50:7"], ["docT", "When Peter noticed the strong wind, he became frightened, and, beginning to sink, he cried out, “Lord, save me!” Matthew 14:30"], ["prayer", "Dear God, we know you are here and will carry us through the storms as well as the celebrations of life. Help us to strive to live our lives with the same grace you have given us. Amen. "]], "261": [["dateVerse", "Tuesday, September 17, 2024", "Psalm 107:23-32", "1 Samuel 9", "John 1:1-13"], ["watchD", "You crown the year with your bounty. Psalm 65:11"], ["docT", "God has shown kindness by giving you rain from heaven and crops in their seasons; he provides you with plenty of food and fills your hearts with joy. Acts 14:17 NIV"], ["prayer", "Gracious God, you have given so much, providing us fertile fields, sunshine, and rain to grow our food. Through your bounty, may we share what has been given to us so freely to those in need. May we always remember to care for others. Amen."]], "262": [["dateVerse", "Wednesday, September 18, 2024", "Psalm 107:33-43", "1 Samuel 10", "John 1:14-28"], ["watchD", "A star shall come out of Jacob, and a scepter shall rise out of Israel. Numbers 24:17"], ["docT", "It is I, Jesus, who sent my angel to you with this testimony for the churches. I am the root and the descendant of David, the bright morning star. Revelation 22:16"], ["prayer", "God, you have led us when we were lost. Please lead those of us who have strayed from you; help us find you and your love once again. May your guidance lead us to love you more. Amen."]], "263": [["dateVerse", "Thursday, September 19, 2024", "Psalm 108:1-5", "1 Samuel 11,12", "John 1:29-42"], ["watchD", "Do not enter into judgment with your servant, for no one living is righteous before you. Psalm 143:2"], ["docT", "Jesus said to the woman, “Your sins are forgiven. Your faith has saved you; go in peace.” Luke 7:48,50"], ["prayer", "Gracious God, today we live among people of diverse backgrounds and social statuses. Yet in our world, so many do not live by your example. We pray for change, peace, and forgiveness. In Jesus’ name, we pray. Amen."]], "264": [["dateVerse", "Friday, September 20, 2024", "Psalm 108:6-13", "1 Samuel 13", "John 1:43-51"], ["watchD", "God alone stretches out the heavens and treads on the waves of the sea. He is the Maker of the Bear and Orion, the Pleiades and the constellations of the south. Job 9:8-9 NIV"], ["docT", "For us there is one God, the Father, from whom are all things and for whom we exist, and one Lord, Jesus Christ, through whom are all things and through whom we exist. 1 Corinthians 8:6"], ["prayer", "Glorious God, we rejoice in the great things and the wonderful life you have created for us. You created life, and the resources and knowledge to sustain that life. May we always remember we are loved by you. Thank you. Amen."]], "265": [["dateVerse", "Saturday, September 21, 2024", "Psalm 109:1-7", "1 Samuel 14:1-40", "John 2:1-11"], ["watchD", "A glad heart makes a cheerful countenance, but by sorrow of heart the spirit is broken. Proverbs 15:13"], ["docT", "He went on his way rejoicing. Acts 8:39"], ["prayer", "Lord, when we rejoice, we feel the strength you have given us, even in times of sorrow. Your blessings overflow within our lives. May we rejoice and be glad today! Amen."]], "266": [["info", "Eighteenth Sunday after Pentecost"], ["watchO", "Watchword for the week — Jesus said, “Whoever wants to be first must be last of all and servant of all.” Mark 9:35"], ["dateVerse", "Sunday, September 22, 2024", "Jeremiah 11:18-20", "Psalm 54", "James 3:13-4:3,7-8a", "Mark 9:30-37"], ["watchD", "He shall be the one of peace. Micah 5:5"], ["docT", "Do not repay evil with evil or insult with insult. On the contrary, repay evil with blessing, because to this you were called so that you may inherit a blessing. 1 Peter 3:9 NIV"], ["prayer", "God, often in life, we want to protect ourselves by using the same evil that was used against us. We need to stop and think about what we are doing. Help us to bless those who have caused harm to us, and instead, offer your love. Amen."]], "267": [["dateVerse", "Monday, September 23, 2024", "Psalm 109:8-20", "1 Samuel 14:41-15:23", "John 2:12-25"], ["watchD", "The Lord has made known his salvation; his righteousness he has revealed in the sight of the nations. Psalm 98:2 NKJV"], ["docT", "Blessed are those who hunger and thirst for righteousness, for they will be filled. Matthew 5:6"], ["prayer", "Lord, we give you thanks for the blessings of your salvation. Help us to share your saving grace with those who hope and thirst for righteousness. Amen."]], "268": [["dateVerse", "Tuesday, September 24, 2024", "Psalm 109:21-31", "1 Samuel 15:24-16:13", "John 3:1-15"], ["watchD", "For as the earth brings forth its shoots and as a garden causes what is sown in it to spring up, so the Lord God will cause righteousness and praise to spring up before all the nations. Isaiah 61:11"], ["docT", "The kingdom of God is like a mustard seed that someone took and sowed in the garden; it grew and became a tree, and the birds of the air made nests in its branches. Luke 13:18-19"], ["prayer", "God, we, like your gardens, constantly grow in our love and faith. Please continue to nurture us so that our mustard seed faith may grow into a tree of love for the world. Amen. "]], "269": [["dateVerse", "Wednesday, September 25, 2024", "Psalm 110", "1 Samuel 16:14-17:31", "John 3:16-26"], ["watchD", "See, I am the Lord, the God of all flesh; is anything too hard for me? Jeremiah 32:27"], ["docT", "When the disciples saw Jesus, they worshiped him; but some doubted. Then Jesus came to them and said, “All authority in heaven and on earth has been given to me.” Matthew 28:17-18 "], ["prayer", "Glorious God, the strength you have shown makes us want to sing praises in your honor. Help us rise up and have strength to push through the difficulties that arise in our lives. May we continue to sing, Alleluia! Amen."]], "270": [["dateVerse", "Thursday, September 26, 2024", "Psalm 111", "1 Samuel 17:32-58", "John 3:27-36"], ["watchD", "I delight to do your will, O my God; your law is within my heart. Psalm 40:8"], ["docT", "Jesus said to the expert in the law, “‘You shall love the Lord your God with all your heart and with all your soul and with all your mind.’ This is the greatest and first commandment. And a second is like it: ‘You shall love your neighbor as yourself.’” Matthew 22:37-39"], ["prayer", "Glorious God, you have shown your great strength and love. May we share your love with others. Help us strive to live by grace as you and your son have done for us. Amen."]], "271": [["dateVerse", "Friday, September 27, 2024", "Psalm 112", "1 Samuel 18:1-19:7", "John 4:1-26"], ["watchD", "Be glad and rejoice forever in what I am creating. Isaiah 65:18"], ["docT", "Everything created by God is good, and nothing is to be rejected, provided it is received with thanksgiving, for it is sanctified by God’s word and by prayer. 1 Timothy 4:4-5"], ["prayer", "God, you have created the world as a beautiful stage upon which to live our lives. We are forever grateful for your creation of fields, waterways, and creatures. We have no need to want for more. Thank you for these perfect gifts. Amen."]], "272": [["dateVerse", "Saturday, September 28, 2024", "Psalm 113", "1 Samuel 19:8-20:17", "John 4:27-38"], ["watchD", "Let the words of my mouth and the meditation of my heart be acceptable to you, O Lord, my rock and my redeemer. Psalm 19:14"], ["docT", "Mary treasured all these words and pondered them in her heart. Luke 2:19"], ["prayer", "Lord, help us have the self-control to think before we speak, so that the words exiting our mouths are pure and respectable, not only to those we are speaking to, but to you also. Guide us and keep us in your ways. Amen."]], "273": [["info", "Nineteenth Sunday after Pentecost"], ["watchO", "Watchword for the week — The precepts of the Lord are right, rejoicing the heart; the commandment of the Lord is clear, enlightening the eyes. Psalm 19:8"], ["dateVerse", "Sunday, September 29, 2024", "Numbers 11:4-6,10-16,24-29", "Psalm 19:7-14", "James 5:13-20", "Mark 9:38-50"], ["watchD", "You shall love the alien as yourself. Leviticus 19:34"], ["docT", "There is no longer Greek and Jew, circumcised and uncircumcised, barbarian, Scythian, enslaved and free, but Christ is all and in all! Colossians 3:11"], ["prayer", "Glorious God, help us remember the teachings of the Ten Commandments. We need guidance in loving our families, our neighbors, and the leaders of our nations. Give us that guidance to love others as you love all peoples. Amen.  "]], "274": [["dateVerse", "Monday, September 30, 2024", "Psalm 114", "1 Samuel 20:18-21:9", "John 4:39-42"], ["watchD", "Abner called to Joab, “Is the sword to keep devouring forever? Do you not know that the end will be bitter?” 2 Samuel 2:26"], ["docT", "Jesus said, “Put your sword back into its place, for all who take the sword will die by the sword.” Matthew 26:52"], ["prayer", "God, in these unsettling times we pray for peace among our families, neighbors, communities, and nations. Open our hearts to understand the other side of issues and have more compassion for those who live differently from us or have different opinions than ours. Amen."]], "275": [["dateVerse", "Tuesday, October 1, 2024", "Psalm 115:1-8", "1 Samuel 21:10-22:23", "John 4:43-54"], ["watchD", "I will extol you, O Lord, among the nations and sing praises to your name. Psalm 18:49"], ["docT", "Lord, who will not fear and glorify your name? For you alone are holy. Revelation 15:4 "], ["prayer", "Lord, our strength, we walk among your creation, marveling at your power and grace. We praise you, this day, for you are the rock and foundation of all that is holy in this world. Amen."]], "276": [["dateVerse", "Wednesday, October 2, 2024", "Psalm 115:9-18", "1 Samuel 23", "John 5:1-15"], ["watchD", "They shall neither hunger nor thirst, neither heat nor sun shall strike them; for he who has mercy on them will lead them, even by the springs of water he will guide them. Isaiah 49:10 NKJV"], ["docT", "Sir, give me this water, so that I may never be thirsty or have to keep coming here to draw water. John 4:15"], ["prayer", "Holy Spirit, we seek your living water. You quench our thirst when the well runs dry. Help us to share your grace with those we encounter today. Amen."]], "277": [["dateVerse", "Thursday, October 3, 2024", "Psalm 116:1-7", "1 Samuel 24:1-25:17", "John 5:16-30"], ["watchD", "The Lord confirms the word of his servant and fulfills the prediction of his messengers; who says of Jerusalem, “It shall be inhabited,” and of the cities of Judah, “They shall be rebuilt.” Isaiah 44:26"], ["docT", "So we have the prophetic message more fully confirmed. You will do well to be attentive to this as to a lamp shining in a dark place, until the day dawns and the morning star rises in your hearts. 2 Peter 1:19"], ["prayer", "Heavenly Father, you are the lamp in the dead of night and the sun revealing a new morning. Your message brings hope and direction; help us follow you. Amen."]], "278": [["dateVerse", "Friday, October 4, 2024", "Psalm 116:8-14", "1 Samuel 25:18-44", "John 5:31-47"], ["watchD", "My eyes fail with watching for your promise; I ask, “When will you comfort me?” Psalm 119:82"], ["docT", "Let us therefore approach the throne of grace with boldness, so that we may receive mercy and find grace to help in time of need. Hebrews 4:16"], ["prayer", "There are times, Lord, when we do not see you. Our expectations fail to meet the abundant life you have waiting for us. It is on us to open our hearts to your mercy so that we may live into your grace. Help us share your love. Amen."]], "279": [["dateVerse", "Saturday, October 5, 2024", "Psalm 116:15-19", "1 Samuel 26,27", "John 6:1-15"], ["watchD", "Do not spurn us, for your name’s sake; do not dishonor your glorious throne. Jeremiah 14:21"], ["docT", "God has not rejected his people whom he foreknew. Romans 11:2"], ["prayer", "God, be near to us today. Our lives may be messy, and our faith may stumble, but you never fail to call us your own. This grace, bountiful yet not deserved, is why we praise you each day. Amen."]], "280": [["info", "Twentieth Sunday after Pentecost"], ["watchO", "Watchword for the week — I will proclaim your name to my brothers and sisters, in the midst of the congregation I will praise you. Hebrews 2:12"], ["dateVerse", "Sunday, October 6, 2024", "Genesis 2:18-24", "Psalm 8", "Hebrews 1:1-4,2:5-12", "Mark 10:2-16"], ["watchD", "Even the nations are like a drop from a bucket and are accounted as dust on the scales. Isaiah 40:15"], ["docT", "Is God the God of Jews only? Is he not the God of gentiles also? Yes, of gentiles also. Romans 3:29"], ["prayer", "God of all, your glorious creation is a gift. We pledge to care for all you have laid out before us. From the smallest insects to the great trees of the forest, like us, they are yours. Most of all, we will work to care for the people of the Earth in the ways you have taught us. Help us to care for others with the love that comes from you. Amen. "]], "281": [["dateVerse", "Monday, October 7, 2024", "Psalm 117", "1 Samuel 28,29", "John 6:16-24"], ["watchD", "Although our iniquities testify against us, act, O Lord, for your name’s sake. Jeremiah 14:7"], ["docT", "If you forgive others their trespasses, your heavenly Father will also forgive you. Matthew 6:14"], ["prayer", "Holy Redeemer, we are an imperfect people, yet your forgiveness is unending. Help us to follow your path, giving grace to those who have broken our trust. In Jesus’ name, we pray. Amen."]], "282": [["dateVerse", "Tuesday, October 8, 2024", "Psalm 118:1-9", "1 Samuel 30,31", "John 6:25-42"], ["watchD", "Now, therefore, revere the Lord and serve him in sincerity and in faithfulness; put away the gods and serve the Lord. Joshua 24:14"], ["docT", "Formerly, when you did not know God, you were enslaved to beings that by nature are not gods. Now, however, that you have come to know God, or rather to be known by God, how can you turn back again to the weak and beggarly elemental principles? How can you want to be enslaved to them again? Galatians 4:8-9"], ["prayer", "God, our leader, we stand ready to serve you. We turn away from the things that distract us or frighten us, and impede your mission. May our hearts be focused on you alone. Amen. "]], "283": [["dateVerse", "Wednesday, October 9, 2024", "Psalm 118:10-14", "2 Samuel 1", "John 6:43-51"], ["watchD", "Your hands have made and fashioned me; give me understanding that I may learn your commandments. Psalm 119:73"], ["docT", "Paul wrote: So then, stand firm and hold fast to the teachings we passed on to you. 2 Thessalonians 2:15 NIV"], ["prayer", "Teacher, open our hearts to your teachings so that we may be your disciples. Your lessons bring us comfort and hope; for this, we are grateful. Give us the courage to share your lessons with the world. Amen. "]], "284": [["dateVerse", "Thursday, October 10, 2024", "Psalm 118:15-21", "2 Samuel 2", "John 6:52-59"], ["watchD", "“They say, ‘Our bones are dried up, and our hope is lost; we are cut off completely.’ Therefore prophesy and say to them: Thus says the Lord God: I am going to open your graves and bring you up from your graves, O my people.” Ezekiel 37:11-12"], ["docT", "So it is with the resurrection of the dead. What is sown is perishable; what is raised is imperishable. It is sown a physical body; it is raised a spiritual body. 1 Corinthians 15:42,44"], ["prayer", "Holy Spirit, you take away the fear of death. With you, there is hope in a tomorrow, even when our physical bodies no longer carry our being. You bring victory over death; what joy we have in you! Thank you. Amen."]], "285": [["dateVerse", "Friday, October 11, 2024", "Psalm 118:22-29", "2 Samuel 3:1-34", "John 6:60-71"], ["watchD", "There is forgiveness with you, so that you may be revered. Psalm 130:4"], ["docT", "Jesus said, “Father, forgive them, for they do not know what they are doing.” Luke 23:34"], ["prayer", "God, we are an imperfect people. We too often misstep and fail to follow your way. We ask forgiveness for all that we do that is not pleasing to you. Have mercy on us. In Jesus’ name, we pray. Amen."]], "286": [["dateVerse", "Saturday, October 12, 2024", "Psalm 119:1-8", "2 Samuel 3:35-5:16", "John 7:1-13"], ["watchD", "Moses said to Aaron, “This is what the Lord said, ‘Through those who are near me will show myself holy, and before all the people I will be glorified.’” Leviticus 10:3"], ["docT", "Therefore, since we are justified by faith, we have peace with God through our Lord Jesus Christ. Romans 5:1"], ["prayer", "Most glorious God, you show up in our lives when we need you the most. You are beside us throughout our days. We find peace in your presence. Glory be to you, our Savior! Amen."]], "287": [["info", "Twenty-first Sunday after Pentecost"], ["watchO", "Watchword for the week — Since we have a great high priest who has passed through the heavens, Jesus, the Son of God, let us hold fast to our confession. Hebrews 4:14"], ["dateVerse", "Sunday, October 13, 2024", "Amos 5:6-7,10-15", "Psalm 90:12-17", "Hebrews 4:12-16", "Mark 10:17-31"], ["watchD", "Joseph said to his brothers, “Even though you intended to do harm to me, God intended it for good.” Genesis 50:20"], ["docT", "Bless those who curse you; pray for those who mistreat you. Luke 6:28"], ["prayer", "Lord, help us to be better neighbors. Your commandment says that we should forgive those who act against us, but we often fail to do so. Help us let go of our judgement and vengeance, and to love our neighbors in the way you intend. Amen."]], "288": [["dateVerse", "Monday, October 14, 2024", "Psalm 119:9-16", "2 Samuel 5:17-6:23", "John 7:14-24"], ["watchD", "Let everything that breathes praise the Lord! Praise the Lord! Psalm 150:6"], ["docT", "To the only God our Savior, through Jesus Christ our Lord, be glory, majesty, power, and authority, before all time and now and forever. Jude 25"], ["prayer", "Today, we rise in joy and acclamation, most glorious Savior! We praise you from start to finish, carrying our adoration to all the places we go. May all that we do be pleasing to you. Amen."]], "289": [["dateVerse", "Tuesday, October 15, 2024", "Psalm 119:17-24", "2 Samuel 7", "John 7:25-44"], ["watchD", "The God of heaven is the one who will give us success, and we his servants are going to start building. Nehemiah 2:20"], ["docT", "Now may our Lord Jesus Christ himself and God our Father, who loved us and through grace gave us eternal comfort and good hope, comfort your hearts and strengthen them in every good work and word. 2 Thessalonians 2:16-17"], ["prayer", "Creator and strength, our work is your work. You give us the strength and the tools to labor in your name. Even when our strength seems to run out, you raise us up in hope. Be with us again today. In Jesus’ name, we pray. Amen."]], "290": [["dateVerse", "Wednesday, October 16, 2024", "Psalm 119:25-32", "2 Samuel 8,9", "John 7:45-52"], ["watchD", "Better is a dinner of vegetables where love is than a fatted ox and hatred with it. Proverbs 15:17"], ["docT", "Jesus also saw a poor widow put in two small copper coins. He said, “Truly I tell you, this poor widow has put in more than all of them, for all of them have contributed out of their abundance, but she out of her poverty has put in all she had to live on.” Luke 21:2-4"], ["prayer", "Holy Spirit, draw us closer to one another. Heaven is a place full of love and healing. It is up to us to bring Heaven to Earth, flooding our spaces with a deep love. Help us in this task. Amen."]], "291": [["dateVerse", "Thursday, October 17, 2024", "Psalm 119:33-40", "2 Samuel 10,11", "John 8:1-11"], ["watchD", "Because the Lord your God is a merciful God, he will neither abandon you nor destroy you. Deuteronomy 4:31"], ["docT", "And this is the boldness we have in him, that if we ask anything according to his will, he hears us. 1 John 5:14"], ["prayer", "God of all strength, we need you. Whether broken or wandering, you stick with us in our times of need. What a friend we have in you, gracious God. All praise to you. Amen."]], "292": [["dateVerse", "Friday, October 18, 2024", "Psalm 119:41-48", "2 Samuel 12", "John 8:12-30"], ["watchD", "He was despised and rejected by others; a man of suffering and acquainted with infirmity. Isaiah 53:3"], ["docT", "The Son of Man will be handed over to the gentiles, and he will be mocked and insulted and spat upon. After they have flogged him, they will kill him, and on the third day he will rise again. Luke 18:32-33"], ["prayer", "Father God, what love you have for the world. The sacrifice Jesus made so that we may be redeemed and live, is a gift beyond imagination. How can we put into words our humble thanks? Lord, we live for you! Amen."]], "293": [["dateVerse", "Saturday, October 19, 2024", "Psalm 119:49-56", "2 Samuel 13:1-33", "John 8:31-41"], ["watchD", "Even when I am old and gray, do not forsake me, my God, till I declare your power to the next generation, your mighty acts to all who are to come. Psalm 71:18 NIV"], ["docT", "There was also a prophet, Anna a widow of the age of eighty-four. She never left the temple but worshiped there with fasting and prayer night and day. At that moment she came and began to praise God and to speak about the child to all who were looking for the redemption of Jerusalem. Luke 2:36,37-38"], ["prayer", "Teacher, you are with us all of our days. What joy it brings to share your good news with those who we encounter. The love that binds us to you is the same love we would share with all generations. Thank you for this joyous task! In your name, we pray. Amen."]], "294": [["info", "Twenty-second Sunday after Pentecost"], ["watchO", "Watchword for the week — For the Son of Man came not to be served but to serve, and to give his life a ransom for many. Mark 10:45"], ["dateVerse", "Sunday, October 20, 2024", "Isaiah 53:4-12", "Psalm 91:9-16", "Hebrews 5:1-10", "Mark 10:35-45"], ["watchD", "The Lord said to Jeremiah, “Now I have put my words in your mouth.” Jeremiah 1:9"], ["docT", "Paul wrote: I came to you in weakness and in fear and in much trembling. My speech and my proclamation were made not with persuasive words of wisdom but with a demonstration of the Spirit and of power, so that your faith might rest not on human wisdom but on the power of God. 1 Corinthians 2:3-5"], ["prayer", "Holy Spirit, move within us to be beacons of your word. Inspire us to use not only our words, but our actions, to be examples of your love. Help us bring your light to the world. In Jesus’ name, we pray. Amen."]], "295": [["dateVerse", "Monday, October 21, 2024", "Psalm 119:57-64", "2 Samuel 13:34-14:33", "John 8:42-59"], ["watchD", "This people I have formed for myself; they shall declare my praise. Isaiah 43:21 NKJV"], ["docT", "Christ, however, was faithful over God’s house as a son, and we are his house if we hold firm the boldness and the pride inspired by hope. Hebrews 3:6"], ["prayer", "God of hope, let the day ahead be filled with our praises. You have given us a purpose in life and established our path. May our praises ring out as we seek to serve you today. Amen."]], "296": [["dateVerse", "Tuesday, October 22, 2024", "Psalm 119:65-72", "2 Samuel 15:1-29", "John 9:1-12"], ["watchD", "You are my witnesses, says the Lord. Isaiah 43:10"], ["docT", "Jesus said, “You will receive power when the Holy Spirit has come upon you, and you will be my witnesses in Jerusalem, in all Judea and Samaria, and to the ends of the earth.” Acts 1:8"], ["prayer", "Lord, you are the vine, and we are the branches. You ask us to carry your message and share it with those we encounter. At times, the mission is arduous, but your grace and our faith in you is constant. Be with us. Amen. "]], "297": [["dateVerse", "Wednesday, October 23, 2024", "Psalm 119:73-80", "2 Samuel 15:30-16:23", "John 9:13-34"], ["watchD", "Do not cast me off in the time of old age; do not forsake me when my strength is spent. Psalm 71:9"], ["docT", "Jesus said to Peter, “Very truly, I tell you, when you were younger, you used to fasten your own belt and to go wherever you wished. But when you grow old, you will stretch out your hands, and someone else will fasten a belt around you.” John 21:18"], ["prayer", "Faithful God, be near us throughout our lives. While our physical bodies may age, may our spirit and faith in you never fade. Amen."]], "298": [["dateVerse", "Thursday, October 24, 2024", "Psalm 119:81-88", "2 Samuel 17", "John 9:35-41"], ["watchD", "With you is the fountain of life; in your light we see light. Psalm 36:9"], ["docT", "In him was life, and the life was the light of all people. John 1:4"], ["prayer", "Light of the world, help us follow you. You are our guide, and your path is one of goodness. Our choice is simple, and our choice is you. Amen."]], "299": [["dateVerse", "Friday, October 25, 2024", "Psalm 119:89-96", "2 Samuel 18:1-30", "John 10:1-10"], ["watchD", "Keep hold of instruction; do not let go; guard her, for she is your life. Proverbs 4:13"], ["docT", "But as for you, continue in what you have learned and firmly believed, knowing from whom you learned it and how from childhood you have known sacred writings that are able to instruct you for salvation through faith in Christ Jesus. 2 Timothy 3:14-15"], ["prayer", "Father, your advice is like a map guiding us through an unknown place. We hold tight to it and rely on it at every turn. We rejoice and praise you because we know your map leads us where we need to go. Thank you. Amen."]], "300": [["dateVerse", "Saturday, October 26, 2024", "Psalm 119:97-104", "2 Samuel 18:31-19:30", "John 10:11-21"], ["watchD", "The Lord is my shepherd; I shall not want. Psalm 23:1"], ["docT", "Jesus said, “I am the good shepherd. The good shepherd lays down his life for the sheep.” John 10:11"], ["prayer", "Great Shepherd, we are so fortunate to be your sheep. You have provided more than we can possibly imagine. You surround us with your grace, and we remain by your side. We thank and praise you. In your name, we pray. Amen."]], "301": [["info", "Twenty-third Sunday after Pentecost"], ["watchO", "Watchword for the week — The Lord has done great things for us. Psalm 126:3"], ["dateVerse", "Sunday, October 27, 2024", "Jeremiah 31:7-9", "Psalm 126", "Hebrews 7:23-28", "Mark 10:46-52"], ["watchD", "Hear, O Israel: The Lord is our God, the Lord alone. Deuteronomy 6:4"], ["docT", "There are varieties of activities, but it is the same God who activates all of them in everyone. 1 Corinthians 12:6"], ["prayer", "Great “I Am”, as humans, we too often bicker and debate over how to worship you. Our experiences and preferences can get in the way of our focus on you. Rid us of these distractions and focus our attention on your mission every moment of the day. In Jesus’ name, we pray. Amen."]], "302": [["dateVerse", "Monday, October 28, 2024", "Psalm 119:105-112", "2 Samuel 19:31-20:26", "John 10:22-33"], ["watchD", "You do not give me up to Sheol. Psalm 16:10"], ["docT", "Jesus said to Martha, “I am the resurrection and the life. Those who believe in me, even though they die, will live, and everyone who lives and believes in me will never die. Do you believe this?” John 11:25-26"], ["prayer", "Lord Protector, you bring life from death. With wounds healed and tears dried, our faith in you endures. Thank you. In Jesus’ name, we pray. Amen."]], "303": [["dateVerse", "Tuesday, October 29, 2024", "Psalm 119:113-120", "2 Samuel 21", "John 10:34-42"], ["watchD", "The Lord gives wisdom; from his mouth come knowledge and understanding. Proverbs 2:6"], ["docT", "Jesus said, “I thank you, Father, Lord of heaven and earth, because you have hidden these things from the wise and the intelligent and have revealed them to infants.” Matthew 11:25"], ["prayer", "Lord of all wisdom, we give you thanks for this day. May we use the gifts which you have given to bring light to others. Amen."]], "304": [["dateVerse", "Wednesday, October 30, 2024", "Psalm 119:121-128", "2 Samuel 22:1-25", "John 11:1-16"], ["watchD", "The Lord will open for you his rich storehouse, the heavens, to give the rain of your land in its season and to bless all your undertakings. Deuteronomy 28:12"], ["docT", "Therefore, my beloved brothers and sisters, be steadfast, immovable, always excelling in the work of the Lord because you know that in the Lord your labor is not in vain. 1 Corinthians 15:58"], ["prayer", "Giver of all, your grace abounds. We serve you in faith and hope, sharing with others the love for which we are filled. We give you thanks. Amen."]], "305": [["dateVerse", "Thursday, October 31, 2024", "Psalm 119:129-136", "2 Samuel 22:26-23:17", "John 11:17-30"], ["watchD", "Some take pride in chariots and some in horses, but our pride is in the name of the Lord our God. Psalm 20:7"], ["docT", "There is salvation in no one else, for there is no other name under heaven given among mortals by which we must be saved. Acts 4:12"], ["prayer", "God our cornerstone, your power brings salvation to the world. It is your will by which we live, and your name that we praise. Amen."]], "306": [["info", "All Saints Day"], ["watchO", "Watchword for All Saints Day — Salvation belongs to our God who is seated on the throne, and to the Lamb! Revelation 7:10"], ["specialVerse", "All Saints Day", "Isaiah 25:6-9", "Psalm 24", "Revelation 21:1-6a", "John 11:32-44"], ["dateVerse", "Friday, November 1, 2024", "Psalm 119:137-144", "2 Samuel 23:18-24:25", "John 11:31-44"], ["watchD", "I will heal their disloyalty; I will love them freely. Hosea 14:4"], ["docT", "And do not lead us into temptation, but deliver us from the evil one. Matthew 6:13 NKJV"], ["prayer", "Our Father, who art in heaven, we thank you for all your saints, and we thank you for those whom we have been blessed to know. Help us to put our trust and confidence in you, heavenly Father, just as all your saints have done before. May our lives be strengthened from their godly example. To you, we give all the glory. Amen."]], "307": [["dateVerse", "Saturday, November 2, 2024", "Psalm 119:145-152", "1 Kings 1:1-27", "John 11:45-57"], ["watchD", "The Lord rewards everyone for his righteousness and his faithfulness. 1 Samuel 26:23"], ["docT", "Paul wrote: Do not pronounce judgment before the time, before the Lord comes, who will bring to light the things now hidden in darkness and will disclose the purposes of the heart. Then each one will receive commendation from God. 1 Corinthians 4:5"], ["prayer", "Righteous God, we ask for strength to serve you righteously and faithfully. Help us to follow your guidance to live godly lives, and to look forward to standing before you, having lived a life that is pleasing to you. Amen."]], "308": [["info", "Twenty-fourth Sunday after Pentecost"], ["watchO", "Watchword for the week — Hear, O Israel: The Lord is our God, the Lord alone. You shall love the Lord your God with all your heart, and with all your soul, and with all your might. Deuteronomy 6:4,5"], ["dateVerse", "Sunday, November 3, 2024", "Deuteronomy 6:1-9", "Psalm 119:1-8", "Hebrews 9:11-14", "Mark 12:28-34"], ["watchD", "If riches increase, do not set your heart on them. Psalm 62:10"], ["docT", "The rich are to do good, to be rich in good works, generous, and ready to share. 1 Timothy 6:18"], ["prayer", "Lord, you are a generous God who has given us your very best, through your son, Jesus Christ. Let us not set our hearts on earthly treasures, but on heavenly ones. You have made us spiritually rich in Christ, now help us to be rich in good works and in helping one another. Amen."]], "309": [["dateVerse", "Monday, November 4, 2024", "Psalm 119:153-160", "1 Kings 1:28-53", "John 12:1-11"], ["watchD", "Hear, you peoples, all of you; listen, O earth, and all that is in it, and let the Lord God be a witness against you. Micah 1:2"], ["docT", "Do not be deceived; God is not mocked, for you reap whatever you sow. Galatians 6:7"], ["prayer", "Lord God, help us listen for your voice today and every day. Do not let us follow the paths that lead us away from you, but let us follow your ways, Lord. Help us to grow more like Christ, and may our lives produce fruit that pleases you. Amen."]], "310": [["dateVerse", "Tuesday, November 5, 2024", "Psalm 119:161-168", "1 Kings 2:1-38", "John 12:12-19"], ["watchD", "I will remove the heart of stone from their flesh and give them a heart of flesh, so that they may follow my statutes and keep my ordinances and obey them. Ezekiel 11:19-20"], ["docT", "Jesus was asked when the kingdom of God was coming. He answered, “For, in fact, the kingdom of God is among you.” Luke 17:20,21"], ["prayer", "Gracious Lord, give us a loving heart like Christ’s and help us to obey your word. Let us rejoice that your presence is always with us and may we lead others to become part of your wonderful kingdom. Amen."]], "311": [["dateVerse", "Wednesday, November 6, 2024", "Psalm 119:169-176", "1 Kings 2:39-3:28", "John 12:20-36"], ["watchD", "Happy are those who live in your house, ever singing your praise. Psalm 84:4"], ["docT", "Likewise the Spirit helps us in our weakness, for we do not know how to pray as we ought, but that very Spirit intercedes with groanings too deep for words. Romans 8:26"], ["prayer", "Spirit of God, how happy we are that you dwell within us, and that we belong to you. We give you praise that you always hear our prayers; help us in all our weaknesses, teach us how to pray as we should, and intercede on our behalf. Praise the Lord! Amen."]], "312": [["dateVerse", "Thursday, November 7, 2024", "Psalm 120", "1 Kings 4:1-28", "John 12:37-50"], ["watchD", "Help us, O Lord our God, for we rely on you. 2 Chronicles 14:11"], ["docT", "Let us hold fast to the confession of our hope without wavering, for God who has promised is faithful. Hebrews 10:23"], ["prayer", "Help us, Lord our God, to rely only on you and to trust in your promises. Let us be faithful to our confession of hope, which is the Lord Jesus Christ. He is our only hope, and our faith stands on him. Other hopes may disappoint us, but Christ never will. In Christ Jesus, we pray. Amen."]], "313": [["dateVerse", "Friday, November 8, 2024", "Psalm 121", "1 Kings 4:29-5:18", "John 13:1-17"], ["watchD", "It is I, announcing vindication, mighty to save. Isaiah 63:1"], ["docT", "Are you envious because I am generous? So the last will be first. Matthew 20:15-16"], ["prayer", "Mighty God, you have delivered us with your salvation and there should be nothing that we fear. We thank you for all that you have done for us, for being generous, and for giving us your very best. Through Christ, we have all become one and members of your fold. In Jesus’ name, we pray. Amen."]], "314": [["dateVerse", "Saturday, November 9, 2024", "Psalm 122", "1 Kings 6", "John 13:18-30"], ["watchD", "Bless the Lord, all his works, in all places of his dominion. Bless the Lord, O my soul. Psalm 103:22"], ["docT", "He destined us for adoption as his children through Jesus Christ, according to the good pleasure of his will, to the praise of his glorious grace that he freely bestowed on us in the Beloved. Ephesians 1:5-6"], ["prayer", "We praise you, O Lord, for all the great things you have done. Through your grace, and through your son, Jesus Christ, we become your children. We give you glory, Lord, for all the great things that you have done in our lives. Help us to be children who are pleasing to you and bring glory to your name. Amen."]], "315": [["info", "Twenty-fifth Sunday after Pentecost"], ["watchO", "Watchword for the week — The Lord lifts up those who are bowed down; the Lord loves the righteous. Psalm 146:8"], ["dateVerse", "Sunday, November 10, 2024", "1 Kings 17:8-16", "Psalm 146", "Hebrews 9:24-28", "Mark 12:38-44"], ["watchD", "My whole being shall exult in my God, for he has clothed me with the garments of salvation; he has covered me with the robe of righteousness. Isaiah 61:10"], ["docT", "The fruit of the light is found in all that is good and right and true. Ephesians 5:9"], ["prayer", "Righteous God, we give you thanks for your love and your salvation, through your son, Jesus Christ. You have clothed us in the righteousness and love of Christ. Let the light of Jesus shine in everything that we do in life, for your glory. Amen."]], "316": [["dateVerse", "Monday, November 11, 2024", "Psalm 123", "1 Kings 7:1-33", "John 13:31-38"], ["watchD", "The Israelites will return and seek the Lord their God. They will come trembling to the Lord and to his blessings in the last days. Hosea 3:5 NIV"], ["docT", "For everyone who asks receives, and everyone who searches finds, and for everyone who knocks, the door will be opened. Matthew 7:8"], ["prayer", "Lord our God, help us to seek you today and every day, and to remember that you always hear our prayers. You invite us to ask and to knock, and you will open your door to give us all that we need. Thank you for your love, goodness, and kindness. In Jesus’ name, we pray. Amen."]], "317": [["dateVerse", "Tuesday, November 12, 2024", "Psalm 124", "1 Kings 7:34-8:16", "John 14:1-14"], ["watchD", "In quietness and in trust shall be your strength. Isaiah 30:15"], ["docT", "The kingdom of God depends not on talk but on power. 1 Corinthians 4:20"], ["prayer", "Almighty God, we place our trust in your power and strength to guide us today. You are always with us and give us hope and strength. We rejoice that your kingdom depends on your power, and it will never fail. Again, our hearts rejoice! Amen."]], "318": [["info", "Chief Elder Festival"], ["specialVerse", "Chief Elder Festival†", "Ezekiel 34:11-16,23-24", "Psalm 8", "Hebrews 4:14-16", "John 10:1-10"], ["dateVerse", "Wednesday, November 13, 2024", "Psalm 125", "1 Kings 8:17-53", "John 14:15-24"], ["watchD", "The bows of the mighty are broken, but the feeble gird on strength. 1 Samuel 2:4"], ["docT", "Therefore I am content with weaknesses, insults, hardships, persecutions, and calamities for the sake of Christ, for whenever I am weak, then I am strong. 2 Corinthians 12:10"], ["prayer", "Jesus Christ, you are our Chief Elder, the head of your church, and the head of our lives. Help us to stand up for you with the strength that you alone can give us. Help us to be strong in our faith as a testimony for you! In your name, we pray. Amen."], ["info", "† On this day in 1741, it was announced in all Moravian congregations that Jesus Christ had been chosen Chief Elder of the Moravian Church. The Moravian Church has had no single human chief executive since then, and now observes this as a festival day."]], "319": [["dateVerse", "Thursday, November 14, 2024", "Psalm 126", "1 Kings 8:54-9:19", "John 14:25-15:8"], ["watchD", "Heaven and the heaven of heavens belong to the Lord your God, the earth with all that is in it. Deuteronomy 10:14"], ["docT", "Glory to God in the highest heaven, and on earth peace among those whom he favors! Luke 2:14"], ["prayer", "Creator God, we praise you for your awesome creation; the heavens and the earth all belong to you. You have given us life and our lives belong to you. You have given us your peace and we pray for your peace upon this earth. All glory be to you, God. Amen."]], "320": [["dateVerse", "Friday, November 15, 2024", "Psalm 127", "1 Kings 9:20-10:29", "John 15:9-17"], ["watchD", "You saw how the Lord your God carried you, just as one carries a child, all the way that you traveled. Deuteronomy 1:31"], ["docT", "Then the disciples told what had happened on the road and how Jesus had been made known to them in the breaking of the bread. Luke 24:35"], ["prayer", "Risen Savior, thank you for coming to us and walking with us as we travel down the road of life. You are always with us to guide us, to teach us, and to restore us when we are discouraged. In your name, we pray. Amen."]], "321": [["dateVerse", "Saturday, November 16, 2024", "Psalm 128", "1 Kings 11:1-25", "John 15:18-16:4"], ["watchD", "And this city shall be to me a name of joy, a praise, and a glory before all the nations of the earth who shall hear of all the good that I do for them. Jeremiah 33:9"], ["docT", "The crowds that went ahead of him and that followed were shouting, “Hosanna to the Son of David! Blessed is the one who comes in the name of the Lord! Hosanna in the highest heaven!” Matthew 21:9"], ["prayer", "Lord Jesus Christ, we praise your name for coming to us and for all that you have done. Let our lives be a living testimony of your love, your goodness, and your salvation. We praise your name. Hosanna! Blessed is the Lord Jesus Christ, who has come in the name of the Lord. Amen."]], "322": [["info", "Twenty-sixth Sunday after Pentecost"], ["watchO", "Watchword for the week — Let us hold fast to the confession of our hope without wavering, for God who has promised is faithful. Hebrew 10:23"], ["dateVerse", "Sunday, November 17, 2024", "Daniel 12:1-3", "Psalm 16", "Hebrews 10:11-14,(15-18),19-25", "Mark 13:1-8"], ["watchD", "For surely I know the plans I have for you, says the Lord, plans for your welfare and not for harm, to give you a future with hope. Jeremiah 29:11"], ["docT", "The creation itself will be set free from its enslavement to decay and will obtain the freedom of the glory of the children of God. Romans 8:21"], ["prayer", "God of hope, all our hope and all our plans are in your hands. We pray for your will in our lives; help us to bring glory to your name as your children. We look forward to that day when all creation will be made new and we, as your children, will dwell with you forever. Amen."]], "323": [["dateVerse", "Monday, November 18, 2024", "Psalm 129", "1 Kings 11:26-12:24", "John 16:5-16"], ["watchD", "I will be glad and exult in you; I will sing praise to your name, O Most High. Psalm 9:2"], ["docT", "Rejoice in the Lord always; again I will say, rejoice. Philippians 4:4"], ["prayer", "We sing praise to you, Lord Jesus Christ, our king! Our joy comes from you, Lord. Help us to rejoice in your name, today and every day. We rejoice in you, Lord Jesus Christ, and again, we rejoice in you! In your name, we pray. Amen."]], "324": [["dateVerse", "Tuesday, November 19, 2024", "Psalm 130", "1 Kings 12:25-13:22", "John 16:17-33"], ["watchD", "We have escaped like a bird from the snare of the hunters; the snare is broken, and we have escaped. Psalm 124:7"], ["docT", "They had come to hear Jesus and to be healed of their diseases, and those who were troubled with unclean spirits were cured. Luke 6:18"], ["prayer", "Lord, you are our great helper in the time of need. You are the one who delivers us from the difficulties of this life and leads us forward. We come to you always knowing that you hear us, that you care for us, and will help us. In your precious name, we pray. Amen."]], "325": [["dateVerse", "Wednesday, November 20, 2024", "Psalm 131", "1 Kings 13:23-14:20", "John 17:1-19"], ["watchD", "The Lord is gracious and merciful, slow to anger, abounding in steadfast love, and relenting from punishment. Joel 2:13"], ["docT", "The gardener said to the owner of the vineyard, “Sir, let it alone for one more year, until I dig around it and put manure on it. If it bears fruit next year, well and good, but if not, you can cut it down.” Luke 13:8-9"], ["prayer", "Gracious Lord, you are gracious and merciful to us and slow to anger. Your love for us never changes and you desire your best for us. Help us to be like you: slow to anger, gracious, merciful, and abounding in love. In your name, we pray. Amen."]], "326": [["dateVerse", "Thursday, November 21, 2024", "Psalm 132", "1 Kings 14:21-15:8", "John 17:20-26"], ["watchD", "Who walks in darkness and has no light? Let him trust in the name of the Lord. Isaiah 50:10 NKJV"], ["docT", "The darkness is passing away and the true light is already shining. 1 John 2:8"], ["prayer", "Jesus, you are the light of the world that casts out the darkness. You light the way that you would have us travel in our lives. We pray that your light will shine through us and draw people to you, Lord. In your name, we pray. Amen."]], "327": [["dateVerse", "Friday, November 22, 2024", "Psalm 133", "1 Kings 15:9-16:14", "John 18:1-11"], ["watchD", "Teach me your way, O Lord, that I may walk in your truth. Psalm 86:11"], ["docT", "You will know the truth, and the truth will make you free. John 8:32"], ["prayer", "Jesus, you are the great teacher who teaches us your truth and the way that we should walk. You are the way, the truth, and the life, and the only one who can lead us safely home. Teach us your way and help us to be more like you, Lord. In your name, we pray. Amen."]], "328": [["dateVerse", "Saturday, November 23, 2024", "Psalm 134", "1 Kings 16:15-17:24", "John 18:12-24"], ["watchD", "No one shall be found among you who practices divination, or is a soothsayer, or an augur, or a sorcerer. For whoever does these things is abhorrent to the Lord. Deuteronomy 18:10,12"], ["docT", "Sober up, as you rightly ought to, and sin no more, for some people have no knowledge of God. I say this to your shame. 1 Corinthians 15:34"], ["prayer", "God, help us to honor your word and to follow your righteous way. We know that our sins are forgiven through Jesus Christ, but we need your help to live holy and righteous lives. Let our lives be a testimony to Christ, so that others will come to know you, God. Amen."]], "329": [["info", "Reign of Christ Sunday"], ["watchO", "Watchword for the week — “I am the Alpha and the Omega,” said the Lord God, who is and who was and who is to come, the Almighty. Revelation 1:8"], ["dateVerse", "Sunday, November 24, 2024", "Daniel 7:9-10,13-14", "Psalm 93", "Revelation 1:4b-8", "John 18:33-37"], ["watchD", "O my people, what have I done to you? In what have I wearied you? Answer me! Micah 6:3"], ["docT", "Or do you despise the riches of his kindness and forbearance and patience? Do you not realize that God’s kindness is meant to lead you to repentance? Romans 2:4"], ["prayer", "God, we pray for you to rule over our lives. We give thanks to you for caring for us in sending your son, Jesus Christ. Your kindness and patience have led us to repentance and to our Savior. Teach us to show your kindness and patience to those around us. In Jesus Christ, we pray. Amen."]], "330": [["dateVerse", "Monday, November 25, 2024", "Psalm 135:1-12", "1 Kings 18", "John 18:25-40"], ["watchD", "Have you not brought this upon yourself by forsaking the Lord your God, while he led you in the way? Jeremiah 2:17"], ["docT", "For you were called to freedom, brothers and sisters, only do not use your freedom as an opportunity for self-indulgence, but through love become enslaved to one another. Galatians 5:13"], ["prayer", "Lord, our God, lead us to follow the way of Jesus and not the ways of the world that lead away from you. With your great love and forgiveness, encourage each of us to love and serve one another as we would serve Christ. In his name, we pray. Amen."]], "331": [["dateVerse", "Tuesday, November 26, 2024", "Psalm 135:13-21", "1 Kings 19", "John 19:1-11"], ["watchD", "Truly, you are a God who hides himself, O God of Israel, the Savior. Isaiah 45:15"], ["docT", "This grace was given to me to bring to the gentiles the news of the boundless riches of Christ and to make everyone see what is the plan of the mystery hidden for ages in God, who created all things. Ephesians 3:8-9"], ["prayer", "Almighty God, there may be times when it seems like you have hidden yourself from us, but we know that you are always there for us. You are our Savior, and we praise you for your amazing grace through your son, Jesus Christ. You have made us new creations in Christ, and we praise your great name. Amen."]], "332": [["dateVerse", "Wednesday, November 27, 2024", "Psalm 136", "1 Kings 20:1-21", "John 19:12-24"], ["watchD", "O Lord, may you ordain peace for us, for indeed, all that we have done, you have done for us. Isaiah 26:12"], ["docT", "Paul wrote: Finally, brothers and sisters, rejoice! Strive for full restoration, encourage one another, be of one mind, live in peace. And the God of love and peace will be with you. 2 Corinthians 13:11 NIV"], ["prayer", "Lord, you have restored us and given us your peace through your son, Jesus Christ. We rejoice that your love and peace dwell within us, and we pray that we will be united by having the mind of Jesus Christ. Amen."]], "333": [["dateVerse", "Thursday, November 28, 2024", "Psalm 137", "1 Kings 20:22-21:16", "John 19:25-37"], ["watchD", "You shall be called priests of the Lord; you shall be named ministers of our God. Isaiah 61:6"], ["docT", "Think of us in this way: as servants of Christ and stewards of God’s mysteries. 1 Corinthians 4:1"], ["prayer", "Loving God, we praise you for the new life that you have given us and the service you have called each of us to do. We are so blessed to be your chosen people, to be your servants, and to be your stewards. We pray that we will be faithful. In your name, we pray. Amen."]], "334": [["dateVerse", "Friday, November 29, 2024", "Psalm 138:1-5", "1 Kings 21:17-22:28", "John 19:38-20:9"], ["watchD", "I delight in the way of your decrees as much as in all riches. Psalm 119:14"], ["docT", "Jesus said, “If you keep my commandments, you will abide in my love, just as I have kept my Father’s commandments and abide in his love. I have said these things to you so that my joy may be in you and that your joy may be complete.” John 15:10-11"], ["prayer", "Loving Lord, we delight in your word, and we give you thanks for your coming into the world. Abide in our hearts with love and joy, and may we share you with others. May our lives be truly complete through you, Jesus. In your name, we pray. Amen."]], "335": [["dateVerse", "Saturday, November 30, 2024", "Psalm 138:6-8", "1 Kings 22:29-53", "John 20:10-23"], ["watchD", "You shall love the Lord your God with all your heart and with all your soul and with all your might. Deuteronomy 6:5"], ["docT", "Love does no wrong to a neighbor; therefore, love is the fulfilling of the law. Romans 13:10"], ["prayer", "God, you first loved us and helped us to truly love you with all our heart, soul, and might. May we be thankful for the love you have shown to us and the love you have given, by truly loving each other. In your name, we pray. Amen."]], "336": [["info", "First Sunday of Advent"], ["watchO", "Watchword for the week — Jesus said, “Heaven and earth will pass away, but my words will not pass away.” Luke 21:33"], ["dateVerse", "Sunday, December 1, 2024", "Jeremiah 33:14-16", "Psalm 25:1-10", "1 Thessalonians 3:9-13", "Luke 21:25-36"], ["watchD", "O that my ways may be steadfast in keeping your statutes! Psalm 119:5"], ["docT", "John said, “Repent, for the kingdom of heaven has come near.” Matthew 3:2"], ["prayer", "Gracious Savior, with wonder and great anticipation, we consider your birth once again. May our hopes be placed firmly on you; may we hear the Baptist’s call to change our ways, to welcome you here. Amen."]], "337": [["dateVerse", "Monday, December 2, 2024", "Psalm 139:1-6", "2 Kings 1:1-2:18", "John 20:24-31"], ["watchD", "Trust in the Lord forever, for in the Lord God you have an everlasting rock. Isaiah 26:4"], ["docT", "Jesus said, “I will show you what someone is like who comes to me, hears my words, and acts on them. That one is like a man building a house who dug deeply and laid the foundation on rock.” Luke 6:47-48"], ["prayer", "Loving God, too often we seek stability in the shallow imperfections of this world. When they inevitably fail, we come running to you. Center our lives on your strength; with you we will not falter. Amen."]], "338": [["dateVerse", "Tuesday, December 3, 2024", "Psalm 139:7-12", "2 Kings 2:19-3:27", "John 21:1-14"], ["watchD", "Samuel said to Saul, “The Spirit of the Lord will come powerfully upon you; and you will be changed into a different person.” 1 Samuel 10:6 NIV"], ["docT", "It is that very Spirit bearing witness with our spirit that we are children of God. Romans 8:16"], ["prayer", "Life-giving Spirit, your breath flows through us—sometimes as a gentle breeze, and other times like an overwhelming wind. Open our eyes to the direction you are leading. Refresh our lives this day. In Jesus’ name, we pray. Amen."]], "339": [["dateVerse", "Wednesday, December 4, 2024", "Psalm 139:13-16", "2 Kings 4:1-37", "John 21:15-25"], ["watchD", "Oh, that you had heeded my commandments! Then your peace would have been like a river, and your righteousness like the waves of the sea. Isaiah 48:18 NKJV"], ["docT", "The fruit of righteousness is sown in peace by those who make peace. James 3:18"], ["prayer", "Lord, the chaos of this world pulls us away from you. Calm our hearts during times of trouble. As you comfort us, may we make peace the goal in our relationships, our community, and in all that we do. Amen."]], "340": [["dateVerse", "Thursday, December 5, 2024", "Psalm 139:17-24", "2 Kings 4:38-5:14", "Acts 1:1-14"], ["watchD", "Love truth and peace. Zechariah 8:19"], ["docT", "And the peace of God, which surpasses all understanding, will guard your hearts and your minds in Christ Jesus. Philippians 4:7"], ["prayer", "Understanding Savior, you are able to comprehend the message of our hearts, even when words fail us. We rejoice to be seen, heard, and known by you. Amen."]], "341": [["dateVerse", "Friday, December 6, 2024", "Psalm 140:1-5", "2 Kings 5:15-6:23", "Acts 1:15-26"], ["watchD", "Ah Lord God! It is you who made the heavens and the earth by your great power and by your outstretched arm! Nothing is too hard for you. Jeremiah 32:17"], ["docT", "For God so loved the world that he gave his only Son, so that everyone who believes in him may not perish but may have eternal life. John 3:16"], ["prayer", "Son of God, your love humbles us every day. For joining us in this human life, for your generosity in service, for your life given for all people, we say thank you. Make us worthy of your love. Amen."]], "342": [["dateVerse", "Saturday, December 7, 2024", "Psalm 140:6-13", "2 Kings 6:24-7:20", "Acts 2:1-13"], ["watchD", "The Lord said to Cain “What have you done? Listen, your brother’s blood is crying out to me from the ground!” Genesis 4:10"], ["docT", "The saying is sure and worthy of full acceptance: that Christ Jesus came into the world to save sinners—of whom I am the foremost. 1 Timothy 1:15"], ["prayer", "God of forgiveness, our sin reminds us how badly we need you. When we stumble and fall, we only rise again because of your love. Help us stand taller with each new day. Amen."]], "343": [["info", "Second Sunday of Advent"], ["watchO", "Watchword for the week — Blessed be the Lord God of Israel, for he has looked favorably on his people and redeemed them. Luke 1:68"], ["dateVerse", "Sunday, December 8, 2024", "Malachi 3:1-4", "Luke 1:68-79", "Philippians 1:3-11", "Luke 3:1-6"], ["watchD", "Both we and our ancestors have sinned; we have committed iniquity, have done wickedly. Psalm 106:6"], ["docT", "We hold that a person is justified by faith apart from works prescribed by the law. Romans 3:28"], ["prayer", "Gracious Savior, we ask for your guidance. May our faith in you inspire action, not complacency. May our works reflect the example you have set for us. Amen."]], "344": [["dateVerse", "Monday, December 9, 2024", "Psalm 141:1-4", "2 Kings 8", "Acts 2:14-28"], ["watchD", "Let all who take refuge in you rejoice. Psalm 5:11"], ["docT", "Paul wrote: As servants of God we have commended ourselves in every way: as sorrowful yet always rejoicing, as poor yet making many rich, as having nothing and yet possessing everything. 2 Corinthians 6:4,10"], ["prayer", "Lord Jesus, we sometimes forget that you are all we need. Our life with you is better than anything this world could offer or provide. Even on our darkest days, we rejoice, because you love us. Amen."]], "345": [["dateVerse", "Tuesday, December 10, 2024", "Psalm 141:5-10", "2 Kings 9", "Acts 2:29-47"], ["watchD", "Your sun shall no more go down or your moon withdraw itself, for the Lord will be your everlasting light. Isaiah 60:20"], ["docT", "For it is the God who said, “Light will shine out of darkness,” who has shone in our hearts to give the light of the knowledge of the glory of God in the face of Christ. 2 Corinthians 4:6"], ["prayer", "Light of the world, our lives are illuminated by grace. Your light goes before us, and your presence shines in all the good we do. We follow you, hoping to drive out the darkness of this earth. In your name, we pray. Amen."]], "346": [["dateVerse", "Wednesday, December 11, 2024", "Psalm 142", "2 Kings 10", "Acts 3:1-10"], ["watchD", "The hope of the righteous ends in gladness. Proverbs 10:28"], ["docT", "Be like those who are waiting for their master to return from the wedding banquet, so that they may open the door for him as soon as he comes and knocks. Luke 12:36"], ["prayer", "Lord, help us be active as we wait for you. Turn this season of anticipation into a song of praise, a time for service, an opportunity to prepare this world for your truth and love. Amen."]], "347": [["dateVerse", "Thursday, December 12, 2024", "Psalm 143:1-6", "2 Kings 11", "Acts 3:11-26"], ["watchD", "God sets on high those who are lowly, and those who mourn are lifted to safety. Job 5:11"], ["docT", "God chose what is weak in the world to shame the strong. 1 Corinthians 1:27"], ["prayer", "Lord, your example has shown us the value in humility, the power in vulnerability. From your human weakness on the cross, we have come to know the love you have for us. Amen."]], "348": [["dateVerse", "Friday, December 13, 2024", "Psalm 143:7-12", "2 Kings 12,13", "Acts 4:1-12"], ["watchD", "Moses hid his face, for he was afraid to look at God. Exodus 3:6"], ["docT", "Jesus came and touched them, saying, “Get up and do not be afraid.” And when they raised their eyes, they saw no one except Jesus himself alone. Matthew 17:7-8"], ["prayer", "Loving God, when fear threatens to paralyze us, you inspire us to action. There is nothing we should be afraid of as we walk with you. For the courage you give us, we are grateful. Amen."]], "349": [["dateVerse", "Saturday, December 14, 2024", "Psalm 144:1-4", "2 Kings 14", "Acts 4:13-22"], ["watchD", "Why have you despised the word of the Lord, to do what is evil in his sight? 2 Samuel 12:9"], ["docT", "Wretched person that I am! Who will rescue me from this body of death? Thanks be to God through Jesus Christ our Lord! Romans 7:24-25"], ["prayer", "Lord Jesus, there are times when our shortcomings baffle us. We can wander so far from you, and yet, we are never out of your reach. Thank you for never giving up on us. Amen."]], "350": [["info", "Third Sunday of Advent"], ["watchO", "Watchword for the week — Bear fruits worthy of repentance. Luke 3:8"], ["dateVerse", "Sunday, December 15, 2024", "Zephaniah 3:14-20", "Isaiah 12:2-6", "Philippians 4:4-7", "Luke 3:7-18"], ["watchD", "Do not trust in these deceptive words: “This is the temple of the Lord, the temple of the Lord, the temple of the Lord.” Amend your ways and your doings. Jeremiah 7:4-5"], ["docT", "Praise be to the Lord, the God of Israel, because he has come to his people and redeemed them; to enable us to serve him without fear in holiness and righteousness before him all our days. Luke 1:68,74-75 NIV"], ["prayer", "Gracious God, it is truly a blessing to serve you. As your people, we vow to leave the places where our faith brings us comfort, to share the joy of your love with the world. Amen."]], "351": [["dateVerse", "Monday, December 16, 2024", "Psalm 144:5-8", "2 Kings 15", "Acts 4:23-37"], ["watchD", "Be to me a rock of refuge, a strong fortress to save me, for you are my rock and my fortress. Psalm 71:3"], ["docT", "Jesus threw himself on the ground and prayed, “My Father, if it is possible, let this cup pass from me, yet not what I want but what you want.” Matthew 26:39"], ["prayer", "Humble Lord Jesus, we long to see the path you have laid out for us, but our imperfect vision can fail us. At the crossroads of this life, we pray to follow your will rather than our own. Amen."]], "352": [["dateVerse", "Tuesday, December 17, 2024", "Psalm 144:9-15", "2 Kings 16:1-17:6", "Acts 5:1-11"], ["watchD", "For justice will return to the righteous, and all the upright in heart will follow it. Psalm 94:15"], ["docT", "Jesus said, “And will not God grant justice to his chosen ones who cry to him day and night? Will he delay long in helping them? I tell you, he will quickly grant justice to them.” Luke 18:7-8"], ["prayer", "Gracious God, we long for restoration on our own schedule, but we know your time is not our time. We have no doubt that you have heard our cries and will answer them. We thank you for your faithfulness. Amen."]], "353": [["dateVerse", "Wednesday, December 18, 2024", "Psalm 145:1-7", "2 Kings 17:7-41", "Acts 5:12-16"], ["watchD", "The Lord said to Abram, “Do not be afraid, Abram. I am your shield, your exceedingly great reward.” Genesis 15:1 NKJV"], ["docT", "And thus Abraham, having patiently endured, obtained the promise. Hebrews 6:15"], ["prayer", "Lord, the promises you have made to us are pure and true, even as our journey can be full of joy and pain. When doubt threatens to slow us down, keep our eyes fixed on you. Amen."]], "354": [["dateVerse", "Thursday, December 19, 2024", "Psalm 145:8-16", "2 Kings 18", "Acts 5:17-40"], ["watchD", "Jacob said to Joseph, “Go now, see if it is well with your brothers and with the flock.” Genesis 37:14"], ["docT", "Let us consider how to provoke one another to love and good deeds. Hebrews 10:24"], ["prayer", "God of love, the relationships we have are priceless treasures. Through our work together, may we celebrate each other. Help us see our unique gifts as a reflection your creative power and wonder. Amen."]], "355": [["dateVerse", "Friday, December 20, 2024", "Psalm 145:17-21", "2 Kings 19:1-28", "Acts 5:41-6:7"], ["watchD", "Israel shall be saved by the Lord with everlasting salvation; you shall not be ashamed or disgraced forever and ever. Isaiah 45:17 NKJV"], ["docT", "The angel said to Joseph, “Mary will bear a son, and you are to name him Jesus, for he will save his people from their sins.” Matthew 1:21"], ["prayer", "Lord Jesus, through your birth, life, death, and resurrection, we see that our sins do not define us. We are humbled that you were sent to save us from our flaws. Amen."]], "356": [["dateVerse", "Saturday, December 21, 2024", "Psalm 146", "2 Kings 19:29-20:21", "Acts 6:8-7:3"], ["watchD", "My heart and my flesh sing for joy to the living God. Psalm 84:2"], ["docT", "Elizabeth said to Mary, “And why has this happened to me, that the mother of my Lord comes to me? For as soon as I heard the sound of your greeting, the child in my womb leaped for joy.” Luke 1:43-44"], ["prayer", "Lord, the joy of your birth is too wonderful to comprehend, and yet it is a truth that has changed our lives. As long as we have air in our lungs, we will offer our songs of praise. Amen."]], "357": [["info", "Fourth Sunday of Advent"], ["watchO", "Watchword for the week — God has brought down the powerful from their thrones, and lifted up the lowly. Luke 1:52"], ["dateVerse", "Sunday, December 22, 2024", "Micah 5:2-5a", "Luke 1:46b-55", "Hebrews 10:5-10", "Luke 1:39-45,(46-55)"], ["watchD", "For you, O Lord, are my hope, my trust, O Lord, from my youth. Psalm 71:5"], ["docT", "In hope we were saved. Now hope that is seen is not hope, for who hopes for what one already sees? But if we hope for what we do not see, we wait for it with patience. Romans 8:24-25"], ["prayer", "Jesus, we can become so discouraged when our faith does not produce results that our eyes can see. Change our perspective, Lord, to trust in your work always. Amen."]], "358": [["dateVerse", "Monday, December 23, 2024", "Psalm 147:1-6", "2 Kings 21:1-22:10", "Acts 7:4-16"], ["watchD", "I know my transgressions, and my sin is ever before me. Psalm 51:3"], ["docT", "If we confess our sins, he who is faithful and just will forgive us our sins and cleanse us from all unrighteousness. 1 John 1:9"], ["prayer", "Gracious God, our guilt tempts us to hide our sins from you, but doing so only keeps us from the fullness of your presence. Help us embrace vulnerability, knowing you will not reject us. Amen."]], "359": [["dateVerse", "Tuesday, December 24, 2024", "Psalm 147:7-14", "2 Kings 22:11-23:20", "Acts 7:17-29"], ["watchD", "All shall give as they are able, according to the blessing of the Lord your God that he has given you. Deuteronomy 16:17"], ["docT", "The magi opened their treasure chests and presented him with gifts of gold, frankincense and myrrh. Matthew 2:11"], ["prayer", "Immanuel, there is no gift we could bring to you that could compare to the gift you are to us. We offer our very lives to your service. We promise to carry your light into the world. In your name, we pray. Amen."]], "360": [["specialVerse", "Nativity of the Lord (Christmas)", "Isaiah 52:7-10", "Psalm 98", "Hebrews 1:1-4,(5-12)", "John 1:1-14"], ["watchO", "Watchword for Christmas Day — And the Word became flesh and lived among us, and we have seen his glory, the glory as of a father’s only son, full of grace and truth. John 1:14"], ["dateVerse", "Wednesday, December 25, 2024", "Psalm 147:15-20", "2 Kings 23:21-24:20", "Acts 7:30-43"], ["watchD", "I will take you as my people, and I will be your God. Exodus 6:7"], ["docT", "See what love the Father has given us, that we should be called children of God, and that is what we are. 1 John 3:1"], ["prayer", "Wonderful God, we rejoice that you have called us to be your people, and we see the responsibility that calling brings. Strengthen us for the task at hand and make us worthy of this task. Amen."]], "361": [["dateVerse", "Thursday, December 26, 2024", "Psalm 148:1-6", "2 Kings 25", "Acts 7:44-60"], ["watchD", "They shall know that I, the Lord their God, am with them and that they, the house of Israel, are my people, says the Lord God. Ezekiel 34:30"], ["docT", "To you is born this day in the city of David a Savior, who is the Messiah, the Lord. Luke 2:11"], ["prayer", "Savior of the world, there is no darkness that your light cannot overcome. You continue to warm our hearts and guide our paths this day. Our joy is truly everlasting. Amen."]], "362": [["dateVerse", "Friday, December 27, 2024", "Psalm 148:7-14", "1 Chronicles 1:1-37", "Acts 8:1-8"], ["watchD", "All the ends of the earth have seen the salvation of our God. Psalm 98:3 NKJV"], ["docT", "We wait for the blessed hope and the manifestation of the glory of our great God and Savior, Jesus Christ. Titus 2:13"], ["prayer", "Jesus, we turn to you for all that we need. Your humble love has made God known to us, and your saving act has made our broken lives whole. We are blessed to follow you. Amen."]], "363": [["dateVerse", "Saturday, December 28, 2024", "Psalm 149", "1 Chronicles 1:38-2:17", "Acts 8:9-25"], ["watchD", "Whoever is kind to the poor lends to the Lord, and he will reward them for what they have done. Proverbs 19:17 NIV"], ["docT", "Give, and it will be given to you. A good measure, pressed down, shaken together, running over, will be put into your lap, for the measure you give will be the measure you get back. Luke 6:38"], ["prayer", "Generous God, you have blessed us beyond measure, and you call us to be a blessing. May we consider what more we can share, what more we can offer to be of service to you. Amen."]], "364": [["info", "First Sunday after Christmas"], ["watchO", "Watchword for the week — Let them praise the name of the Lord, for his name alone is exalted; his glory is above earth and heaven. Psalm 148:13"], ["dateVerse", "Sunday, December 29, 2024", "1 Samuel 2:18-20,26", "Psalm 148", "Colossians 3:12-17", "Luke 2:41-52"], ["watchD", "Even the sparrow finds a home and the swallow a nest for herself, where she may lay her young, at your altars, O Lord of hosts, my King and my God. Psalm 84:3"], ["docT", "Foxes have holes, and birds of the air have nests, but the Son of Man has nowhere to lay his head. Matthew 8:20"], ["prayer", "God of creation, you provide for beings large and small on this earth. Help us leave our comfort for the sake of discipleship. Wherever we might go, we know you will provide for us as well. Amen."]], "365": [["dateVerse", "Monday, December 30, 2024", "Psalm 150:1-2", "1 Chronicles 2:18-55", "Acts 8:26-40"], ["watchD", "Great is our Lord and abundant in power; his understanding is beyond measure. Psalm 147:5"], ["docT", "The child grew and became strong, filled with wisdom, and the favor of God was upon him. Luke 2:40"], ["prayer", "Lord Jesus, the fullness of your humanity could be found in your life as a child. As you played, learned, and grew, God was with you. May your human life help us see God in all that we do. Amen."]], "366": [["dateVerse", "Tuesday, December 31, 2024", "Psalm 150:3-6", "1 Chronicles 3", "Acts 9:1-9"], ["watchD", "This is God, our God forever and ever. He will be our guide forever. Psalm 48:14"], ["docT", "Jesus said, “I am the way and the truth and the life.” John 14:6"], ["prayer", "Jesus, we leave behind the joys and regrets of the year gone by. Guide us as we embrace new challenges and new opportunities. Help us make following you our first and only goal. Amen."]]}