{"1": [["dateVerse", "Wednesday, January 1", "Psalm 1", "1 Chronicles 4:1-23", "Acts 9:10-22"], ["watchD", "Do not say, “I am only a boy,” for you shall go to all to whom I send you, and you shall speak whatever I command you. Jeremiah 1:7"], ["docT", "Paul wrote: I am not ashamed of the gospel. Romans 1:16"], ["prayer", "Heavenly Guide, we know it is too easy to be ashamed. We ask that you give us the strength needed to spread your gospel, a story of love and grace. Help us to accept this gift you so freely give. In Jesus’ name, we pray. Amen."]], "2": [["dateVerse", "Thursday, January 2", "Psalm 2", "1 Chronicles 4:24-43", "Acts 9:23-35"], ["watchD", "The fear of others lays a snare, but one who trusts in the Lord is secure. Proverbs 29:25"], ["docT", "Do not be afraid, little flock, for it is your Father’s good pleasure to give you the kingdom. Luke 12:32"], ["prayer", "Spirit of heaven and earth, we give our trust to you. Help us remain unafraid and free from the snares that seek to entrap us. Guide us on the path you have laid before us— one that leads to eternal promise. In Jesus’ name, we pray. Amen."]], "3": [["dateVerse", "Friday, January 3", "Psalm 3", "1 Chronicles 5:1-22", "Acts 9:36-10:8"], ["watchD", "Has God promised, and will he not do it? Has he spoken, and will he not fulfill it? Numbers 23:19"], ["docT", "Jesus said, “Everyone, then, who hears these words of mine and acts on them will be like a wise man who built his house on rock.” Matthew 7:24"], ["prayer", "Our Rock and Salvation, you fulfill your promises as surely as a house on a rock holds its foundation. You steady us, you lead us, and you provide for us. May we be a reflection of your love to all we encounter. In Jesus’ name, we pray. Amen."]], "4": [["dateVerse", "Saturday, January 4", "Psalm 4", "1 Chronicles 5:23-6:30", "Acts 10:9-23a"], ["watchD", "Into your hand I commit my spirit; you have redeemed me, O Lord, faithful God. Psalm 31:5"], ["docT", "Let us therefore approach the throne of grace with boldness, so that we may receive mercy and find grace to help in time of need. Hebrews 4:16"], ["prayer", "Merciful God, thank you for choosing us. Thank you for the redemption offered through your son, Jesus Christ. May we receive this grace and commit ourselves fully to you, knowing you have chosen us as your people. In Jesus’ name, we pray. Amen."]], "5": [["info", "Second Sunday after Christmas"], ["watchO", "Watchword for the week — God has made known to us the mystery of his will, according to his good pleasure that he set forth in Christ. Ephesians 1:9"], ["dateVerse", "Sunday, January 5", "Jeremiah 31:7-14", "Psalm 147:12-20", "Ephesians 1:3-14", "John 1:(1-9)10-18"], ["watchD", "The Lord is good, a stronghold in a day of trouble; he protects those who take refuge in him. Nahum 1:7"], ["docT", "So do not throw away your confidence. Hebrews 10:35 NIV"], ["prayer", "God, our protector, thank you for holding steadfast for us. Help us to hold onto our confidence in you, knowing that you will never break, never bend, never lose sight of your love for us. Help us to be strong like you in our service to one another. In Jesus’ name, we pray. Amen."]], "6": [["info", "Epiphany of the Lord"], ["watchO", "Watchword for the Epiphany — Arise, shine; for your light has come, and the glory of the Lord has risen upon you. Isaiah 60:1"], ["specialVerse", "Epiphany of the Lord", "Isaiah 60:1-6", "Psalm 72:1-7,10-14", "Ephesians 3:1-12", "Matthew 2:1-12"], ["dateVerse", "Monday, January 6", "Psalm 5", "1 Chronicles 6:31-81", "Acts 10:23b-33"], ["watchD", "He makes me lie down in green pastures; he leads me beside still waters; he restores my soul. Psalm 23:2-3"], ["docT", "You were going astray like sheep, but now you have returned to the shepherd and guardian of your souls. 1 Peter 2:25"], ["prayer", "Shepherd, guide us to the abiding place you have for us, the green pastures of our soul. Guide us to places where peace and joy may be found. We are your flock and happy to be yours. In Jesus’ name, we pray. Amen."]], "7": [["dateVerse", "Tuesday, January 7", "Psalm 6", "1 Chronicles 7", "Acts 10:34-43"], ["watchD", "Do not despise the Lord’s discipline or be weary of his reproof. Proverbs 3:11"], ["docT", "Jesus taught them as one having authority. Mark 1:22"], ["prayer", "God above, sometimes we need your discipline so that we may learn how to be better carriers of your word. We do not always treat one another, or ourselves, kindly. Teach us how to be loving bearers of your example. In Jesus’ name, we pray. Amen."]], "8": [["dateVerse", "Wednesday, January 8", "Psalm 7:1-9", "1 Chronicles 8", "Acts 10:44-11:10"], ["watchD", "My heart is steadfast, O God, my heart is steadfast; I will sing and make melody. Awake, my soul! Psalm 108:1"], ["docT", "The lame man jumped to his feet and began to walk. Then he went with them into the temple courts, walking and jumping, and praising God. Acts 3:8 NIV"], ["prayer", "Creator, we rejoice at the wonders that you have brought: the big wonders of creation, miracles, and grand gestures of your might. We also praise you for the small wonders: the sound of laughter and a knowing smile between people. We will sing our joy in praise to you. In Jesus’ name, we pray. Amen."]], "9": [["dateVerse", "Thursday, January 9", "Psalm 7:10-17", "1 Chronicles 9:1-34", "Acts 11:11-24"], ["watchD", "Remember the long way that the Lord your God has led you these forty years in the wilderness, in order to humble you, testing you to know what was in your heart. Deuteronomy 8:2"], ["docT", "And the Spirit immediately drove Jesus out into the wilderness. He was in the wilderness forty days, tested by Satan, and he was with the wild beasts, and the angels waited on him. Mark 1:12-13"], ["prayer", "O holy One, the wilderness has much to teach us about ourselves and your kindness. We may not like seasons of wilderness, but we pray that you use these seasons to teach us. Help us grow in strength, humility, and faith. In Jesus’ name, we pray. Amen."]], "10": [["dateVerse", "Friday, January 10", "Psalm 8", "1 Chronicles 9:35-11:3", "Acts 11:25-12:5"], ["watchD", "The Lord said, “If only they had such a mind as this, to fear me and to keep all my commandments always, so that it might go well with them and with their children forever!” Deuteronomy 5:29"], ["docT", "Jesus said, “I give you a new commandment, that you love one another. Just as I have loved you, you also should love one another. By this everyone will know that you are my disciples, if you have love for one another.” John 13:34-35"], ["prayer", "Light of the world, we wait for you. Your example is one of love, even for those deemed as other, less than, or as enemies. Lord, we wait for you to turn our hearts. Help us to see everyone as beloved, just as you see us. In Jesus’ name, we pray. Amen."]], "11": [["dateVerse", "Saturday, January 11", "Psalm 9:1-10", "1 Chronicles 11:4-47", "Acts 12:6-19"], ["watchD", "I will make a covenant of peace with them; it shall be an everlasting covenant with them. Ezekiel 37:26"], ["docT", "Grace to you and peace from him who is and who was and who is to come. Revelation 1:4"], ["prayer", "God, you extend your grace and a sense of peace to all. Fill us with this peace and bring light to all we encounter. May we carry grace with us—for your creation, for humankind, and for ourselves. In Jesus’ name, we pray. Amen."]], "12": [["info", "First Sunday after the Epiphany"], ["watchO", "Watchword for the week — God said, “Do not fear, for I have redeemed you; I have called you by name, you are mine.” Isaiah 43:1"], ["dateVerse", "Sunday, January 12", "Isaiah 43:1-7", "Psalm 29", "Acts 8:14-17", "Luke 3:15-17,21-22"], ["watchD", "Hatred stirs up strife, but love covers all offenses. Proverbs 10:12"], ["docT", "In this is love, not that we loved God but that he loved us and sent his Son to be the atoning sacrifice for our sins. Beloved, since God loved us so much, we also ought to love one another. 1 John 4:10-11"], ["prayer", "Loving Creator, when we turn away from love, remind us of our call as your people: to love one another; to care for our neighbor. Give us the courage to love boldly in the face of a world brimming with discontent. Help us love one another well. In Jesus’ name, we pray. Amen."]], "13": [["dateVerse", "Monday, January 13", "Psalm 9:11-20", "1 Chronicles 12", "Acts 12:20-13:7"], ["watchD", "Turn my eyes from looking at vanities. Psalm 119:37"], ["docT", "Your eye is the lamp of your body. If your eye is healthy, your whole body is full of light, but if it is unhealthy, your body is full of darkness. Luke 11:34"], ["prayer", "Tender God, teach us to turn from the vanities that seek to dim our light. Turn us toward you and the duty you have laid before us—to be an example of Christ in the world. Let our love for you be greater than any desire we may be holding. In Jesus’ name, we pray. Amen."]], "14": [["dateVerse", "Tuesday, January 14", "Psalm 10:1-11", "1 Chronicles 13:1-14:7", "Acts 13:8-20a"], ["watchD", "Whoever is kind to the needy honors God. Proverbs 14:31 NIV"], ["docT", "Jesus said to the young man, “If you wish to be perfect, go, sell your possessions, and give the money to the poor, and you will have treasure in heaven; then come, follow me.” Matthew 19:21"], ["prayer", "God of the poor, help us notice our tendencies to ignore poverty, those without homes, those on the margins. Help us to see our overconsumption, our stuffed homes, our ability to give more than we do now. Let us be generous and kind. In Jesus’ name, we pray. Amen."]], "15": [["dateVerse", "Wednesday, January 15", "Psalm 10:12-18", "1 Chronicles 14:8-15:29", "Acts 13:20b-33"], ["watchD", "You shall not commit adultery. Exodus 20:14"], ["docT", "The husband should give to his wife what is due her and likewise the wife to her husband. 1 Corinthians 7:3"], ["prayer", "Father, Mother, Parent—guide us in our relationships with one another and with you. As the church is your bride,let us together focus on you. Join us in relationship and fellowship with one another, that we may share your light with others. In Jesus’ name, we pray. Amen."]], "16": [["dateVerse", "Thursday, January 16", "Psalm 11", "1 Chronicles 16:1-36", "Acts 13:34-47"], ["watchD", "The haughty eyes of people shall be brought low, and the pride of everyone shall be humbled, and the Lord alone will be exalted on that day. Isaiah 2:11"], ["docT", "God chose what is foolish in the world to shame the wise; God chose what is weak in the world to shame the strong; God chose what is low and despised in the world, things that are not, to abolish things that are, so that no one might boast in the presence of God. 1 Corinthians 1:27-29"], ["prayer", "Forgiving God, you hold us accountable to you and to one another. Guide us in our journey to humility, recognizing that there are many gifts in the world. Give us hearts that are open to the variety in the world. In Jesus’ name, we pray. Amen."]], "17": [["dateVerse", "Friday, January 17", "Psalm 12", "1 Chronicles 16:37-17:27", "Acts 13:48-14:7"], ["watchD", "Human ways are under the eyes of the Lord. Proverbs 5:21"], ["docT", "Therefore, do not pronounce judgment before the time, before the Lord comes, who will bring to light the things now hidden in darkness and will disclose the purposes of the heart. 1 Corinthians 4:5"], ["prayer", "Merciful Judge, you guide us and offer the example of Christian life through your son, Jesus Christ. Give us the courage to follow his example, showing less judgment and more love, even to ourselves. In Jesus’ name, we pray. Amen."]], "18": [["dateVerse", "Saturday, January 18", "Psalm 13", "1 Chronicles 18", "Acts 14:8-20"], ["watchD", "So, acknowledge today and take to heart that the Lord is God in heaven above and on the earth beneath; there is no other. Deuteronomy 4:39"], ["docT", "Let your gentleness be known to everyone. The Lord is near. And the peace of God, which surpasses all understanding, will guard your hearts and your minds in Christ Jesus. Philippians 4:5,7"], ["prayer", "God in heaven, sometimes we forget the vastness of your might and your love. You are always present for us and ready to share our burdens. Let your gentleness be a model for our lives. In Jesus’ name, we pray. Amen."]], "19": [["info", "Second Sunday after Epiphany"], ["watchO", "Watchword for the week — Now there are varieties of gifts, but the same spirit; and there are varieties of services, but the same Lord. 1 Corinthians 12:4–5"], ["dateVerse", "Sunday, January 19", "Isaiah 62:1-5", "Psalm 36:5-10", "1 Corinthians 12:1-11", "John 2:1-11"], ["watchD", "Arise, shine, for your light has come, and the glory of the Lord has risen upon you. Isaiah 60:1"], ["docT", "Our God is merciful and tender. He will cause the bright dawn of salvation to rise on us and to shine from heaven on all those who live in the dark shadow of death, to guide our steps into the path of peace. Luke 1:78-79 GNT"], ["prayer", "Guiding Star, you are the one Lord, forevermore. Your light has been made known to the world so that all may follow you. In this season of Epiphany, give us peace and rest so that we may share your love with the world. In Jesus’ name, we pray. Amen."]], "20": [["dateVerse", "Monday, January 20", "Psalm 14", "1 Chronicles 19,20", "Acts 14:21-15:5"], ["watchD", "The Lord will be your everlasting light, and your God will be your glory. Isaiah 60:19"], ["docT", "Jesus said, “And whoever sees me sees him who sent me. I have come as light into the world, so that everyone who believes in me should not remain in the darkness.” John 12:45-46"], ["prayer", "You are light, O God, the gift by which we see. You come to brighten the darkness, to help us to turn toward you. As plants follow the sun’s rays, help us to follow your light. Help us to show your glory in the world. In Jesus’ name, we pray. Amen."]], "21": [["dateVerse", "Tuesday, January 21", "Psalm 15", "1 Chronicles 21:1-26", "Acts 15:6-18"], ["watchD", "Uphold me according to your promise, that I may live, and let me not be put to shame in my hope. Psalm 119:116"], ["docT", "Jesus said, “Anyone who hears my word and believes him who sent me has eternal life and does not come under judgment but has passed from death to life.” John 5:24"], ["prayer", "O Lord, you have given us the promise of eternal life through your son, Jesus Christ. All you ask in return is to trust in you. Hold us to this covenant relationship; guide us on the path of faith. In Jesus’ name, we pray. Amen."]], "22": [["dateVerse", "Wednesday, January 22", "Psalm 16:1-6", "1 Chronicles 21:27-22:19", "Acts 15:19-31"], ["watchD", "Isaiah said, “Woe is me! I am lost, for I am a man of unclean lips, and I live among a people of unclean lips.” Isaiah 6:5"], ["docT", "Paul wrote: I was formerly a blasphemer, a persecutor, and a man of violence. But I received mercy. 1 Timothy 1:13"], ["prayer", "Savior, you have restored our souls and turned our hearts toward you. We have been unclean; we have blasphemed; we have not served you as we should—yet you still redeem us. Thank you. In Jesus’ name, we pray. Amen."]], "23": [["dateVerse", "Thursday, January 23", "Psalm 16:7-11", "1 Chronicles 23", "Acts 15:32-16:3"], ["watchD", "Do you think you can fool God the way you fool others? Job 13:9 GNT"], ["docT", "Jesus said to the Pharisees, “You are those who justify yourselves in the sight of others, but God knows your hearts.” Luke 16:15"], ["prayer", "God of grace and God of glory, we try to fool you and we try to fool ourselves. When we lift ourselves up, feeling the need to justify our actions to others, humble us. Let all we do be done in love and service to you. In Jesus’ name, we pray. Amen."]], "24": [["dateVerse", "Friday, January 24", "Psalm 17:1-7", "1 Chronicles 24", "Acts 16:4-15"], ["watchD", "Those who cling to worthless idols turn away from God’s love for them. Jonah 2:8 NIV"], ["docT", "Do nothing from selfish ambition or empty conceit, but in humility regard others as better than yourselves. Philippians 2:3"], ["prayer", "Messiah, may our eyes be set on you, so that the idols of our times—all the distractions the world—do not remove us from your presence. Guide us back to you; remind us that these are merely idols and do not stand the test of time. In Jesus’ name, we pray. Amen."]], "25": [["dateVerse", "Saturday, January 25", "Psalm 17:8-15", "1 Chronicles 25", "Acts 16:16-29"], ["watchD", "The Lord will again take delight in prospering you, just as he delighted in prospering your ancestors. Deuteronomy 30:9"], ["docT", "Blessed be the Lord God of Israel, for he has looked favorably on his people and redeemed them. He has raised up a mighty savior for us in the house of his child David. Luke 1:68-69"], ["prayer", "Mighty God, you have provided for us throughout the years, knowing that goodness and mercy shall come. Help us to see your providing ways. We are never forgotten and never alone. In Jesus’ name, we pray. Amen."]], "26": [["info", "Third Sunday after Epiphany"], ["watchO", "Watchword for the week — Let the words of my mouth and the meditation of my heart be acceptable to you, O Lord, my rock and my redeemer. Psalm 19:14"], ["dateVerse", "Sunday, January 26", "Nehemiah 8:1-3,5-6,8-10", "Psalm 19", "1 Corinthians 12:12-31a", "Luke 4:14-21"], ["watchD", "A bruised reed he will not break, and a dimly burning wick he will not quench. Isaiah 42:3"], ["docT", "Jesus said, “Take care that you do not despise one of these little ones.” Matthew 18:10"], ["prayer", "Loving Spirit, as a mother cares for her young, so you care for us. You nurture us, especially when we feel down. A light, you will not dim; you only seek to help us shine brighter. Help us to encourage our youth, ourselves, and the world with your light. In Jesus’ name, we pray. Amen."]], "27": [["dateVerse", "Monday, January 27", "Psalm 18:1-6", "1 Chronicles 26", "Acts 16:30-17:3"], ["watchD", "You answer us with awesome and righteous deeds, God our Savior. Psalm 65:5 NIV"], ["docT", "This is the confidence we have in approaching God: that if we ask anything according to his will, he hears us. 1 John 5:14 NIV"], ["prayer", "Faithful Listener, hear our plea as we lift our voices to you. Through your son, you have thrown open the doors to you; there are no barriers. What greater deed can there be than this? In Jesus’ name, we pray. Amen."]], "28": [["dateVerse", "Tuesday, January 28", "Psalm 18:7-15", "1 Chronicles 27", "Acts 17:4-15"], ["watchD", "Guard me as the apple of the eye. Psalm 17:8"], ["docT", "The Lord is faithful; he will strengthen you and guard you from the evil one. 2 Thessalonians 3:3"], ["prayer", "God, you are our refuge and our safe place. Guard us from the evils of this world—those of our own making, and the things that try to take us from you. We thank you for your protection and ask that you guide us toward your heart alone. In Jesus’ name, we pray. Amen."]], "29": [["dateVerse", "Wednesday, January 29", "Psalm 18:16-24", "1 Chronicles 28,29", "Acts 17:16-28"], ["watchD", "David said, “May my life be precious in the sight of the Lord, and may he rescue me from all tribulation.” 1 Samuel 26:24"], ["docT", "You know the generous act of our Lord Jesus Christ, that though he was rich, yet for your sakes he became poor, so that by his poverty you might become rich. 2 Corinthians 8:9"], ["prayer", "Giver of all, you took on the weight of human need to rescue us from tribulation. May we, in response to your creating, sustaining, and redeeming nature, show our gratitude through our faith, love, and hope. May we continue to seek you in all we do. In Jesus’ name, we pray. Amen."]], "30": [["dateVerse", "Thursday, January 30", "Psalm 18:25-29", "2 Chronicles 1,2", "Acts 17:29-18:7"], ["watchD", "God, the Lord, is my strength. Habakkuk 3:19"], ["docT", "So we do not lose heart. Even though our outer nature is wasting away, our inner nature is being renewed day by day. 2 Corinthians 4:16"], ["prayer", "Our Strength and Motivation, sometimes we lose heart. We lose the fire that you set in us to blaze for you. Help us to search inside ourselves for the light that will never be dimmed. Strengthen us to be your hands and feet in the world. In Jesus’ name, we pray. Amen."]], "31": [["dateVerse", "Friday, January 31", "Psalm 18:30-36", "2 Chronicles 3:1-5:1", "Acts 18:8-21"], ["watchD", "O Lord, open my lips, and my mouth will declare your praise. Psalm 51:15"], ["docT", "Peter and John said, “We cannot keep from speaking about what we have seen and heard.” Acts 4:20"], ["prayer", "Jesus, may we continually praise you in all we do: from our lips, in our hearts, and in our actions. May we declare your goodness to all whom we encounter. Let us live in such a way that every person we meet will feel your presence through us. In your name, we pray. Amen."]], "32": [["dateVerse", "Saturday, February 1", "Psalm 18:37-45", "2 Chronicles 5:2-6:23", "Acts 18:22-19:5"], ["watchD", "Many of those who sleep in the dust of the earth shall awake, some to everlasting life and some to shame and everlasting contempt. Daniel 12:2"], ["docT", "For to this end Christ died and lived again, so that he might be Lord of both the dead and the living. Romans 14:9"], ["prayer", "Lord Jesus, we recognize your sacrifice on the cross as a gift, knowing that you have promised us a better life to come. We sing hymns of praise acknowledging that you are the Lord of both the living and the dead. Amen."]], "33": [["info", "Fourth Sunday after Epiphany"], ["watchO", "Watchword for the week — For now we see in a mirror, dimly, but then we will see face to face. 1 Corinthians 13:12"], ["dateVerse", "Sunday, February 2", "Jeremiah 1:4-10", "Psalm 71:1-6", "1 Corinthians 13:1-13", "Luke 4:21-30"], ["watchD", "At the command of the Lord the Israelites would set out, and at the command of the Lord they would camp. Numbers 9:18"], ["docT", "By faith Abraham obeyed when he was called to set out for a place that he was to receive as an inheritance, and he set out, not knowing where he was going. Hebrews 11:8"], ["prayer", "Lord God, as Abraham answered your call and went where you guided him, help us to hear your voice calling us to do your will and your works here on earth. In your name, we pray. Amen."]], "34": [["dateVerse", "Monday, February 3", "Psalm 18:46-50", "2 Chronicles 6:24-7:22", "Acts 19:6-20"], ["watchD", "The hand of our God was upon us, and he delivered us. Ezra 8:31"], ["docT", "Paul wrote: What persecutions I endured! Yet the Lord rescued me from all of them. 2 Timothy 3:11"], ["prayer", "Ever-present Savior, you know we face challenges in our daily lives. It is a great comfort to know that you knew this life and met your own challenges. Please be with us on our journey—you who helps lighten the burdens of life. Amen."]], "35": [["dateVerse", "Tuesday, February 4", "Psalm 19:1-6", "2 Chronicles 8:1-9:12", "Acts 19:21-31"], ["watchD", "Is not my word like fire, says the Lord, and like a hammer that breaks a rock in pieces? Jeremiah 23:29"], ["docT", "Indeed, the word of God is living and active and sharper than any two-edged sword, piercing until it divides soul from spirit, joints from marrow; it is able to judge the thoughts and intentions of the heart. Hebrews 4:12"], ["prayer", "God of all, we are grateful for your promise made flesh in Christ our Savior. May we hold Jesus’ lessons in our hearts and reflect them to others this and every day. Amen."]], "36": [["dateVerse", "Wednesday, February 5", "Psalm 19:7-14", "2 Chronicles 9:13-10:19", "Acts 19:32-20:3"], ["watchD", "The suffering servant said, “I gave my back to those who struck me and my cheeks to those who pulled out the beard; I did not hide my face from insult and spitting.” Isaiah 50:6"], ["docT", "Jesus said, “No one has greater love than this, to lay down one’s life for one’s friends.” John 15:13"], ["prayer", "Holy Lord, your might is in love, truth, and compassion. Help us remember it has no place for a domineering will to win. May the peace of your love direct our thoughts, words, and deeds. Amen."]], "37": [["dateVerse", "Thursday, February 6", "Psalm 20", "2 Chronicles 11:1-12:12", "Acts 20:4-16"], ["watchD", "The Lord said in his heart, “I will never again curse the ground because of humans, for the inclination of the human heart is evil from youth.” Genesis 8:21"], ["docT", "God did not send the Son into the world to condemn the world but in order that the world might be saved through him. John 3:17"], ["prayer", "Dearest Jesus, there are no words to thank you for your gift of salvation. May we honor it every minute of every day by following God’s will and always putting others first. Amen."]], "38": [["dateVerse", "Friday, February 7", "Psalm 21", "2 Chronicles 12:13-13:22", "Acts 20:17-31"], ["watchD", "O God, you are my God; I seek you; my soul thirsts for you. Psalm 63:1"], ["docT", "Let everyone who is thirsty come. Let anyone who wishes take the water of life as a gift. Revelation 22:17"], ["prayer", "God, who leads us beside still waters and restores our soul, refresh the parched places of our lives and quench our thirst for peace, confidence in faith, and reconciliation with those for whom we share life—both near to our daily lives and those far removed by national, philosophical, and theological borders. Amen."]], "39": [["dateVerse", "Saturday, February 8", "Psalm 22:1-8", "2 Chronicles 14,15", "Acts 20:32-21:4"], ["watchD", "He has gained renown by his wonderful deeds; the Lord is gracious and merciful. Psalm 111:4"], ["docT", "The cup of blessing that we bless, is it not a sharing in the blood of Christ? The bread that we break, is it not a sharing in the body of Christ? 1 Corinthians 10:16"], ["prayer", "Renewing God, when we find ourselves at the table together in Christ’s name, may we be reminded not only of the sacredness of your self-giving love, but may we also be inspired to give of ourselves in care and service to others near to heart and hand. May Christ’s grace and mercy be that which we not only receive, but which we offer daily with glad heart and mind. Amen."]], "40": [["info", "Fifth Sunday after Epiphany"], ["watchO", "Watchword for the week — The Lord will fulfill his purpose for me; your steadfast love, O Lord, endures forever. Psalm 138:8"], ["dateVerse", "Sunday, February 9", "Isaiah 6:1-8(9-13)", "Psalm 138", "1 Corinthians 15:1-11", "Luke 5:1-11"], ["watchD", "God said to Ezekiel, “Mortal, all my words that I shall speak to you receive in your heart and hear with your ears.” Ezekiel 3:10"], ["docT", "Jesus said, “But as for what was sown on good soil, this is the one who hears the word and understands it, who indeed bears fruit and yields in one case a hundredfold, in another sixty, and in another thirty.” Matthew 13:23"], ["prayer", "God who whispers into the everyday moments of life, open our ears that our hearts may hear and understand your word. We dedicate our whole selves to your purposes. Truly, may our ears hear…may our eyes seemay our hands work…that we will yet be the living reminders of your grace in this day. Amen."]], "41": [["dateVerse", "Monday, February 10", "Psalm 22:9-21", "2 Chronicles 16,17", "Acts 21:5-16"], ["watchD", "With God are strength and wisdom; the deceived and the deceiver are his. Job 12:16"], ["docT", "God desires everyone to be saved and to come to the knowledge of the truth. 1 Timothy 2:4"], ["prayer", "God of all, teach us so we may gain wisdom to discern your truth and be saved. Help us to proclaim your saving grace to all and to lead others to follow you. Amen."]], "42": [["dateVerse", "Tuesday, February 11", "Psalm 22:22-28", "2 Chronicles 18", "Acts 21:17-30"], ["watchD", "You shall not be partial to the poor or defer to the great. Leviticus 19:15"], ["docT", "Do not claim the faith of our Lord Jesus Christ of glory while showing partiality. James 2:1"], ["prayer", "Great Redeemer, remind us that it is not our place to judge or to show partiality. All your children are equally worthy of our love, care, and respect. In your name, we pray. Amen."]], "43": [["dateVerse", "Wednesday, February 12", "Psalm 22:29-31", "2 Chronicles 19:1-20:19", "Acts 21:31-22:2"], ["watchD", "From the least to the greatest of them, everyone is greedy for unjust gain; and from prophet to priest, everyone deals falsely. They have treated the wound of my people carelessly, saying, “Peace, peace,” when there is no peace. Jeremiah 6:13-14"], ["docT", "Let love be genuine; hate what is evil; hold fast to what is good. Romans 12:9"], ["prayer", "God of love, make us peacemakers in our troubled world. Help us to fight greed and injustice; help us to find the good in all those around us. In your heavenly name, we pray. Amen."]], "44": [["dateVerse", "Thursday, February 13", "Psalm 23", "2 Chronicles 20:20-21:17", "Acts 22:3-16"], ["watchD", "God said, “Ask for the ancient paths, where the good way lies; and walk in it, and find rest for your souls.” Jeremiah 6:16"], ["docT", "We want each one of you to show the same diligence so as to realize the full assurance of hope to the very end, so that you may not become sluggish but imitators of those who through faith and patience inherit the promises. Hebrews 6:11-12"], ["prayer", "As we walk through life, guiding God, help us to avoid the dangers and distractions that tempt us to stray. Like the saints before us, help us to walk with you, diligently serving and patiently trusting that we will see your promises fulfilled and your will be done on earth as it is in heaven. Amen."]], "45": [["dateVerse", "Friday, February 14", "Psalm 24", "2 Chronicles 21:18-23:21", "Acts 22:17-29"], ["watchD", "Like one from whom people hide their faces he was despised, and we held him in low esteem. Isaiah 53:3 NIV"], ["docT", "Pilate said to them, “Behold the man!” John 19:5"], ["prayer", "We avert our eyes, suffering Lord. We avoid looking at you in the hungry, homeless, and hopeless. We do not want to see you broken and vulnerable. And yet, how can we help but behold you, to see your love, your desire to be one of us, your desire to save us? Amen."]], "46": [["dateVerse", "Saturday, February 15", "Psalm 25:1-7", "2 Chronicles 24:1-25:4", "Acts 22:30-23:11"], ["watchD", "O my God, I cry by day, but you do not answer; and by night but find no rest. Psalm 22:2"], ["docT", "In the days of his flesh, Jesus offered up prayers and supplications, with loud cries and tears, to the one who was able to save him from death, and he was heard because of his reverent submission. Hebrews 5:7"], ["prayer", "God, we cry out to you in hurt, disappointment, and grief. We cry out even as Jesus cried out to you in despair. Hear us, spare us, and lift us up, even as, after his suffering, you lifted Jesus up to new life. Amen."]], "47": [["info", "Sixth Sunday after Epiphany"], ["watchO", "Watchword for the week — Blessed are those who trust in the Lord, whose trust is the Lord. Jeremiah 17:7"], ["dateVerse", "Sunday, February 16", "Jeremiah 17:5-10", "Psalm 1", "1 Corinthians 15:12-20", "Luke 6:17-26"], ["watchD", "He gives power to the faint and strengthens the powerless. Isaiah 40:29"], ["docT", "Paul wrote: The Lord said to me, “My grace is sufficient for you, for power is made perfect in weakness.” 2 Corinthians 12:9"], ["prayer", "Almighty God, today we pray for power. We pray not for the capacity to do whatever we want or to manipulate and defeat others, but for the capacity to enact change, to stand for justice, and to actively love ourselves, our neighbors, and our world. Amen."]], "48": [["dateVerse", "Monday, February 17", "Psalm 25:8-22", "2 Chronicles 25:5-26:15", "Acts 23:12-24"], ["watchD", "I have spoken of your faithfulness and your salvation; I have not concealed your steadfast love and your faithfulness from the great congregation. Psalm 40:10"], ["docT", "Paul wrote: We had courage in our God to declare to you the gospel of God in spite of great opposition. 1 Thessalonians 2:2"], ["prayer", "God of the Ages, since the time of psalmist and apostles, your steadfast love and faithful presence inspired generations to live out your gospel story. Now we are the generations who hear your call to receive and share your love. Inspire and embolden us, we pray! Amen."]], "49": [["dateVerse", "Tuesday, February 18", "Psalm 26", "2 Chronicles 26:16-28:8", "Acts 23:25-24:3"], ["watchD", "You will know that I am the Lord; those who wait for me shall not be put to shame. Isaiah 49:23"], ["docT", "Jesus said, “When they bring you before the synagogues, the rulers, and the authorities, do not worry about how or what you will answer or what you are to say, for the Holy Spirit will teach you at that very hour what you ought to say.” Luke 12:11-12"], ["prayer", "Holy Sustainer and Comforter, you know that we will go to extraordinary lengths to hide our fears, flaws, and insecurities. Forgive us and comfort us when that prevents us from living with empathy and authenticity. Remind us that you live in us, around us, and through us, just as we are. Amen."]], "50": [["dateVerse", "Wednesday, February 19", "Psalm 27:1-6", "2 Chronicles 28:9-29:19", "Acts 24:4-16"], ["watchD", "Unless the Lord builds the house, those who build it labor in vain. Psalm 127:1"], ["docT", "Simon answered, “Master, we have worked all night long but have caught nothing. Yet if you say so, I will let down the nets.” When they had done this, they caught so many fish that their nets were beginning to burst. Luke 5:5-6"], ["prayer", "Giver of life, you reach out with abundance and provision at every turn. All too often it is hard to have eyes to see it, trust to loosen our desires for control, or willingness to give up the outcomes we prefer. Help us receive the life you offer with open hands. Amen."]], "51": [["dateVerse", "Thursday, February 20", "Psalm 27:7-14", "2 Chronicles 29:20-30:27", "Acts 24:17-27"], ["watchD", "The Lord will vindicate his people and have compassion on his servants. Deuteronomy 32:36"], ["docT", "And will not God grant justice to his chosen ones who cry to him day and night? Will he delay long in helping them? Luke 18:7"], ["prayer", "El Roi—you, O God who sees us, guide us to trust that you see each of us and the larger landscape of all creation better than we can. Help us hear you calling us by our truest name—beloved children—that we might see one another as you do. Amen."]], "52": [["dateVerse", "Friday, February 21", "Psalm 28", "2 Chronicles 31", "Acts 25:1-15"], ["watchD", "Shepherd your people with your staff. Micah 7:14"], ["docT", "Christ himself granted that some are apostles, prophets, evangelists, pastors, and teachers to equip the saints for the work of ministry, for building up the body of Christ. Ephesians 4:11-12"], ["prayer", "Shepherd of souls, call us out of the sheepfold, the comfortable places of safety in our lives, that we might go out into the world with curiosity to discover the ways your love shows up. You don’t just call us to follow, you invite us to lead others to discover you in unexpected places. Amen."]], "53": [["dateVerse", "Saturday, February 22", "Psalm 29", "2 Chronicles 32", "Acts 25:16-26:1"], ["watchD", "Justice, and only justice, you shall pursue, so that you may live. Deuteronomy 16:20"], ["docT", "Jesus said, “Blessed are those who hunger and thirst for righteousness, for they will be filled.” Matthew 5:6"], ["prayer", "Righteous and forgiving Savior, lead us daily on a path toward justice for all our brothers and sisters everywhere. Help us to always remember your commandment to love one another as you have loved us. Amen."]], "54": [["info", "Seventh Sunday after Epiphany"], ["watchO", "Watchword for the week — Jesus said, “Be merciful, just as your Father is merciful.” Luke 6:36"], ["dateVerse", "Sunday, February 23", "Genesis 45:3-11,15", "Psalm 37:1-11,39-40", "1 Corinthians 15:35-38,42-50", "Luke 6:27-38"], ["watchD", "The Lord said, “Then I will encamp at my house as a guard.” Zechariah 9:8"], ["docT", "Jesus got up and rebuked the wind and the raging waters; the storm subsided, and all was calm. “Where is your faith?” he asked his disciples. Luke 8:24-25 NIV"], ["prayer", "Redeeming and loving God, strengthen our hearts and souls in the face of life’s challenges, dangers, turmoil, and stresses. Remind us to keep our faith strong in your resurrected son, Jesus Christ, our Lord, until he comes again. Amen."]], "55": [["dateVerse", "Monday, February 24", "Psalm 30:1-5", "2 Chronicles 33:1-34:7", "Acts 26:2-14"], ["watchD", "You drink wine by the bowlful and use the finest lotions, but you do not grieve over the ruin of Joseph. Amos 6:6 NIV"], ["docT", "Do not get drunk with wine, for that is debauchery, but be filled with the Spirit. Ephesians 5:18"], ["prayer", "Holy Spirit, steer us away from the temptations and distractions of life. Direct our thoughts and actions to your children in need, offering in your name your faithful care, love, comfort, presence, and reassurance. Amen."]], "56": [["dateVerse", "Tuesday, February 25", "Psalm 30:6-12", "2 Chronicles 34:8-33", "Acts 26:15-27"], ["watchD", "The Lord is my strength and my might; he has become my salvation. Psalm 118:14"], ["docT", "Are any among you suffering? They should pray. Are any cheerful? They should sing songs of praise. James 5:13"], ["prayer", "Almighty God, you are our strength and salvation. In our prayers, we seek solace from suffering; in our songs, we offer you our praise and thanksgiving. Guide us in helping others find joy and hope in reaching out to you. In your name, we pray. Amen."]], "57": [["dateVerse", "Wednesday, February 26", "Psalm 31:1-5", "2 Chronicles 35", "Acts 26:28-27:8"], ["watchD", "Who has directed the Spirit of the Lord or as his counselor has instructed him? Isaiah 40:13"], ["docT", "Jesus said, “The wind blows where it chooses, and you hear the sound of it, but you do not know where it comes from or where it goes. So it is with everyone who is born of the Spirit.” John 3:8"], ["prayer", "Gentle Wind, we long to feel your presence throughout our days. We sometimes lack the faith and vision to see your works and learn your ways, yet, deep down, we sense your Spirit guiding all that surrounds us. May we never feel apart from you. In the name of the Spirit, we pray. Amen."]], "58": [["dateVerse", "Thursday, February 27", "Psalm 31:6-9", "2 Chronicles 36", "Acts 27:9-20"], ["watchD", "Samuel said to the people, “Serve the Lord with all your heart, and do not turn aside after useless things that cannot profit or save, for they are useless.” 1 Samuel 12:20-21"], ["docT", "So do not be foolish, but understand what the will of the Lord is. Ephesians 5:17"], ["prayer", "Loving Lord, our hearts are yours. You shower us with all that is good and comfort us in our sorrows. Help us to recognize your will as our own and to turn away from all that deters us from your service. In your holy name, we pray. Amen."]], "59": [["dateVerse", "Friday, February 28", "Psalm 31:10-20", "Ezra 1,2", "Acts 27:21-38"], ["watchD", "You let people ride over our heads; we went through fire and through water; yet you have brought us out to a spacious place. Psalm 66:12"], ["docT", "We are persecuted but not forsaken, struck down but not destroyed, always carrying around in the body the death of Jesus, so that the life of Jesus may also be made visible in our bodies. 2 Corinthians 4:9-10"], ["prayer", "Uplifting Savior, you are present with us in our trials and tribulations, our fears and doubts, our suffering and hardships. In your death and resurrection, we receive the promise of everlasting life. We pray that we can carry the hope your love provides in our bodies forevermore. Amen."]], "60": [["info", "March 1, 1457:"], ["info", "Beginning of the Unity of the Brethren in Bohemia"], ["dateVerse", "Saturday, March 1", "Psalm 31:21-24", "Ezra 3", "Acts 27:39-28:6"], ["watchD", "Remember the former things of old, for I am God, and there is no other; I am God, and there is no one like me. Isaiah 46:9"], ["docT", "“I am the Alpha and the Omega,” said the Lord God, who is and who was and who is to come, the Almighty. Revelation 1:8"], ["prayer", "Eternal God, as we mark the beginning of our global church, we know that our faith history is but a moment in your creation. Yet you give us each these moments to blossom and live abundant lives. Let it be so! Amen."]], "61": [["info", "Last Sunday after Epiphany "], ["info", "Transfiguration of our Lord"], ["watchO", "Watchword for the week — And when they looked up, they saw no one except Jesus alone. Matthew 17:8"], ["dateVerse", "Sunday, March 2", "Exodus 34:29-35", "Psalm 99", "2 Corinthians 3:12-4:2", "Luke 9:28-36,(37-43)"], ["watchD", "In his love and pity, it was the Lord who redeemed them; he lifted them up and carried them all the days of old. Isaiah 63:9"], ["docT", "There were two blind men sitting by the roadside. When they heard that Jesus was passing by, they shouted, “Lord, have mercy on us, Son of David!” Matthew 20:30"], ["prayer", "In the mountaintops and the valleys of life, wherever we are, O Lord, let us call upon you, for your grace, mercy, and peace will lift us up. In Jesus’ holy name, we pray. Amen."]], "62": [["dateVerse", "Monday, March 3", "Psalm 32", "Ezra 4", "Acts 28:7-16"], ["watchD", "Search me, O God, and know my heart; test me and know my thoughts. See if there is any wicked way in me, and lead me in the way everlasting. Psalm 139:23-24"], ["docT", "The gate is narrow and the road is hard that leads to life. Matthew 7:14"], ["prayer", "Life-giving Savior, all we have is from you. Remind us when we doubt ourselves. Renew us when we fail others. Reengage us when we are weary in body, mind, and spirit. For your love’s sake. Amen."]], "63": [["dateVerse", "Tuesday, March 4", "Psalm 33:1-5", "Ezra 5:1-6:12", "Acts 28:17-31"], ["watchD", "“Sing and rejoice, O daughter Zion! For I will come and dwell in your midst,” said the Lord. Zechariah 2:10"], ["docT", "When Jesus entered Jerusalem, the whole city was in turmoil, asking, “Who is this?” Matthew 21:10"], ["prayer", "Lord Jesus, when have we failed to recognize you dwelling among us? Open our eyes to see your presence in our neighbor. Open our hearts to let you in. Open our spirits for new ways to understand your eternal presence. Amen."]], "64": [["info", "Ash Wednesday"], ["dateVerse", "Wednesday, March 5", "Psalm 33:6-11", "Ezra 6:13-7:28", "Romans 1:1-12"], ["specialVerse", "Ash Wednesday", "Joel 2:1-2,12-17", "Psalm 51:1-17", "2 Corinthians 5:20b-6:10", "Matthew 6:1-6,16-21"], ["watchD", "Your sins have hidden his face from you so that he does not hear. Isaiah 59:2"], ["docT", "The wages of sin is death, but the free gift of God is eternal life in Christ Jesus our Lord. Romans 6:23"], ["prayer", "Forgiving God, you show us amazing grace. Turn your face from our sins and blot out all our iniquities. In humility and with repentance, let us return to you this day and throughout our Lenten journey. Amen."]], "65": [["dateVerse", "Thursday, March 6", "Psalm 33:12-22", "Ezra 8:1-20", "Romans 1:13-25"], ["watchD", "“From the rising of the sun to its setting my name is great among the nations,” said the Lord of hosts. Malachi 1:11"], ["docT", "Jesus said, “Many will come from east and west and will take their places at the banquet with Abraham and Isaac and Jacob in the kingdom of heaven.” Matthew 8:11"], ["prayer", "God of hope, as the sun will rise today, may our lives be ever orientated to the possibilities ahead of us. Lifting high the hope of God’s never-failing love, let us march forward this day. Amen."]], "66": [["dateVerse", "Friday, March 7", "Psalm 34:1-7", "Ezra 8:21-10:6", "Romans 1:26-2:4"], ["watchD", "When words are many, transgression is not lacking, but the prudent are restrained in speech. Proverbs 10:19"], ["docT", "Jesus said, “Let your word be ‘Yes, Yes’ or ‘No, No’; anything more than this comes from the evil one.” Matthew 5:37"], ["prayer", "Christ, eternal word, remind us to always center our words in you and speak from places of love. Forgive us when we are quick to respond with a cutting word or a cruel retort. Center our words in your eternal truth. Amen."]], "67": [["dateVerse", "Saturday, March 8", "Psalm 34:8-18", "Ezra 10:7-44", "Romans 2:5-16"], ["watchD", "Thus said the Lord: Seek me and live. Amos 5:4"], ["docT", "Simon Peter answered Jesus, “Lord, to whom can we go? You have the words of eternal life.” John 6:68"], ["prayer", "God of the eternal covenant, you search and seek us, even when we shut the doors of our hearts. Let us seek you, knowing that it is in the journey toward you that we find new life. Amen."]], "68": [["info", "First Sunday in Lent"], ["watchO", "Watchword for the week — No one who believes in Christ will be put to shame. Romans 10:11"], ["dateVerse", "Sunday, March 9", "Deuteronomy 26:1-11", "Psalm 91:1-2,9-16", "Romans 10:8b-13", "Luke 4:1-13"], ["watchD", "Let the hearts of those who seek the Lord rejoice. Psalm 105:3"], ["docT", "May the God of hope fill you with all joy and peace in believing, so that you may abound in hope by the power of the Holy Spirit. Romans 15:13"], ["prayer", "Forgive us, Lord, when we forget that believing is not seeing. Rather, it is living with hope and seeking your presence in our journeys that we find faith. As we seek, may we be filled with joy, peace, and hope, ever mindful of the Spirit’s power within. Amen."]], "69": [["dateVerse", "Monday, March 10", "Psalm 34:19-22", "Nehemiah 1:1-2:10", "Romans 2:17-3:2"], ["watchD", "I will both lie down and sleep in peace, for you alone, O Lord, make me lie down in safety. Psalm 4:8"], ["docT", "Jesus said, “Peace I leave with you; my peace I give to you. I do not give to you as the world gives. Do not let your hearts be troubled, and do not let them be afraid.” John 14:27"], ["prayer", "Abiding God, with each breath, may we bring your peace into our spirit. When we exhale, may your peace enter our world through the words and actions of our lives. We pray in Jesus’ name. Amen."]], "70": [["dateVerse", "Tuesday, March 11", "Psalm 35:1-10", "Nehemiah 2:11-3:32", "Romans 3:3-18"], ["watchD", "Joshua said to the people, “You are witnesses against yourselves that you have chosen the Lord, to serve him.” And they said, “We are witnesses.” Joshua 24:22"], ["docT", "Therefore, brothers and sisters, be all the more eager to confirm your call and election, for if you do this, you will never stumble. For in this way, entry into the eternal kingdom of our Lord and Savior Jesus Christ will be richly provided for you. 2 Peter 1:10-11"], ["prayer", "God of all ages, in life, death, and the life to come, you are our creator and sustainer. Whether we live or die, may our witness and service to others always point to you and the present and coming kingdom of God. Amen."]], "71": [["dateVerse", "Wednesday, March 12", "Psalm 35:11-18", "Nehemiah 4", "Romans 3:19-31"], ["watchD", "In those days and at that time, says the Lord, the iniquity of Israel shall be sought, and there shall be none, and the sins of Judah, and none shall be found, for I will pardon the remnant that I have spared. Jeremiah 50:20"], ["docT", "By his wounds you have been healed. 1 Peter 2:24"], ["prayer", "This season of Lent is for returning to you, Lord Jesus. Remembering your sacrifice, we confess our shortcomings and transgressions, yet also remember your forgiveness as we are received anew. Amen."]], "72": [["dateVerse", "Thursday, March 13", "Psalm 35:19-28", "Nehemiah 5:1-6:14", "Romans 4:1-12"], ["watchD", "Noah found favor in the sight of the Lord. Genesis 6:8"], ["docT", "You are a chosen people, a royal priesthood, a holy nation, God’s own people, in order that you may proclaim the excellence of him who called you out of darkness into his marvelous light. 1 Peter 2:9"], ["prayer", "O life-affirming Creator, how often we forget that we are your beloved creation: chosen, created, and named, as you proclaimed, “It is good.” Call us out of our doubts and our fears to live with you. Amen."]], "73": [["dateVerse", "Friday, March 14", "Psalm 36", "Nehemiah 6:15-7:73a", "Romans 4:13-25"], ["watchD", "The Lord will become king over all the earth; on that day the Lord will be one and his name one. Zechariah 14:9"], ["docT", "The same Lord is Lord of all and is generous to all who call on him. Romans 10:12"], ["prayer", "One who goes by many names, but is our Lord and Savior, center us now. Whether we labor or rest, you are the God who is within, above, before, and behind us—graciously leading us with your abiding love. Amen."]], "74": [["dateVerse", "Saturday, March 15", "Psalm 37:1-6", "Nehemiah 7:73b-8:18", "Romans 5:1-11"], ["watchD", "You shall be called by a new name that the mouth of the Lord will give. Isaiah 62:2"], ["docT", "So if anyone is in Christ, there is a new creation: everything old has passed away; look, new things have come into being! 2 Corinthians 5:17"], ["prayer", "Gracious God, awaken our hearts to see the glorious beauty in this new day. Refresh our minds and renew our spirits, as we accept the gift of new beginnings. Give us courage to start over as we trust in your goodness and love. Thank you for the hope and promise of new life in Jesus Christ, our redeemer. Amen."]], "75": [["info", "Second Sunday in Lent"], ["watchO", "Watchword for the week — The Lord is my light and my salvation; whom shall I fear? Psalm 27:1"], ["dateVerse", "Sunday, March 16", "Genesis 15:1-12,17-18", "Psalm 27", "Philippians 3:17-4:1", "Luke 13:31-35"], ["watchD", "As for me, I said in my prosperity, “I shall never be moved.” You hid your face; I was dismayed. Psalm 30:6,7"], ["docT", "Jesus said, “You have pain now, but I will see you again, and your hearts will rejoice, and no one will take your joy from you.” John 16:22"], ["prayer", "O God of mercy, forgive our stubborn and prideful hearts. So often, when our lives are easy, we forget to thank you. Yet, when our hearts are broken and we feel lost, we remember you and seek your guidance and strength. Shepherd of our souls, increase our dependence upon you. Grant us faith to declare, “It is well with my soul.” Amen."]], "76": [["dateVerse", "Monday, March 17", "Psalm 37:7-15", "Nehemiah 9:1-10:27", "Romans 5:12-6:4"], ["watchD", "Who is a God like you, pardoning iniquity and passing over the transgression of the remnant of his possession? He does not retain his anger forever because he delights in showing steadfast love. Micah 7:18"], ["docT", "Mary said, “God has come to the aid of his child Israel, in remembrance of his mercy.” Luke 1:54"], ["prayer", "Precious Savior, your tender mercy surpasses human understanding. Through your sacrificial death on the cross, you forgave us and paid the debt for our sins. Through your resurrection, you promised us the gift of abiding with you forever. May we surrender our hearts to you so we may come to know the immeasurable riches of your grace through your kindness and love toward us in Christ Jesus. Amen."]], "77": [["dateVerse", "Tuesday, March 18", "Psalm 37:16-22", "Nehemiah 10:28-11:36", "Romans 6:5-16"], ["watchD", "O Lord, my strength and my stronghold, my refuge in the day of trouble. Jeremiah 16:19"], ["docT", "Paul wrote: I know the one in whom I have put my trust, and I am sure that he is able to guard the deposit I have entrusted to him. 2 Timothy 1:12"], ["prayer", "Almighty God, support and sustain us when we are afraid. Protect us from danger and rescue us from despair. Forgive us for not trusting in your constant presence. Guide us in the choices we make, and help us to place our confidence in you, O Lord, and only in you. In your gracious name, we pray. Amen."]], "78": [["dateVerse", "Wednesday, March 19", "Psalm 37:23-26", "Nehemiah 12:1-43", "Romans 6:17-7:6"], ["watchD", "Job answered the Lord, “See, I am of small account; what shall I answer you? I lay my hand on my mouth.” Job 40:3-4"], ["docT", "Paul wrote: Now I know only in part; then I will know fully, even as I have been fully known. 1 Corinthians 13:12"], ["prayer", "Awesome God, you are the creator of all things. Although we are made in your image, we are limited in what we can see and understand. Teach us, inspire us, and fill us with your Spirit, so that despite our weakness, we can answer your call to serve you. In Jesus’ name, we pray. Amen."]], "79": [["dateVerse", "Thursday, March 20", "Psalm 37:27-33", "Nehemiah 12:44-13:14", "Romans 7:7-20"], ["watchD", "On the day I called, you answered me; you increased my strength of soul. Psalm 138:3"], ["docT", "Jesus said, “For everyone who asks receives, and everyone who searches finds, and for everyone who knocks, the door will be opened.” Luke 11:10"], ["prayer", "Gracious God, you are always with us. When we call out to you in our moments of distress, you hear us and lovingly lead us beside still waters. Come into our hearts and embrace us with your gentle presence. Grant us strength and courage as we share this message of your eternal and abiding love. Amen."]], "80": [["dateVerse", "Friday, March 21", "Psalm 37:34-40", "Nehemiah 13:15-31", "Romans 7:21-8:8"], ["watchD", "To the humble the Lord shows favor. Proverbs 3:34"], ["docT", "A dispute also arose among them as to which one of them was to be regarded as the greatest. But Jesus said to them, “The kings of the gentiles lord it over them, and those in authority over them are called benefactors. But not so with you; rather, the greatest among you must become like the youngest and the leader like one who serves.” Luke 22:24-26"], ["prayer", "Almighty God, forgive us when we have not humbled ourselves before you and before our neighbor. Quiet our minds so we can be still and hear your voice. Inspire us to serve as we model the compassionate love of Jesus, and may our words and actions be pleasing to you. In your holy name, we pray. Amen."]], "81": [["dateVerse", "Saturday, March 22", "Psalm 38:1-8", "Esther 1", "Romans 8:9-19"], ["watchD", "The Lord said, “And afterward, I will pour out my Spirit on all people.” Joel 2:28 NIV"], ["docT", "Peter said, “Jesus, being therefore exalted at the right hand of God and having received from the Father the promise of the Holy Spirit, he has poured out this that you see and hear.” Acts 2:33"], ["prayer", "Spirit of the living God, thank you for your holy presence. It is so easy to fill our lives with matters of this world. Grant us wisdom and discernment and fill our hearts and minds with renewed vision, so we can more clearly see the life to which you have called us. In your holy name, we pray. Amen."]], "82": [["info", "Third Sunday in Lent"], ["watchO", "Watchword for the week — Seek the Lord while he may be found, call upon him while he is near. Isaiah 55:6"], ["dateVerse", "Sunday, March 23", "Isaiah 55:1-9", "Psalm 63:1-8", "1 Corinthians 10:1-13", "Luke 13:1-9"], ["watchD", "I will sing aloud of your steadfast love in the morning. For you have been a fortress for me and a refuge in the day of my distress. Psalm 59:16"], ["docT", "Paul wrote: To this day I have had help from God, and so I stand here, testifying to both small and great. Acts 26:22"], ["prayer", "Gracious God, help us to sing aloud of your great and eternal love. Equip us, Lord, and fill us with gifts from your spirit, so that we can witness to our neighbor and make known to all, of your deep and abiding love, both now and evermore. Amen."]], "83": [["dateVerse", "Monday, March 24", "Psalm 38:9-16", "Esther 2:1-18", "Romans 8:20-33"], ["watchD", "Samuel said, “It is the Lord; let him do what seems good to him.” 1 Samuel 3:18"], ["docT", "Jesus said to them, “Come and have breakfast.” Now none of the disciples dared to ask him, “Who are you?” because they knew it was the Lord. John 21:12"], ["prayer", "Gracious Lord, remind us that you are our Lord, and you are always with us. Draw us closer to you as we learn to recognize your presence. Help us be faithful to your leading. We praise you for your goodness and love and for your tender mercy in our lives. Amen."]], "84": [["dateVerse", "Tuesday, March 25", "Psalm 38:17-22", "Esther 2:19-3:15", "Romans 8:34-9:7"], ["watchD", "Noah was a righteous man, blameless in his generation; Noah walked with God. Genesis 6:9"], ["docT", "As he who called you is holy, be holy yourselves in all your conduct. 1 Peter 1:15"], ["prayer", "Holy God, you call us to live our lives in service to you. Help us to walk with you in righteousness and holiness as we surrender our hearts and minds, serving you with joyful obedience. Give us the peace to know that all will be well. Amen."]], "85": [["dateVerse", "Wednesday, March 26", "Psalm 39:1-6", "Esther 4,5", "Romans 9:8-21"], ["watchD", "This poor soul cried and was heard by the Lord and was saved from every trouble. Psalm 34:6"], ["docT", "Jesus said, “Come to me, all you who are weary and are carrying heavy burdens, and I will give you rest.” Matthew 11:28"], ["prayer", "God of comfort, you know our deep sadness and weariness. You hear our cries and see our heavy burdens. Because of your profound love for us, you offer to take our grief and pain, and in their place, give our souls a quiet stillness and a peaceful resting place until we are united with you in joyful bliss. Amen."]], "86": [["dateVerse", "Thursday, March 27", "Psalm 39:7-13", "Esther 6,7", "Romans 9:22-33"], ["watchD", "Bless God in the great congregation. Psalm 68:26"], ["docT", "Day by day, as they spent much time together in the temple, they broke bread at home and ate their food with glad and generous hearts, praising God and having the goodwill of all the people. Acts 2:46-47"], ["prayer", "God of all creation, we bow before you with praise and adoration. May your Holy Spirit work within us to keep our minds and hearts focused on you. As we live in community with others, help us to reflect your goodness and love so that our entire lives can be an offering of thanksgiving. Amen."]], "87": [["dateVerse", "Friday, March 28", "Psalm 40:1-8", "Esther 8:1-9:17", "Romans 10:1-13"], ["watchD", "Like birds hovering overhead, so the Lord of hosts will protect Jerusalem; he will protect and deliver it; he will spare and rescue it. Isaiah 31:5"], ["docT", "Jesus said to the disciples, “Go rather to the lost sheep of the house of Israel. As you go, proclaim the good news, ‘The kingdom of heaven has come near.’” Matthew 10:6-7"], ["prayer", "Loving Shepherd, you hold us tenderly in your embrace. Just as we have received your protection and comfort, open our eyes to those around us, and grant us courage to proclaim the good news, so that they, too, may know the grace and hope of your eternal love. Yea, our lot is blessed. Alleluia! Amen."]], "88": [["dateVerse", "Saturday, March 29", "Psalm 40:9-17", "Esther 9:18-10:3", "Romans 10:14-11:6"], ["watchD", "The Lord is in his holy temple; let all the earth keep silence before him! Habakkuk 2:20"], ["docT", "Jesus was teaching and saying, “Is it not written, ‘My house shall be called a house of prayer for all the nations’?” Mark 11:17"], ["prayer", "Most holy Lord and God, fill us with your spirit as we seek your presence with reverence and awe. Forgive us when we act foolishly and ignore your still, small voice that guides our hearts and minds into making decisions that honor you. Create in us a deep desire to give you our best as we praise you in our places of worship, and in how we interact with others. In Jesus’ name, we pray. Amen."]], "89": [["info", "Fourth Sunday in Lent"], ["watchO", "Watchword for the week — If anyone is in Christ, there is a new creation: everything old has passed away; see, everything has become new! 2 Corinthians 5:17"], ["dateVerse", "Sunday, March 30", "Joshua 5:9-12", "Psalm 32", "2 Corinthians 5:16-21", "Luke 15:1-3,11b-32"], ["watchD", "He is the Lord our God; his judgments are in all the earth. Psalm 105:7"], ["docT", "Blessed are those who are persecuted for the sake of righteousness, for theirs is the kingdom of heaven. Matthew 5:10"], ["prayer", "Holy God, nothing can separate us from your love. Provide us patience and peace amidst our suffering, and forgive us when we are the reason for someone else’s suffering. With Jesus as our model, guide us in humility and righteousness. Inspire us to live in faith as we boldly approach your eternal throne and claim your crown. Through Jesus Christ, we pray. Amen."]], "90": [["dateVerse", "Monday, March 31", "Psalm 41", "Job 1,2", "Romans 11:7-18"], ["watchD", "All your works shall give thanks to you, O Lord, and all your faithful shall bless you. Psalm 145:10"], ["docT", "With gratitude in your hearts sing psalms, hymns, and spiritual songs to God. Colossians 3:16"], ["prayer", "Creator God, we offer you our hymns of praise and thanksgiving. We thank you for the many ways that you bless us and shower us with your unconditional love and grace. Most of all, we thank you for the gift of Christ Jesus, who is the resurrection and the life. Amen."]], "91": [["dateVerse", "Tuesday, April 1", "Psalm 42", "Job 3,4", "Romans 11:19-32"], ["watchD", "The Lord upholds the cause of the oppressed and gives food to the hungry. Psalm 146:7 NIV"], ["docT", "He who supplies seed to the sower and bread for food will supply and multiply your seed for sowing and increase the harvest of your righteousness. 2 Corinthians 9:10"], ["prayer", "Divine Supplier, thank you for the gift of nourishment, filling not only our mouths, but our hearts and minds with the fruit of your love, justice, and compassion. Grant that every tongue and heart may know of your abundant love and mercy. Amen."]], "92": [["dateVerse", "Wednesday, April 2", "Psalm 43", "Job 5,6", "Romans 11:33-12:8"], ["watchD", "“A son honors his father. If then I am a father, where is the honor due me?” said the Lord. Malachi 1:6"], ["docT", "Blessed be the God and Father of our Lord Jesus Christ, the Father of mercies and the God of all consolation. 2 Corinthians 1:3"], ["prayer", "Honorable and graceful Potter, you formed us from clay and continue to mold us, even as we deform and unravel ourselves. We thank you for your infinite mercy, wisdom, and constant guiding hands. Shape us into useful servants. Amen."]], "93": [["dateVerse", "Thursday, April 3", "Psalm 44:1-8", "Job 7", "Romans 12:9-21"], ["watchD", "My people have committed two evils: they have forsaken me, the fountain of living water, and dug out cisterns for themselves, cracked cisterns that can hold no water. Jeremiah 2:13"], ["docT", "Jesus said, “Those who drink of the water that I will give them will never be thirsty. The water that I will give will become in them a spring of water gushing up to eternal life.” John 4:14"], ["prayer", "Source of life, grant us the faith to take the cup of everlasting life and mercy given to us, and grant us the courage to take a sip and live as you intend, knowing that we are never far from your love. Amen."]], "94": [["dateVerse", "Friday, April 4", "Psalm 44:9-16", "Job 8", "Romans 13"], ["watchD", "You will again have compassion on us; you will hurl all our iniquities into the depths of the sea. Micah 7:19 NIV"], ["docT", "If we confess our sins, he who is faithful and just will forgive us our sins and cleanse us from all unrighteousness. 1 John 1:9"], ["prayer", "Compassionate Shepherd, guide us with your crook of mercy and forgiveness into a life of truth and repentance. May we follow your path faithfully and embody your example of agape love with every step we take. In the name of Jesus, we pray. Amen."]], "95": [["dateVerse", "Saturday, April 5", "Psalm 44:17-26", "Job 9", "Romans 14:1-12"], ["watchD", "The Lord makes poor and makes rich; he brings low; he also exalts. 1 Samuel 2:7"], ["docT", "I say to everyone among you not to think of yourself more highly than you ought to think but to think with sober judgment, each according to the measure of faith that God has assigned. Romans 12:3"], ["prayer", "O Jesus, guardian of our souls, sing to us that we may hear and receive your love and glory. Humble us in your presence, and teach us to serve our neighbors in need, lifting them up above ourselves. Amen."]], "96": [["info", "Fifth Sunday in Lent"], ["watchO", "Watchword for the week — Forgetting what lies behind and straining forward to what lies ahead, I press on toward the goal for the prize of the heavenly call of God in Christ Jesus. Philippians 3:13,14"], ["dateVerse", "Sunday, April 6", "Isaiah 43:16-21", "Psalm 126", "Philippians 3:4b-14", "John 12:1-8"], ["watchD", "Bring the homeless poor into your house. Isaiah 58:7"], ["docT", "And the king will answer them, ‘Truly I tell you, just as you did it to one of the least of these brothers and sisters of mine, you did it to me.’ Matthew 25:40"], ["prayer", "Our Chief Elder, govern our lives with love and open our hearts to the poor, the broken-hearted, and the lost. Lead us in the way of life and peace. Create in us a spirit of boldness and lead us into your way of willing sacrifice for others. Amen."]], "97": [["dateVerse", "Monday, April 7", "Psalm 45:1-9", "Job 10", "Romans 14:13-15:2"], ["watchD", "The Lord works vindication and justice for all who are oppressed. Psalm 103:6"], ["docT", "Anyone, then, who knows the right thing to do and fails to do it commits sin. James 4:17"], ["prayer", "Bringer of truth and justice, not only do you forgive and heal, not only do you satisfy and renew, but you also bring justice and righteousness. Give us the courage to pursue change and justice for the othered in society; help us to do what is right in your sight. Amen."]], "98": [["dateVerse", "Tuesday, April 8", "Psalm 45:10-17", "Job 11:1-12:12", "Romans 15:3-16"], ["watchD", "The Lord your God is gracious and merciful and will not turn away his face from you, if you return to him. 2 Chronicles 30:9"], ["docT", "Jesus said to Simon, “I have prayed for you that your own faith may not fail, and you, when once you have turned back, strengthen your brothers.” Luke 22:32"], ["prayer", "Merciful Lord, in a world of hurt and sickness, bestow on us the strength to endure and press on. Raise your thunderous voice of mercy over the cries of evil and hatred. Rally your servants, calling us each by name and sanctifying us to become messengers by abundant love and grace. Amen."]], "99": [["dateVerse", "Wednesday, April 9", "Psalm 46", "Job 12:13-13:19", "Romans 15:17-29"], ["watchD", "Those who look to him are radiant; their faces are never covered with shame. Psalm 34:5 NIV"], ["docT", "Jesus said, “I have set you an example, that you also should do as I have done to you.” John 13:15"], ["prayer", "Blessed Teacher, you set the example of love and sacrifice that we must follow. Shine through us as we endeavor to meet people where they are, whether in broken-heartedness, loneliness, poverty, or homelessness. May we bring them your loving and life-sustaining compassion. Amen."]], "100": [["dateVerse", "Thursday, April 10", "Psalm 47", "Job 13:20-14:22", "Romans 15:30-16:7"], ["watchD", "It is in your hand, O Lord, to make great and to give strength to all. 1 Chronicles 29:12"], ["docT", "Humble yourselves, therefore, under the mighty hand of God, so that he may exalt you in due time. 1 Peter 5:6"], ["prayer", "Almighty God, your hands are mighty, but the touch of your mercy is gentle and sure. Surround us in your wings of refuge, guide us steadily with strength and resolve, and bestow the wondrous blessings of your love upon us, your humble servants. Amen."]], "101": [["dateVerse", "Friday, April 11", "Psalm 48", "Job 15,16", "Romans 16:8-20"], ["watchD", "Your kingdom is an everlasting kingdom, and your dominion endures throughout all generations. Psalm 145:13"], ["docT", "John wrote: I heard every creature in heaven and on earth and under the earth and in the sea and all that is in them, singing, “To the one seated on the throne and to the Lamb be blessing and honor and glory and might forever and ever!” Revelation 5:13"], ["prayer", "Gracious God, your everlasting love is undeniable. Thank you for being the constant, abiding presence in our world of rapid change. Blessing, honor, glory, and power are yours, our God, forever. Be with us always. Amen."]], "102": [["dateVerse", "Saturday, April 12", "Psalm 49:1-12", "Job 17,18", "Romans 16:21-1", "Corinthians 1:1-9"], ["watchD", "Joshua fell on his face to the earth and worshiped, and he said to him, “What do you command your servant, my lord?” Joshua 5:14"], ["docT", "Saul asked, “Who are you, Lord?” The Lord answered, “I am Jesus whom you are persecuting. But get up and stand on your feet, for I have appeared to you for this purpose, to appoint you to serve and testify to the things in which you have seen me and to those in which I will appear to you.” Acts 26:15-16"], ["prayer", "Bread of life, fill us anew with purpose and courage. Feed us, your people in the wilderness. Work with us and within us, your servants on bended knee, as we testify to your glory and love. Alleluia. Amen!"]], "103": [["info", "Palm Sunday"], ["watchO", "Watchword for the week — Let those who fear the Lord say, “His steadfast love endures forever.” Psalm 118:4"], ["dateVerse", "Sunday, April 13", "Isaiah 50:4-9a", "Psalm 118:1-2,19-29", "Philippians 2:5-11", "Luke 19:28-40,22:14-23:56"], ["watchD", "You shall not cheat one another, but you shall fear your God. Leviticus 25:17"], ["docT", "Let the same mind be in you that was in Christ Jesus. Philippians 2:5"], ["prayer", "Blessed Jesus, majestic and humble, you stir our hearts with divine love. Your sacrifice is immeasurable. Your triumphs ring pure. Grant us the courage to enter Jerusalem with you and bear our crosses each day. In your name, we pray. Amen."]], "104": [["dateVerse", "Monday, April 14", "Psalm 49:13-20", "Job 19", "1 Corinthians 1:10-20"], ["watchD", "The earth is full of the steadfast love of the Lord. Psalm 33:5"], ["docT", "Barnabas and Paul said, “God has not left himself without a witness in doing good, giving you rains from heaven and fruitful seasons and filling you with food and your hearts with joy.” Acts 14:17"], ["prayer", "Creator of heaven and earth, the bounties of your love are breathtaking and boundless! We thank you for nourishing and protecting us. May our life-long service wield wisely the gifts and blessings you have bestowed upon us. Amen."]], "105": [["dateVerse", "Tuesday, April 15", "Psalm 50:1-6", "Job 20", "1 Corinthians 1:21-2:2"], ["watchD", "Since the wise have rejected the word of the Lord, what wisdom is in them? Jeremiah 8:9"], ["docT", "Where is the one who is wise? Where is the scholar? Where is the debater of this age? Has not God made foolish the wisdom of the world? 1 Corinthians 1:20"], ["prayer", "You who call us, we ask for true wisdom and purpose. Entrust us with your words of guidance and encouragement. Present us with a call, that, like Samuel, we might be quick to respond and swift to follow. Amen."]], "106": [["dateVerse", "Wednesday, April 16", "Psalm 50:7-15", "Job 21", "1 Corinthians 2:3-16"], ["watchD", "As for mortals, their days are like grass; they flourish like a flower of the field; for the wind passes over it, and it is gone. But the steadfast love of the Lord is from everlasting to everlasting. Psalm 103:15-16,17"], ["docT", "For the perishable must clothe itself with the imperishable, and the mortal with immortality. 1 Corinthians 15:53 NIV"], ["prayer", "Dear everlasting God, as we walk through Holy Week with Christ, we thank you for your willing and immeasurable sacrifice, your constant presence among us, and your ever- moving Holy Spirit. Unite us, the body of Christ, in your coming kingdom. Amen."]], "107": [["info", "Maundy Thursday"], ["watchO", "Watchword for Maundy Thursday — He has gained renown by his wonderful deeds; the Lord is gracious and merciful. Psalm 111:4"], ["dateVerse", "Thursday, April 17", "Psalm 50:16-23", "Job 22,23", "1 Corinthians 3:1-11"], ["watchD", "Nevertheless, I am continually with you; you hold my right hand. Psalm 73:23"], ["docT", "Jesus prayed, “Father, if you are willing, remove this cup from me, yet not my will but yours be done.” Then an angel from heaven appeared to him and gave him strength. Luke 22:42-43"], ["prayer", "Our Redeemer, you have invited us to your table, washed our feet with a loving and humble heart, and borne our burdens. Let us commit ourselves this day to be your strength. Let us take the cup of loving sacrifice and love one another as you have loved us. Amen."]], "108": [["info", "Good Friday"], ["watchO", "Watchword for Good Friday — For God so loved the world that he gave his only son, so that everyone who believes in him may not perish but may have eternal life. John 3:16"], ["dateVerse", "Friday, April 18", "Psalm 51:1-6", "Job 24", "1 Corinthians 3:12-23"], ["watchD", "He is named Wonderful Counselor, Mighty God, Everlasting Father, Prince of Peace. Isaiah 9:6"], ["docT", "In Christ, God was reconciling the world to himself, not counting their trespasses against them, and entrusting the message of reconciliation to us. 2 Corinthians 5:19"], ["prayer", "Prince of peace, we confess our faith this day as we remember your last breaths, your cries of anguish, and the blood spilling from your side. Bless and comfort us, gracious God. Remember us as you go into your kingdom. Amen."]], "109": [["dateVerse", "Saturday, April 19", "Psalm 51:7-12", "Job 25-27", "1 Corinthians 4:1-15"], ["watchD", "The Lord has sent me to proclaim the year of the Lord’s favor and the day of vengeance of our God. Isaiah 61:1,2"], ["docT", "He replied to the criminal, “Truly I tell you, today you will be with me in paradise.” Luke 23:43"], ["prayer", "Hear us, holy Jesus. Hear our anxious chatter in the anticipation of rejoicing Easter morning. Be near us in our time of mourning, waiting, and expectation. Join us again in triumph and victory with your life-changing, divine love. Amen."]], "110": [["info", "Easter"], ["watchO", "Watchword for the week — Why do you look for the living among the dead? Jesus is not here, but has risen. Luke 24:5"], ["dateVerse", "Sunday, April 20", "Acts 10:34-43", "Psalm 118:1-2,14-24", "1 Corinthians 15:19-26", "Luke 24:1-12"], ["watchD", "Hezekiah received the letter and read it; then Hezekiah went up to the house of the Lord and spread it before the Lord. 2 Kings 19:14"], ["docT", "Jesus took with him Peter and John and James and went up on the mountain to pray. Luke 9:28"], ["prayer", "Risen Jesus, we shout from the mountaintops that you have risen indeed! With victory and divine mystery, you bring salvation and the possibility of peace and blessing for all. Hosanna in the highest! Triumphant alleluias, we sing. Amen."]], "111": [["dateVerse", "Monday, April 21", "Psalm 51:13-19", "Job 28", "1 Corinthians 4:16-5:8"], ["watchD", "If you are returning to the Lord with all your heart, then put away the foreign gods from among you. 1 Samuel 7:3"], ["docT", "For us there is one God, the Father, from whom are all things and for whom we exist, and one Lord, Jesus Christ, through whom are all things and through whom we exist. 1 Corinthians 8:6"], ["prayer", "Holy Three-in-One, your tranquil, shepherding voice rings in our hearts, calling us by name, because no one is a stranger to you. Thank you for seeking us, for your grand pardon, and for your continual presence and assurance. Amen."]], "112": [["dateVerse", "Tuesday, April 22", "Psalm 52", "Job 29", "1 Corinthians 5:9-6:8"], ["watchD", "All we like sheep have gone astray; we have all turned to our own way, and the Lord has laid on him the iniquity of us all. Isaiah 53:6"], ["docT", "Christ himself bore our sins in his body on the cross, so that, having died to sins, we might live for righteousness. 1 Peter 2:24"], ["prayer", "Blessed Jesus, you have risen from the tomb victoriously. Your love is boundless and undeniable. Accept our humble and contrite hearts. Renew us in spirit and guide us as your hands and feet on this earth. Amen."]], "113": [["dateVerse", "Wednesday, April 23", "Psalm 53", "Job 30", "1 Corinthians 6:9-20"], ["watchD", "I am God Almighty; walk before me, and be blameless. Genesis 17:1"], ["docT", "Jesus said to Thomas, “Put your finger here and see my hands. Reach out your hand and put it in my side. Do not doubt but believe.” John 20:27"], ["prayer", "Rock of Ages, we are forever grateful for your gifts of strength and endurance. Build your Church on our testimonies to your changeless love, the wounds and scars you bear for us, and the foundation of Christ, the cornerstone. Amen."]], "114": [["dateVerse", "Thursday, April 24", "Psalm 54", "Job 31", "1 Corinthians 7:1-16"], ["watchD", "My heart rejoices in your salvation. Psalm 13:5 NIV"], ["docT", "They were astounded beyond measure, saying, “He has done everything well; he even makes the deaf to hear and the mute to speak.” Mark 7:37"], ["prayer", "Divine Healer, we are forever grateful for your presence among us, for the beauty of creation, and for our salvation. God, we need your healing. Lift up our neighbors in poverty and conflict, and let your boundless love reach every heart. Amen."]], "115": [["dateVerse", "Friday, April 25", "Psalm 55:1-8", "Job 32,33", "1 Corinthians 7:17-24"], ["watchD", "The Israelites said to Samuel, “Do not cease to cry out to the Lord our God for us, and pray that he may save us.” 1 Samuel 7:8"], ["docT", "Paul, in chains, wrote: I know that through your prayers and God’s provision of the Spirit of Jesus Christ what has happened to me will turn out for my deliverance. Philippians 1:19 NIV"], ["prayer", "Most gracious Lord, hear our cries of pain and anguish, hear our pleas for peace. Deliver us, your servants, from the struggles we endure: those that remain unspoken in our hearts, and those visible in our communities. We need you, Lord. Amen."]], "116": [["dateVerse", "Saturday, April 26", "Psalm 55:9-15", "Job 34:1-28", "1 Corinthians 7:25-40"], ["watchD", "The lover of money will not be satisfied with money, nor the lover of wealth with gain. Ecclesiastes 5:10"], ["docT", "We brought nothing into the world, so that we can take nothing out of it, but if we have food and clothing, we will be content with these. 1 Timothy 6:7-8"], ["prayer", "Bountiful Lord, thank you for always providing. You have given us forgiveness, community, belonging, and our daily bread along the way. We rejoice, not in earthly riches, but in the divine love and grace from you that we share. Amen."]], "117": [["info", "Second Sunday of Easter"], ["watchO", "Watchword for the week — Jesus said, “Peace be with you. As the Father has sent me, so I send you.” John 20:21"], ["dateVerse", "Sunday, April 27", "Acts 5:27-32", "Psalm 150", "Revelation 1:4-8", "John 20:19-31"], ["watchD", "I love the Lord because he has heard my voice and my supplications. Psalm 116:1"], ["docT", "Jesus tells a parable, “The slave fell on his knees before him, saying, ‘Have patience with me, and I will pay you everything.’ And out of pity for him, the lord of that slave released him and forgave him the debt.” Matthew 18:26-27"], ["prayer", "God, our strong salvation, though we are undeserving, you defend and deliver us. You seek us in the darkness and trouble we find. You heard our cries for mercy and gave your own son so that we may live. How great is our debt to you, O Lord. Amen."]], "118": [["dateVerse", "Monday, April 28", "Psalm 55:16-19", "Job 34:29-35:16", "1 Corinthians 8"], ["watchD", "Make haste to help me, O Lord, my salvation. Psalm 38:22"], ["docT", "Jesus asked the blind man, “What do you want me to do for you?” He said, “Lord, let me see again.” Jesus said to him, “Receive your sight; your faith has saved you.” Immediately he regained his sight and followed him, glorifying God. Luke 18:40-43"], ["prayer", "Omniscient God, guide of the blind, you know our hearts, our troubles, and our doubts. Grant us the faith and trust to take each subsequent step on the journey to everlasting life with you. Bless us with willing spirits and compassionate hearts to serve. Amen."]], "119": [["dateVerse", "Tuesday, April 29", "Psalm 55:20-23", "Job 36:1-26", "1 Corinthians 9:1-12a"], ["watchD", "It is a sin to despise one’s neighbor, but blessed is the one who is kind to the needy. Proverbs 14:21 NIV"], ["docT", "The Lord said, “When you have done all that you were ordered to do, say, ‘We are worthless slaves; we have done only what we ought to have done!’” Luke 17:10"], ["prayer", "Lamb of God, our all in all, be among us today. Give us tender hearts and inspire us to go the extra mile for all the weak and weary in spirit. Be the rock we build upon. Mold us as examples of service and unconditional love. Amen."]], "120": [["dateVerse", "Wednesday, April 30", "Psalm 56:1-8", "Job 36:27-37:24", "1 Corinthians 9:12b-27"], ["watchD", "Yours, O Lord, are the greatness, the power, the glory, the victory, and the majesty, for all that is in the heavens and on the earth is yours. 1 Chronicles 29:11"], ["docT", "God has made known to us the mystery of his will, according to his good pleasure that he set forth in Christ, as a plan for the fullness of time, to gather up all things in him, things in heaven and things on earth. Ephesians 1:9-10"], ["prayer", "O Ancient of days, grant us the faith to accept the many mysteries we cannot understand. Give us the courage to seek answers in Christ and to follow in his example. Though we are feeble and our bodies temporal, we praise your sustaining and life-giving Spirit. Amen."]], "121": [["dateVerse", "Thursday, May 1", "Psalm 56:9-13", "Job 38", "1 Corinthians 10:1-10"], ["watchD", "All his works are truth, and his ways are justice; he is able to bring low those who walk in pride. Daniel 4:37"], ["docT", "Now when the centurion who stood facing him saw that in this way he breathed his last, he said, “Truly this man was God’s Son!” Mark 15:39"], ["prayer", "Lord Jesus, may we take your model of humility as our example. We recognize that your way of truth and love leads each of us to God, to life eternal for the good of people and to the glory of God. Amen."]], "122": [["dateVerse", "Friday, May 2", "Psalm 57:1-6", "Job 39", "1 Corinthians 10:11-22"], ["watchD", "I will not fail you or forsake you. Joshua 1:5"], ["docT", "Suddenly the heavens were opened to Jesus and he saw God’s Spirit descending like a dove and alighting on him. Matthew 3:16"], ["prayer", "Faithful Father, God, we thank you for the assurances you give of your abiding love and care for us, and that you allow us to share your love and compassion with the world. Amen."]], "123": [["dateVerse", "Saturday, May 3", "Psalm 57:7-11", "Job 40", "1 Corinthians 10:23-11:2"], ["watchD", "Lord, turn my heart to your decrees and not to selfish gain. Psalm 119:36"], ["docT", "In everything set them an example by doing what is good. In your teaching show integrity, seriousness and soundness of speech that cannot be condemned, so that those who oppose you may be ashamed because they have nothing bad to say about us. Titus 2:7-8 NIV"], ["prayer", "Lord God, you know our hearts. Our impulses are not always pure. Forgive us, please. Make us aware of our falling short, so that none are lost, but all are found. Amen."]], "124": [["info", "Third Sunday of Easter"], ["watchO", "Watchword for the week — Worthy is the Lamb that was slain to receive power and wealth and wisdom and might and honor and glory and blessing! Revelation 5:12"], ["dateVerse", "Sunday, May 4", "Acts 9:1-6,(7-20)", "Psalm 30", "Revelation 5:11-14", "John 21:1-19"], ["watchD", "The Lord is my strength and my might, and he has become my salvation. Exodus 15:2"], ["docT", "Mary said, “He has performed mighty deeds with his arm; he has scattered those who are proud in their inmost thoughts.” Luke 1:51 NIV"], ["prayer", "Loving God, help us to recognize pride in our thoughts and willfulness in our actions. Let the strength and might you offer lead us gently to the world, where we may dwell safely and love our neighbors fully. Amen."]], "125": [["dateVerse", "Monday, May 5", "Psalm 58", "Job 41", "1 Corinthians 11:3-16"], ["watchD", "The Lord will not reject forever. Although he causes grief, he will have compassion according to the abundance of his steadfast love. Lamentations 3:31-32"], ["docT", "Zechariah asked for a writing tablet and wrote, “His name is John.” And all of them were amazed. Immediately his mouth was opened and his tongue freed, and he began to speak, praising God. Luke 1:63-64"], ["prayer", "Lord God, we know our grief and we know your greater compassion. We praise you. Amen."]], "126": [["dateVerse", "Tuesday, May 6", "Psalm 59:1-9", "Job 42", "1 Corinthians 11:17-30"], ["watchD", "Hear, you who are far away, what I have done, and you who are near, acknowledge my might. Isaiah 33:13"], ["docT", "Jesus said to Martha, “Did I not tell you that if you believed you would see the glory of God?” John 11:40"], ["prayer", "Dearest Lord, bring us nearer to you. Let our beliefs be true and clear. Heal our misunderstandings and make us worthy to stand before you. Amen."]], "127": [["dateVerse", "Wednesday, May 7", "Psalm 59:10-17", "Proverbs 1:1-2:8", "1 Corinthians 11:31-12:11"], ["watchD", "The Lord answered Job, “Where were you when I laid the foundation of the earth; and said to the sea, “Thus far shall you come and no farther, and here shall your proud waves be stopped?” Job 38:4,11"], ["docT", "Jesus got up and rebuked the winds and the sea, and there was a dead calm. They were amazed, saying, “What sort of man is this, that even the winds and the sea obey him?” Matthew 8:26-27"], ["prayer", "Creator God, where have we been? Where are we now—in life’s storms? Your voice calls us over the wind and the waves. Help us to trust you completely, to keep putting ourselves obediently forward. Amen."]], "128": [["dateVerse", "Thursday, May 8", "Psalm 60", "Proverbs 2:9-3:20", "1 Corinthians 12:12-26"], ["watchD", "God declared to you his covenant, which he charged you to observe, that is, the ten commandments, and he wrote them on two stone tablets. Deuteronomy 4:13"], ["docT", "Jesus said, “Do not think that I have come to abolish the law or the prophets; I have come not to abolish but to fulfill.” Matthew 5:17"], ["prayer", "O God, let us recount your covenants and your greatest commandments and help us plot each day’s course by them. Fill our hearts, minds, and souls with love for you and our neighbors. Amen."]], "129": [["dateVerse", "Friday, May 9", "Psalm 61", "Proverbs 3:21-4:27", "1 Corinthians 12:27-13:7"], ["watchD", "Yet your people say, “The way of the Lord is not just,” when it is their own way that is not just. Ezekiel 33:17"], ["docT", "Is there injustice on God’s part? By no means! Romans 9:14"], ["prayer", "O God, nurture in us the growth that comes from the study of your word and way. May we see the examples of the people of the Bible and learn from them. Increase our hunger for your presence. In your name, we pray. Amen."]], "130": [["dateVerse", "Saturday, May 10", "Psalm 62", "Proverbs 5", "1 Corinthians 13:8-14:5"], ["watchD", "“Am I only a God nearby,” declares the Lord, “and not a God far away?” Jeremiah 23:23 NIV"], ["docT", "At three o’clock Jesus cried out with a loud voice, “Eloi, Eloi, lema sabachthani?” which means, “My God, my God, why have you forsaken me?” Mark 15:34"], ["prayer", "Lord God, in the depths of our confusion, we strain to see your truth; we try to dodge pits and snares; falsehoods surround us. Raise our hearts and faces to see our Christ looking at us with his love, from his cross. Amen."]], "131": [["info", "Fourth Sunday of Easter"], ["watchO", "Watchword for the week — Salvation belongs to our God who is seated on the throne, and to the lamb! Revelation 7:10"], ["dateVerse", "Sunday, May 11", "Acts 9:36-43", "Psalm 23", "Revelation 7:9-17", "John 10:22-30"], ["watchD", "You shall not steal. Exodus 20:15"], ["docT", "Those who steal must give up stealing; rather, let them labor, doing good work with their own hands, so as to have something to share with the needy. Ephesians 4:28"], ["prayer", "All-knowing God, our theft is often not in the taking, but in withholding that which sustains another’s progress and station. We wrongly believe that what we have is ours, but only by your blessing are we blessed to bless another. Amen."]], "132": [["dateVerse", "Monday, May 12", "Psalm 63", "Proverbs 6", "1 Corinthians 14:6-19"], ["watchD", "If you seek me with all your heart, I will let you find me, says the Lord. Jeremiah 29:13-14"], ["docT", "Then suddenly a woman who had been suffering from a flow of blood for twelve years came up behind him and touched the fringe of his cloak, for she was saying to herself, “If I only touch his cloak, I will be made well.” Jesus turned, and seeing her he said, “Take heart, daughter; your faith has made you well.” And the woman was made well from that moment. Matthew 9:20-22"], ["prayer", "Lord of our hearts, sustain us, we pray. Let our trust in you increase with each blessed encounter as we walk our daily walk with you. We may even bend and touch your hem in our awkwardness in your presence. We ask that your faith make us well. Thank you. Amen."]], "133": [["dateVerse", "Tuesday, May 13", "Psalm 64", "Proverbs 7", "1 Corinthians 14:20-35"], ["watchD", "I rejoice at your word like one who finds great spoil. Psalm 119:162"], ["docT", "The kingdom of heaven is like treasure hidden in a field, which a man found and reburied; then in his joy he goes and sells all that he has and buys that field. Matthew 13:44"], ["prayer", "King of heaven, sovereign God, what greater treasure is there than to serve in your kingdom now, to be with you in the kingdom to come, with all the saints, basking in the light of your love? Help us work in your fields today. Amen."]], "134": [["dateVerse", "Wednesday, May 14", "Psalm 65:1-8", "Proverbs 8:1-9:6", "1 Corinthians 14:36-15:2"], ["watchD", "If I take the wings of the morning and settle at the farthest limits of the sea, even there your hand shall lead me, and your right hand shall hold me fast. Psalm 139:9-10"], ["docT", "Paul said, “Last night there stood by me an angel of the God to whom I belong and whom I worship, and he said, ‘Do not be afraid, Paul; you must stand before the emperor, and, indeed, God has granted safety to all those who are sailing with you.’” Acts 27:23-24"], ["prayer", "Triune God, you are our traveling companion, leading our journey into adventures of love, service, and spirituality. Help us follow your leading. Let us seek out new ways of loving you and others. Protect us. Amen."]], "135": [["dateVerse", "Thursday, May 15", "Psalm 65:9-13", "Proverbs 9:7-10:32", "1 Corinthians 15:3-16"], ["watchD", "A broken and contrite heart, O God, you will not despise. Psalm 51:17"], ["docT", "Jesus said, “But the tax collector, standing far off, would not even lift up his eyes to heaven but was beating his breast and saying, ‘God, be merciful to me, a sinner!’ I tell you, this man went down to his home justified.” Luke 18:13-14"], ["prayer", "Healing and merciful God, you see us as we truly are and lift our gaze to what we can be. Strengthen our resolve to walk in your way, looking neither left nor right, but keeping our eyes on you. Amen."]], "136": [["dateVerse", "Friday, May 16", "Psalm 66:1-7", "Proverbs 11", "1 Corinthians 15:17-28"], ["watchD", "I will wait for the Lord, who is hiding his face from the house of Jacob. Isaiah 8:17"], ["docT", "They are Israelites, and to them belong the adoption, the glory, the covenants, the giving of the law, the worship, and the promises. Romans 9:4"], ["prayer", "Tender and merciful God, may we each, of all races, tribes, and nations, acknowledge the blessings we share with one another and worship you as the source of all things. May our behaviors and attitudes reflect our kinship in you. Amen."]], "137": [["dateVerse", "Saturday, May 17", "Psalm 66:8-15", "Proverbs 12", "1 Corinthians 15:29-41"], ["watchD", "The steadfast love of the Lord is from everlasting to everlasting on those who fear him, and his righteousness to children’s children, to those who keep his covenant. Psalm 103:17-18"], ["docT", "Because you have kept my word of endurance, I will keep you from the hour of trial that is coming on the whole world to test the inhabitants of the earth. Revelation 3:10"], ["prayer", "Faithful God, steadfast is your love. Forgive our stumbling, faltering ways. Help us come to the finish line with our eyes on you. May our hearts be convinced of your love for us and our love for you. In Christ’s name, we pray. Amen."]], "138": [["info", "Fifth Sunday of Easter"], ["watchO", "Watchword for the week — Jesus said, “I am the Alpha and the Omega, the beginning and the end. To the thirsty I will give water as a gift from the spring of the water of life.” Revelation 21:6"], ["dateVerse", "Sunday, May 18", "Acts 11:1-18", "Psalm 148", "Revelation 21:1-6", "John 13:31-35"], ["watchD", "The Lord knows our thoughts, that they are but an empty breath. Psalm 94:11"], ["docT", "Do not deceive yourselves. If you think that you are wise in this age, you should become fools so that you may become wise. For the wisdom of this world is foolishness with God. 1 Corinthians 3:18-19"], ["prayer", "Almighty Lord and God, who do we think we are? Let us see ourselves for the fools that we are and return to you, cling to you and your word. We can be fools for you and wise in your ways. Amen."]], "139": [["dateVerse", "Monday, May 19", "Psalm 66:16-20", "Proverbs 13", "1 Corinthians 15:42-58"], ["watchD", "We do not know what to do, but our eyes are on you. 2 Chronicles 20:12"], ["docT", "The Lord appointed seventy-two others and said, “Whatever house you enter, first say, ‘Peace to this house!’” Luke 10:1,5"], ["prayer", "Christ, our conductor, our eyes and ears are open to the music of your world and the needs of our neighbors. We look to you. Direct us, keep us free from error as we speak of your love and peace. Amen."]], "140": [["dateVerse", "Tuesday, May 20", "Psalm 67", "Proverbs 14", "1 Corinthians 16:1-11"], ["watchD", "Thus said the Lord, “I have heard your prayer, I have seen your tears; indeed, I will heal you.” 2 Kings 20:5"], ["docT", "The official said to him, “Sir, come down before my little boy dies.” Jesus said to him, “Go; your son will live.” The man believed the word that Jesus spoke to him and started on his way. As he was going down, his slaves met him and told him that his child was alive. John 4:49-51"], ["prayer", "Ever-present Father and Son; you love us; you heal us; you forgive us, again and again. We do believe you and trust you, again and again, even though we sometimes fall away. Amen."]], "141": [["dateVerse", "Wednesday, May 21", "Psalm 68:1-6", "Proverbs 15", "1 Corinthians 16:12-24"], ["watchD", "Do not fear; Zion, let not your hands be weak. The Lord your God in your midst, the Mighty One, will save. Zephaniah 3:16-17 NKJV"], ["docT", "Be merciful to those who doubt. Jude 22 NIV"], ["prayer", "Lord God, who knows us all, we acknowledge that we know only a small part of ourselves and less of others. May we show to others the grace that you show to us. Strengthen us sojourners. Amen."]], "142": [["dateVerse", "Thursday, May 22", "Psalm 68:7-18", "Proverbs 16", "2 Corinthians 1:1-11"], ["watchD", "Do not let the downtrodden be put to shame. Psalm 74:21"], ["docT", "The Canaanite woman knelt before Jesus, saying, “Lord, help me.” He answered, “It is not fair to take the children’s food and throw it to the dogs.” She said, “Yes, Lord, yet even the dogs eat the crumbs that fall from their masters’ table.” Then Jesus answered her, “Woman, great is your faith! Let it be done for you as you wish.” And her daughter was healed from that moment. Matthew 15:25-28"], ["prayer", "O God, we see them every day, on the street corners, in our schools and with their tents in the underbrush. Remind us that we are blessed to be a blessing. Help us discern what that might look like. In your name, we pray. Amen."]], "143": [["dateVerse", "Friday, May 23", "Psalm 68:19-27", "Proverbs 17", "2 Corinthians 1:12-22"], ["watchD", "I am going to gather them from the farthest parts of the earth, among them the blind and the lame, those with child and those in labor together; a great company, they shall return here. Jeremiah 31:8"], ["docT", "The owner of the house became angry and said to his slave, “Go out at once into the streets and lanes of the town and bring in the poor, the crippled, the blind, and the lame.” Luke 14:21"], ["prayer", "Caring God and Lord, you care so much for the world. May your love for us overflow as we share it among those we meet, for your love is never-ending. In your service, we pray. Amen."]], "144": [["dateVerse", "Saturday, May 24", "Psalm 68:28-35", "Proverbs 18", "2 Corinthians 1:23-2:13"], ["watchD", "Only you know the human heart. 1 Kings 8:39"], ["docT", "When Jesus saw Nathanael coming toward him, he said of him, “Here is truly an Israelite in whom there is no deceit!” Nathanael asked him, “Where did you get to know me?” John 1:47-48"], ["prayer", "Omniscient Lord, God, and Spiritus, creator of each of us, we are yours by your will if not our own. Give increase to our leanings to find you and to be found by you. May we be kind. Amen."]], "145": [["info", "Sixth Sunday of Easter"], ["watchO", "Watchword for the week — Jesus said, “Peace I leave with you; my peace I give to you.” John 14:27"], ["dateVerse", "Sunday, May 25", "Acts 16:9-15", "Psalm 67", "Revelation 21:10,22-22:5", "John 14:23-29"], ["watchD", "Do not be hard-hearted or tight-fisted toward your needy neighbor. Deuteronomy 15:7"], ["docT", "What good is it, my brothers and sisters, if someone claims to have faith but does not have works? James 2:14"], ["prayer", "God, from dust you made us; to dust we shall return, but before we do that, let us be all used up, doing all the good that we can do, so none are left hungry, homeless, or breathless. Faithfully working hands. Amen."]], "146": [["dateVerse", "Monday, May 26", "Psalm 69:1-12", "Proverbs 19", "2 Corinthians 2:14-3:11"], ["watchD", "Not by might, nor by power, but by my spirit, says the Lord of hosts. Zechariah 4:6"], ["docT", "The angel said to Mary, “The Holy Spirit will come upon you, and the power of the Most High will overshadow you; therefore the child to be born will be holy; he will be called Son of God.” Luke 1:35"], ["prayer", "Spirit of God, fill us! Amen."]], "147": [["dateVerse", "Tuesday, May 27", "Psalm 69:13-21", "Proverbs 20", "2 Corinthians 3:12-4:6"], ["watchD", "And who is a rock besides our God? Psalm 18:31"], ["docT", "Paul wrote: Indeed, we felt we had received the sentence of death. But this happened that we might not rely on ourselves but on God, who raises the dead. He has delivered us from such a deadly peril, and he will deliver us again. On him we have set our hope that he will continue to deliver us. 2 Corinthians 1:9-10 NIV"], ["prayer", "Our God and Savior, in perilous times and good, you are our life’s foundation and our hope. Bring us to that reality sooner rather than later. We are waiting for your return. Amen."]], "148": [["dateVerse", "Wednesday, May 28", "Psalm 69:22-29", "Proverbs 21", "2 Corinthians 4:7-18"], ["watchD", "In days to come nation shall not lift up sword against nation; neither shall they learn war anymore. Isaiah 2:2,4"], ["docT", "Pursue peace with everyone and the holiness without which no one will see the Lord. Hebrews 12:14"], ["prayer", "Forgiving God and Lord, gird us to seek peace daily with our neighbors and those whom we see as foes—for whatever reason. Help us to offer the olive branch in our hands, and the love for you in our hearts. Amen."]], "149": [["info", "Ascension Day"], ["watchO", "Watchword for the Ascension — Jesus said, “I, when I am lifted up from the earth, will draw all people to myself.” John 12:32"], ["dateVerse", "Thursday, May 29", "Psalm 69:30-36", "Proverbs 22", "2 Corinthians 5:1-15"], ["specialVerse", "Ascension of the Lord", "Acts 1:1-11", "Psalm 47", "Ephesians 1:15-23", "Luke 24:44-53"], ["watchD", "The Lord said, “I will grant peace in the land, and you shall lie down, and no one shall make you afraid.” Leviticus 26:6"], ["docT", "Jesus said, “But if it is by the finger of God that I cast out the demons, then the kingdom of God has come upon you.” Luke 11:20"], ["prayer", "Ascended Lord, we wait for your return, but we are not idle. Gift us with fearlessness and acts of love, proclaiming salvation through you and life eternal with you. Your kingdom come. Amen."]], "150": [["dateVerse", "Friday, May 30", "Psalm 70", "Proverbs 23", "2 Corinthians 5:16-6:2"], ["watchD", "Those who love your name may exult in you. Psalm 5:11"], ["docT", "As the apostles left the council, they rejoiced that they were considered worthy to suffer dishonor for the sake of the name. And every day in the temple and at home they did not cease to teach and proclaim Jesus as the Messiah. Acts 5:41-42"], ["prayer", "Lord Jesus, your name is exalted above all names. Like your apostles, help us teach and proclaim you as our savior everywhere, especially at home. Faith is the best gift we can offer to our children. Serving you. Amen."]], "151": [["dateVerse", "Saturday, May 31", "Psalm 71:1-8", "Proverbs 24", "2 Corinthians 6:3-18"], ["watchD", "It is well with those who deal generously and lend, who conduct their affairs with justice. Psalm 112:5"], ["docT", "The rich are to do good, to be rich in good works, generous, and ready to share, thus storing up for themselves the treasure of a good foundation for the future, so that they may take hold of the life that really is life. 1 Timothy 6:18-19"], ["prayer", "Triune God, there is enough because you bless us. We now must use our blessings to do justice, love mercy, and walk humbly with our neighbor and with you. Amen."]], "152": [["info", "Ascension Sunday Seventh Sunday of Easter"], ["watchO", "Watchword for the week — Rejoice in the Lord, O you righteous, and give thanks to his holy name! Psalm 97:12"], ["dateVerse", "Sunday, June 1", "Acts 16:16-34", "Psalm 97", "Revelation 22:12-14,16-17,20-21", "John 17:20-26"], ["watchD", "Hanna made a vow, saying, “Lord Almighty, if you will only look on your servant’s misery and remember me, and not forget your servant but give her a son, then I will give him to the Lord for all the days of his life.” 1 Samuel 1:11 NIV"], ["docT", "Now the time came for Elizabeth to give birth, and she bore a son. Her neighbors and relatives heard that the Lord had shown his great mercy to her, and they rejoiced with her. Luke 1:57-58"], ["prayer", "Lord almighty, please look upon us, your servants, in our need and remember us. Shower us with your great mercy and grant us the desires of our hearts. May we, like Hanna and Elizabeth, give back to you all the days of our lives. Amen."]], "153": [["dateVerse", "Monday, June 2", "Psalm 71:9-18a", "Proverbs 25", "2 Corinthians 7:1-13a"], ["watchD", "Jeremiah said, “For the brokenness of the daughter of my people I am broken. Is there no balm in Gilead? Is there no physician there?” Jeremiah 8:21,22"], ["docT", "Jesus said to Zacchaeus, “Today salvation has come to this house, because he, too, is a son of Abraham. For the son of man came to seek out and to save the lost.” Luke 19:9-10"], ["prayer", "Gracious Healer, we are transformed by your presence and saved by your mercy and grace. Teach us to love. Renew our souls, so that we may rededicate ourselves to your service. Amen."]], "154": [["dateVerse", "Tuesday, June 3", "Psalm 71:18b-24", "Proverbs 26", "2 Corinthians 7:13b-8:9"], ["watchD", "Holy, holy, holy is the Lord of hosts; the whole earth is full of his glory. Isaiah 6:3"], ["docT", "The angel said in a loud voice, “Fear God and give him glory, for the hour of his judgment has come, and worship him who made heaven and earth, the sea and the springs of water.” Revelation 14:7"], ["prayer", "Most holy Lord of hosts, the whole earth is full of your glory. We stand in awe of your creation’s majesty and life- giving waters. Clothe us in your righteousness and grant us your peace. Amen."]], "155": [["dateVerse", "Wednesday, June 4", "Psalm 72:1-11", "Proverbs 27", "2 Corinthians 8:10-21"], ["watchD", "You are my Father, my God, and the rock of my salvation! Psalm 89:26"], ["docT", "Give us today our daily bread. Matthew 6:11"], ["prayer", "Holy God of our salvation, we praise your holy name. Provide us with our daily bread, as we trust in your provision. We give thanks for your steadfast love and faithfulness. Amen."]], "156": [["dateVerse", "Thursday, June 5", "Psalm 72:12-20", "Proverbs 28", "2 Corinthians 8:22-9:9"], ["watchD", "But to the wicked God said, “What right have you to recite my statutes or take my covenant on your lips? For you hate discipline, and you cast my words behind you.” Psalm 50:16-17"], ["docT", "Jesus said, “Not everyone who says to me, ‘Lord, Lord,’ will enter the kingdom of heaven, but only the one who does the will of my Father in heaven.” Matthew 7:21"], ["prayer", "Savior God, we confess that we are a sinful people. When that spirit of sinfulness and despair overcomes us, we are truly thankful for the life of Christ that has set us free from the law of sin and death. Lead us now to repentance and forgiveness. Amen."]], "157": [["dateVerse", "Friday, June 6", "Psalm 73:1-12", "Proverbs 29", "2 Corinthians 9:10-10:6"], ["watchD", "As the mountains surround Jerusalem, so the Lord surrounds his people from this time on and forevermore. Psalm 125:2"], ["docT", "Jesus prayed, “I am not asking you to take them out of the world, but I ask you to protect them from the evil one.” John 17:15"], ["prayer", "God of all, whose love surrounds us, praise we bring you, joyfully! Protect us from evil, guide our steps, and keep us in your care, now and forever, as we live our lives in service to you. In Jesus’ name, we pray. Amen."]], "158": [["dateVerse", "Saturday, June 7", "Psalm 73:13-20", "Proverbs 30", "2 Corinthians 10:7-18"], ["watchD", "O Lord, in your hand are power and might, so that no one is able to withstand you. 2 Chronicles 20:6"], ["docT", "They drove Jesus out of the town and led him to the brow of the hill on which their town was built, so that they might hurl him off the cliff. But he passed through the midst of them and went on his way. Luke 4:29-30"], ["prayer", "Gentle Shepherd, your power and might are always on display. Help us to remember that this power is funneled through your great love for us, and that you love us fiercely and powerfully as your chosen children. Amen."]], "159": [["info", "Day of Pentecost"], ["watchO", "Watchword for the week — For all who are led by the Spirit of God are children of God. Romans 8:14"], ["dateVerse", "Sunday, June 8", "Acts 2:1-21", "Psalm 104:24-34,35b", "Romans 8:14-17", "John 14:8-17,(25-27)"], ["watchD", "Lord, you give life to everything, and the multitudes of heaven worship you. Nehemiah 9:6 NIV"], ["docT", "When they had prayed, the place in which they were gathered together was shaken, and they were all filled with the Holy Spirit and spoke the word of God with boldness. Acts 4:31"], ["prayer", "Multitudes of heaven worship you, Lord, for you give life to everything. Fill us with the Holy Spirit and the boldness to speak your word as we gather together in prayer. May we experience your power and presence in our midst. Amen."]], "160": [["dateVerse", "Monday, June 9", "Psalm 73:21-28", "Proverbs 31", "2 Corinthians 11:1-11"], ["watchD", "Many are the afflictions of the righteous, but the Lord rescues them from them all. Psalm 34:19"], ["docT", "When they bring you to trial and hand you over, do not worry beforehand about what you are to say, but say whatever is given you at that time, for it is not you who speak but the Holy Spirit. Mark 13:11"], ["prayer", "Spirit of holiness, there are times when we dishonor your good intentions for us. You long to restore us to the image of God, but we let it tarnish as we nurse selfish attitudes. Burn away our impurities and forge us into useful instruments in your service. Until he comes. Amen."]], "161": [["dateVerse", "Tuesday, June 10", "Psalm 74:1-9", "Ecclesiastes 1:1-3:8", "2 Corinthians 11:12-15"], ["watchD", "The Lord is my rock, my fortress, and my deliverer. 2 Samuel 22:2"], ["docT", "Paul wrote: The Lord stood by me and gave me strength, so that through me the message might be fully proclaimed, and all the gentiles might hear it. So, I was rescued from the lion’s mouth. 2 Timothy 4:17"], ["prayer", "Lord, you are our rock, fortress, and deliverer. We ask that you stand by us and give us strength to proclaim your message to all people, just as you did for Paul. Rescue us from danger and guide us on your path. Amen."]], "162": [["dateVerse", "Wednesday, June 11", "Psalm 74:10-17", "Ecclesiastes 3:9-5:20", "2 Corinthians 11:16-33"], ["watchD", "Six days you shall labor and do all your work. But the seventh day is a Sabbath to the Lord your God; you shall not do any work. Exodus 20:9-10"], ["docT", "Jesus asked them, “Which is lawful on the Sabbath: to do good or to do evil, to save life or to kill?” Mark 3:4 NIV"], ["prayer", "Rock of our salvation, we are a tired and weary people. Our time and talents are often exhausted from pursuing our own goals instead of your will for our lives. Give us true rest and renewed strength so that we may be good stewards of your creation and faithful messengers of your saving grace. Amen."]], "163": [["dateVerse", "Thursday, June 12", "Psalm 74:18-23", "Ecclesiastes 6:1-7:14", "2 Corinthians 12:1-13"], ["watchD", "The Lord your God you shall follow, him alone you shall fear, his commandments you shall keep, his voice you shall obey, him you shall serve, and to him you shall hold fast. Deuteronomy 13:4"], ["docT", "You shine like stars in the world, holding forth the word of life. Philippians 2:15-16"], ["prayer", "Holy Illuminator, we pray that we may reflect your truth and hope, mirroring your grace to guide and stay bright in darkness. Grant us courage to illuminate the path towards your eternal promise. Amen."]], "164": [["dateVerse", "Friday, June 13", "Psalm 75", "Ecclesiastes 7:15-9:18", "2 Corinthians 12:14-13:4"], ["watchD", "Is anything too wonderful for the Lord? Genesis 18:14"], ["docT", "Later he appeared to the eleven themselves as they were sitting at the table, and he upbraided them for their lack of faith and stubbornness, because they had not believed those who saw him after he had risen. Mark 16:14"], ["prayer", "Spirit of holiness, nothing is too wonderful for you. We pray that you will fill us with faith and remove our stubbornness. Help us to believe and trust in you always. Amen."]], "165": [["dateVerse", "Saturday, June 14", "Psalm 76", "Ecclesiastes 10:1-12:14", "2 Corinthians 13:5-13"], ["watchD", "The woman saw that the tree was good for food and that it was a delight to the eyes and that the tree was to be desired to make one wise. Genesis 3:6"], ["docT", "The world and its desire are passing away, but those who do the will of God abide forever. 1 John 2:17"], ["prayer", "Almighty God, may we see the good in your teachings and resist the temptations of the world that only bring temporary pleasure. Guide us to prioritize your will so that we may live in your love and grace forevermore. Amen."]], "166": [["info", "Trinity Sunday"], ["watchO", "Watchword for the week — Since we are justified by faith, we have peace with God through our Lord Jesus Christ. Romans 5:1"], ["dateVerse", "Sunday, June 15", "Proverbs 8:1-4,22-31", "Psalm 8", "Romans 5:1-5", "John 16:12-15"], ["watchD", "Render true judgments, show kindness and mercy to one another. Zechariah 7:9"], ["docT", "The Lord’s servant must not be quarrelsome but kindly to everyone, an apt teacher, patient, correcting opponents with gentleness. God may perhaps grant that they will repent. 2 Timothy 2:24-25"], ["prayer", "Savior of the world, teach us to follow your example and love as you have loved. Reveal yourself through your word and allow your Spirit that dwells within us to guide and comfort us. In the name of Jesus, we pray. Amen."]], "167": [["dateVerse", "Monday, June 16", "Psalm 77:1-9", "Song of Solomon 1:1-2:7", "Galatians 1:1-12"], ["watchD", "A soft answer turns away wrath, but a harsh word stirs up anger. Proverbs 15:1"], ["docT", "Hold to the standard of sound teaching that you have heard from me, in the faith and love that are in Christ Jesus. 2 Timothy 1:13"], ["prayer", "Holy God, grant us the wisdom to respond to conflict with soft words, turning away wrath and promoting peace. Help us to hold fast to the sound teaching of Christ Jesus, living in faith and love, so that our words and actions may reflect your grace. Amen."]], "168": [["dateVerse", "Tuesday, June 17", "Psalm 77:10-15", "Song of Solomon 2:8-4:16", "Galatians 1:13-24"], ["watchD", "God said to Jacob, “I am God, the God of your father; do not be afraid. I myself will go down with you to Egypt, and I will also bring you up again.” Genesis 46:3-4"], ["docT", "Peter said, “Look, we have left our homes and followed you.” And Jesus said to them, “Truly I tell you, there is no one who has left house or wife or brothers or parents or children for the sake of the kingdom of God who will not get back very much more in this age and in the age to come eternal life.” Luke 18:28-30"], ["prayer", "God of our ancestors, do not let fear overcome us. Accompany us on our journey, as you did with Jacob, and bring us up again. As we follow you, may we be granted the promise of eternal life, as promised by your son, Jesus Christ. Amen."]], "169": [["dateVerse", "Wednesday, June 18", "Psalm 77:16-20", "Song of Solomon 5,6", "Galatians 2:1-14"], ["watchD", "Your words became to me a joy and the delight of my heart, for I am called by your name, O Lord, God of hosts. Jeremiah 15:16"], ["docT", "Philip and the eunuch went down into the water, and Philip baptized him. When they came up out of the water, the Spirit of the Lord snatched Philip away; the eunuch saw him no more and went on his way rejoicing. Acts 8:38-39"], ["prayer", "Name above all names, may your words bring joy and delight to all who hear and follow them. We pray that we also may be baptized in your name and receive the Holy Spirit to guide us on our journey of faith. Amen."]], "170": [["dateVerse", "Thursday, June 19", "Psalm 78:1-8", "Song of Solomon 7,8", "Galatians 2:15-3:5"], ["watchD", "Thus said the Lord God, I will gather others to them besides those already gathered. Isaiah 56:8"], ["docT", "And this good news of the kingdom will be proclaimed throughout the world, as a testimony to all the nations, and then the end will come. Matthew 24:14"], ["prayer", "Eternal God, we pray for our church as a witnessing fellowship for you. As you have always been faithful to us, help us to be faithful to you, shiny as beacons of light in our communities. In the name of Jesus, we pray. Amen."]], "171": [["dateVerse", "Friday, June 20", "Psalm 78:9-16", "Isaiah 1", "Galatians 3:6-18"], ["watchD", "Turn to me and be gracious to me, for I am lonely and afflicted. Psalm 25:16"], ["docT", "Jesus, son of David, have mercy on me! Mark 10:47"], ["prayer", "Merciful Savior, may we turn to you and be granted your gracious mercy. In our loneliness and affliction, we seek your comfort and strength to guide us in all things. Amen."]], "172": [["dateVerse", "Saturday, June 21", "Psalm 78:17-31", "Isaiah 2:1-4:1", "Galatians 3:19-29"], ["watchD", "O give thanks to the Lord of lords, who alone does great wonders, for his steadfast love endures forever. Psalm 136:3,4"], ["docT", "The crowds with one accord listened eagerly to what was said by Philip, hearing and seeing the signs that he did. So there was great joy in that city. Acts 8:6,8"], ["prayer", "Lord, you are faithful, and your love endures forever. You continue to transform believers—healing, reconciling, and empowering. Lives are turned around. Following your example, help us to be your servants ministering to the sick and helpless around us. Amen."]], "173": [["info", "Second Sunday after Pentecost"], ["watchO", "Watchword for the week — For dominion belongs to the Lord, and he rules over the nations. Psalm 22:28"], ["dateVerse", "Sunday, June 22", "Isaiah 65:1-9", "Psalm 22:19-28", "Galatians 3:23-29", "Luke 8:26-39"], ["watchD", "The Lord went in front of them in a pillar of cloud by day, to lead them along the way, and in a pillar of fire by night, to give them light. Exodus 13:21"], ["docT", "Jesus said, “You search the scriptures because you think that in them you have eternal life, and it is they that testify on my behalf.” John 5:39"], ["prayer", "Holy God, may your presence go before us like a pillar of cloud by day and fire by night, leading us along the way. May we search the scriptures with hearts open to the testimony of your son, Jesus Christ, who offers us eternal life. Amen."]], "174": [["dateVerse", "Monday, June 23", "Psalm 78:32-39", "Isaiah 4:2-5:30", "Galatians 4:1-16"], ["watchD", "The Lord is good to all, and his compassion is over all that he has made. Psalm 145:9"], ["docT", "The creation itself will be set free from its enslavement to decay and will obtain the freedom of the glory of the children of God. Romans 8:21"], ["prayer", "Lord, we pray that your compassion and goodness continue to be evident in all that you have made. May we be set free from the sins of this world and experience the freedom of your glory. Amen."]], "175": [["dateVerse", "Tuesday, June 24", "Psalm 78:40-55", "Isaiah 6,7", "Galatians 4:17-27"], ["watchD", "Trust in the Lord with all your heart, and do not rely on your own insight. In all your ways acknowledge him, and he will make straight your paths. Proverbs 3:5-6"], ["docT", "Jesus said to Peter, “Very truly, I tell you, when you were younger, you used to fasten your own belt and to go wherever you wished. But when you grow old, you will stretch out your hands, and someone else will fasten a belt around you and take you where you do not wish to go.” John 21:18"], ["prayer", "When we find ourselves in times of trouble, Lord, we find it hard to discern your plans for us. We take comfort knowing that you, the one true creator, grant us a future of hope. Let us hear your call, Lord. Amen."]], "176": [["dateVerse", "Wednesday, June 25", "Psalm 78:56-64", "Isaiah 8:1-9:7", "Galatians 4:28-5:6"], ["watchD", "Those who are far off shall come and help to build the temple of the Lord. Zechariah 6:15"], ["docT", "All nations will come and worship before you, for your judgments have been revealed. Revelation 15:4"], ["prayer", "God of all nations, we lament that we often create and worship our own kingdoms and temples here on earth. Grant that we may turn our talents and energies to your service until all have heard your name! Amen."]], "177": [["dateVerse", "Thursday, June 26", "Psalm 78:65-72", "Isaiah 9:8-10:11", "Galatians 5:7-18"], ["watchD", "The Lord said to Moses, “Assemble the people for me, and I will let them hear my words, so that they may learn to fear me as long as they live on the earth and may teach their children so.” Deuteronomy 4:10"], ["docT", "But as for you, continue in what you have learned and firmly believed, knowing from whom you learned it and how from childhood you have known sacred writings that are able to instruct you for salvation through faith in Christ Jesus. 2 Timothy 3:14-15"], ["prayer", "Gracious Teacher, we give thanks for church leaders and mentors that have taught us about your word. We pray for our church to be a witnessing fellowship, shining as beacons of light in our communities for you. Amen."]], "178": [["dateVerse", "Friday, June 27", "Psalm 79:1-8", "Isaiah 10:12-11:9", "Galatians 5:19-6:5"], ["watchD", "The Lord brings death and makes alive; he brings down to the grave and raises up. 1 Samuel 2:6 NIV"], ["docT", "If we live, we live to the Lord, and if we die, we die to the Lord; so then, whether we live or whether we die, we are the Lord’s. Romans 14:8"], ["prayer", "Unchanging Anchor, you are Lord over all our lives. We pray that you grant us the strength to surrender to your will. May we always be yours and proclaim you as the risen Lord! Amen."]], "179": [["dateVerse", "Saturday, June 28", "Psalm 79:9-13", "Isaiah 11:10-13:22", "Galatians 6:6-18"], ["watchD", "With righteousness he shall judge for the poor and decide with equity for the oppressed of the earth. Isaiah 11:4"], ["docT", "Jesus answered them, “Go and tell John what you hear and see: the blind receive their sight, the lame walk, those with a skin disease are cleansed, the deaf hear, the dead are raised, and the poor have good news brought to them.” Matthew 11:4-5"], ["prayer", "Holy Redeemer, we are in awe of the life-changing healing and redemption only you can give. Abide in us as we go forth and share the good news to all in need of your miraculous grace. Amen."]], "180": [["info", "Third Sunday after Pentecost"], ["watchO", "Watchword for the week — If we live by the Spirit, let us also be guided by the Spirit. Galatians 5:25"], ["dateVerse", "Sunday, June 29", "1 Kings 19:15-16,19-21", "Psalm 16", "Galatians 5:1,13-25", "Luke 9:51-62"], ["watchD", "The Lord frustrates the plans of the peoples. Psalm 33:10"], ["docT", "Gamaliel said, “Keep away from these men and let them alone, because if this plan or this undertaking is of human origin, it will fail; but if it is of God, you will not be able to overthrow them.” Acts 5:38-39"], ["prayer", "God, we are assured by your word that your protection, guidance, and strength are with us always. As we venture into an uncertain world today, let us take comfort in the certainty we have with you. You truly are all we will ever need. Amen."]], "181": [["dateVerse", "Monday, June 30", "Psalm 80:1-7", "Isaiah 14", "Ephesians 1:1-10"], ["watchD", "Why is light given to one in misery and life to the bitter in soul, who long for death, but it does not come. Job 3:20-21"], ["docT", "You have heard of the endurance of Job, and you have seen the outcome that the Lord brought about, for the Lord is compassionate and merciful. James 5:11"], ["prayer", "Comforting Spirit, may those who are in misery and bitter in soul find comfort in your compassionate and merciful nature. We pray that you grant them the endurance of Job and the strength to persevere through their trials. May they trust in your plan and find hope in your light. Amen."]], "182": [["dateVerse", "Tuesday, July 1", "Psalm 80:8-11", "Isaiah 15,16", "Ephesians 1:11-23"], ["watchD", "My flesh and my heart may fail, but God is the strength of my heart and my portion forever. Psalm 73:26"], ["docT", "John wrote: These are the words of the Holy One, the true One, “I know your works. Look, I have set before you an open door that no one is able to shut. I know that you have but little power, yet you have kept my word and have not denied my name.” Revelation 3:7,8"], ["prayer", "Holy God, you know our desires, our strengths, our sacrifices, and our hearts better than we ever could. Knowing these things about us, you encourage us by opening doors and strengthening our hearts to serve you with joy and love. In Jesus’ name, we pray. Amen."]], "183": [["dateVerse", "Wednesday, July 2", "Psalm 80:12-19", "Isaiah 17:1-19:17", "Ephesians 2:1-10"], ["watchD", "Though the Lord is high, he regards the lowly, but the haughty he perceives from far away. Psalm 138:6"], ["docT", "Jesus spoke this parable, “The rich man said, ‘Soul, you have ample goods laid up for many years; relax, eat, drink, be merry.’ But God said to him, ‘You fool! This very night your life is being demanded of you. And the things you have prepared, whose will they be?’” Luke 12:19-20"], ["prayer", "Creator God, provide gentle correction and guidance when we stray toward selfishness, and help us to open our hearts and minds to selflessness instead. Help us to reflect your light outward toward others. In Jesus’ name, we pray. Amen."]], "184": [["dateVerse", "Thursday, July 3", "Psalm 81:1-5", "Isaiah 19:18-22:14", "Ephesians 2:11-22"], ["watchD", "The human mind plans the way, but the Lord directs the steps. Proverbs 16:9"], ["docT", "And whatever you do, in word or deed, do everything in the name of the Lord Jesus, giving thanks to God the Father through him. Colossians 3:17"], ["prayer", "Loving God, we pray that you would meet us wherever we are and lead us to act in ways that honor your love for us, each and every day. In your name, we pray. Amen."]], "185": [["dateVerse", "Friday, July 4", "Psalm 81:6-10", "Isaiah 22:15-23:18", "Ephesians 3:1-13"], ["watchD", "You are my hiding place and my shield; I hope in your word. Psalm 119:114"], ["docT", "This is indeed the will of my Father, that all who see the Son and believe in him may have eternal life, and I will raise them up on the last day. John 6:40"], ["prayer", "God of hope, you protect us and provide us with hope in a world in which it is a struggle to feel hopeful. Give us strength and courage to live our lives the best way we know how. Amen."]], "186": [["dateVerse", "Saturday, July 5", "Psalm 81:11-16", "Isaiah 24,25", "Ephesians 3:14-4:6"], ["watchD", "Look, O Lord, at how distressed I am; my heart is wrung within me because I have been very rebellious. Lamentations 1:20"], ["docT", "The woman said, “Come and see a man who told me everything I have ever done! He cannot be the Messiah, can he?” John 4:29"], ["prayer", "God of awe and wonder, you sent your Son, Jesus Christ, to sacrifice himself for our sake. He takes away our guilt and shame and offers grace to every heart. Thank you for your gift to us. Amen."]], "187": [["info", "Fourth Sunday after Pentecost"], ["watchO", "Watchword for the week — So let us not grow weary in doing what is right. Galatians 6:9"], ["specialVerse", "John Hus Festival†", "Isaiah 49:1-7", "Psalm 135:1-13", "1 Corinthians 1:18-24", "Mark 8:34-38"], ["dateVerse", "Sunday, July 6", "Isaiah 66:10-14", "Psalm 66:1-9", "Galatians 6:(1-6),7-16", "Luke 10:1-11,16-20"], ["watchD", "Let the unrighteous forsake their thoughts; let them return to the Lord, that he may have mercy on them. Isaiah 55:7"], ["docT", "Be reconciled to God. 2 Corinthians 5:20"], ["prayer", "Alpha and Omega, when life presents us with challenges, we deal with them the best way we know how in the moment. Have mercy on us as we navigate the complexities and challenges of life. In Jesus’ name, we pray. Amen."]], "188": [["dateVerse", "Monday, July 7", "Psalm 82:1-4", "Isaiah 26,27", "Ephesians 4:7-16"], ["watchD", "The Lord remembered us in our low estate, for his steadfast love endures forever. Psalm 136:23"], ["docT", "Pray also for me, so that when I speak a message may be given to me to make known with boldness the mystery of the gospel, for which I am an ambassador in chains. Ephesians 6:19-20"], ["prayer", "Holy One, we are but humble servants, wandering through lives of faith, eager to speak your truths and share our love for you with others. Guide our wandering hearts, so we do not stray too far from you. Amen."]], "189": [["dateVerse", "Tuesday, July 8", "Psalm 82:5-8", "Isaiah 28", "Ephesians 4:17-28"], ["watchD", "God reveals deep and hidden things. Daniel 2:22"], ["docT", "Jesus prayed, “Righteous Father, the world does not know you, but I know you, and these know that you have sent me.” John 17:25"], ["prayer", "Loving God, help us to be good stewards of the gifts we have received. Help us to care for ourselves, our families, our communities, and your world. Let us not forget that you have provided us with all that we have. Amen."]], "190": [["dateVerse", "Wednesday, July 9", "Psalm 83:1-8", "Isaiah 29", "Ephesians 4:29-5:7"], ["watchD", "Just as I have watched over them to pluck up and break down, so I will watch over them to build and to plant, said the Lord. Jeremiah 31:28"], ["docT", "For the grace of God has appeared, bringing salvation to all, training us to renounce impiety and worldly passions and in the present age to live lives that are self-controlled, upright, and godly. Titus 2:11-12"], ["prayer", "God of compassion, forgive us when we get distracted by the things of this world and fail to set our sights on you. Help us remember these things are fleeting and do not last, but your love is forever. Amen."]], "191": [["dateVerse", "Thursday, July 10", "Psalm 83:9-12", "Isaiah 30,31", "Ephesians 5:8-20"], ["watchD", "You shall keep my commandments and observe them: I am the Lord. Leviticus 22:31"], ["docT", "Jesus answered them, “Those who love me will keep my word, and my Father will love them, and we will come to them and make our home with them.” John 14:23"], ["prayer", "God of justice, you have called us to serve others and to be concerned for justice for all people. We admit that this call can be overwhelming. Open doors and help us to see the path before us, that we may serve you as we are called to do. Amen."]], "192": [["dateVerse", "Friday, July 11", "Psalm 83:13-18", "Isaiah 32:1-33:16", "Ephesians 5:21-33"], ["watchD", "When I think of your ordinances from of old, I take comfort, O Lord. Psalm 119:52"], ["docT", "We know that, if the earthly tent we live in is destroyed, we have a building from God, a house not made with hands, eternal in the heavens. 2 Corinthians 5:1"], ["prayer", "Light of the world, we take comfort in knowing that when our eyes are clouded by darkness and we cannot see a way forward, you illuminate our path. May we always know this truth in the deepest parts of our hearts. Amen."]], "193": [["dateVerse", "Saturday, July 12", "Psalm 84:1-7", "Isaiah 33:17-35:10", "Ephesians 6:1-9"], ["watchD", "Thus said the Lord: In a time of favor I have answered you; on a day of salvation I have helped you. Isaiah 49:8"], ["docT", "I tell you, now is the time of God’s favor, now is the day of salvation. 2 Corinthians 6:2 NIV"], ["prayer", "Holy God, sometimes we need reassurance of your grace and mercy. Tune our hearts so that we might become more aware of your presence in our everyday lives. We ask all of this in your holy name. Amen."]], "194": [["info", "Fifth Sunday after Pentecost"], ["watchO", "Watchword for the week — Make me to know your ways, O Lord; teach me your paths. Psalm 25:4"], ["dateVerse", "Sunday, July 13", "Deuteronomy 30:9-14", "Psalm 25:1-10", "Colossians 1:1-14", "Luke 10:25-37"], ["watchD", "Lord my soul yearns for you in the night; in the morning my spirit longs for you. Isaiah 26:9 NIV"], ["docT", "In the morning, while it was still very dark, Jesus got up and went out to a deserted place, and there he prayed. Mark 1:35"], ["prayer", "O God, thank you for sending your son, Jesus, to save us and to show us how to love and offer grace to others. In the morning, in the evening, and all day long, we are reminded of your steadfast love for us. With gratitude, we pray. Amen."]], "195": [["dateVerse", "Monday, July 14", "Psalm 84:8-12", "Isaiah 36:1-37:13", "Ephesians 6:10-24"], ["watchD", "But where are your gods that you made for yourself? Let them come, if they can save you, in your time of trouble. Jeremiah 2:28"], ["docT", "My beloved, flee from the worship of idols. 1 Corinthians 10:14"], ["prayer", "Compassionate God, we often find ourselves slaves to our possessions, our money, our jobs, or our own wants, forgetting that these things are temporary. You are permanent, everlasting, and eternal. May we always remember this. Amen."]], "196": [["dateVerse", "Tuesday, July 15", "Psalm 85:1-7", "Isaiah 37:14-38", "Philippians 1:1-11"], ["watchD", "Solomon said, “Even heaven and the highest heaven cannot contain you, much less this house that I have built!” 1 Kings 8:27"], ["docT", "The hour is coming and is now here when the true worshipers will worship the Father in spirit and truth. John 4:23"], ["prayer", "O God, one of the many joys of receiving your love is the opportunity to share it with others. In hope, we pray that you would help us find community, both within and outside the sacred spaces we call church. In your holy name, we pray. Amen."]], "197": [["dateVerse", "Wednesday, July 16", "Psalm 85:8-13", "Isaiah 38:1-40:5", "Philippians 1:12-22"], ["watchD", "Unless the Lord guards the city, the guard keeps watch in vain. Psalm 127:1"], ["docT", "I urge that prayers be made for kings and all who are in high positions, so that we may lead a quiet and peaceable life in all godliness and dignity. 1 Timothy 2:1-2"], ["prayer", "Loving God, sometimes we forget that those who lead us— in our churches, our local communities, and at the national level—need our prayers as they work to lead and guide diverse groups of people with diverse interests. Watch over them, too, Lord. Amen."]], "198": [["dateVerse", "Thursday, July 17", "Psalm 86:1-10", "Isaiah 40:6-41:7", "Philippians 1:23-2:4"], ["watchD", "Heal me, O Lord, and I shall be healed; save me, and I shall be saved. Jeremiah 17:14"], ["docT", "“So that you may know that the son of man has authority on earth to forgive sins”—Jesus said to the one who was paralyzed—“I say to you, stand up and take your stretcher and go to your home.” Immediately he stood up before them, took what he had been lying on, and went to his home, glorifying God. Luke 5:24-25"], ["prayer", "Healing God, too often we are paralyzed by feelings of unworthiness; too often, we are paralyzed by fear. In these moments, there is nothing left to do but ask for your healing strength. Heal us, O God, and make us whole. Amen."]], "199": [["dateVerse", "Friday, July 18", "Psalm 86:11-17", "Isaiah 41:8-42:9", "Philippians 2:5-18"], ["watchD", "Our transgressions indeed are with us, and we know our iniquities: transgressing and denying the Lord. Isaiah 59:12-13"], ["docT", "If anyone does sin, we have an advocate with the Father, Jesus Christ the righteous. 1 John 2:1"], ["prayer", "God, your love for us burns so strong that you sent your son, Jesus, to heal and forgive. Help us to express radical love for one another as Jesus surrounds us with his love and grace. Amen."]], "200": [["dateVerse", "Saturday, July 19", "Psalm 87", "Isaiah 42:10-43:21", "Philippians 2:19-30"], ["watchD", "For God alone my soul waits in silence; from him comes my salvation. Psalm 62:1"], ["docT", "It is indeed just of God to repay with affliction those who afflict you and to give relief to the afflicted as well as to us, when the Lord Jesus is revealed from heaven. 2 Thessalonians 1:6-7"], ["prayer", "God of justice, we often need to be reminded that those who hurt others are human, too. Our enemies deal with struggles and challenges just like we do, so help us remember to pray for their souls and the healing of their hearts. Amen."]], "201": [["info", "Sixth Sunday after Pentecost"], ["watchO", "Watchword for the week — Is anything too wonderful for the Lord? Genesis 18:14"], ["dateVerse", "Sunday, July 20", "Genesis 18:1-10a", "Psalm 15", "Colossians 1:15-28", "Luke 10:38-42"], ["watchD", "Yet you, O Lord, are in the midst of us, and we are called by your name; do not forsake us! Jeremiah 14:9"], ["docT", "It was in Antioch that the disciples were first called “Christians.” Acts 11:26"], ["prayer", "Immanuel—God with us—we long to feel and know your presence each and every day. Our hearts beat as one in Christian unity with so many others who love Christ as much as we do. Help us to share our love as your disciples, today and always. Amen."]], "202": [["dateVerse", "Monday, July 21", "Psalm 88:1-5", "Isaiah 43:22-44:23", "Philippians 3:1-11"], ["watchD", "Peace, peace, to the far and the near, says the Lord, and I will heal them. Isaiah 57:19"], ["docT", "You know the message he sent to the people of Israel, preaching peace by Jesus Christ—he is Lord of all. Acts 10:36"], ["prayer", "Holy One, we hope for the world to be at peace, but our eyes are not veiled to the realities of the world, either. At the very least, we pray for our own peace—free from anxiety, worry, or fear—knowing that we can always rest in you. Amen."]], "203": [["dateVerse", "Tuesday, July 22", "Psalm 88:6-12", "Isaiah 44:24-45:25", "Philippians 3:12-4:1"], ["watchD", "Before I was humbled I went astray, but now I keep your word. Psalm 119:67"], ["docT", "Jesus said to Simon Peter, “Simon son of John, do you love me?” He said to him, “Yes, Lord; you know that I love you.” Jesus said to him, “Tend my sheep.” John 21:16"], ["prayer", "God, sometimes we stray, like sheep distracted by greener grass. We know that even when we stray, you never stop seeking us, and we always receive your grace. There is no shame in our humanity, and for that, we humble ourselves before you in gratitude. Amen."]], "204": [["dateVerse", "Wednesday, July 23", "Psalm 88:13-18", "Isaiah 46:1-48:6", "Philippians 4:2-13"], ["watchD", "The Lord brought me out into a broad place; he delivered me because he delighted in me. Psalm 18:19"], ["docT", "By the grace of God, I am what I am, and his grace toward me has not been in vain. 1 Corinthians 15:10"], ["prayer", "Amazing God, you delight in us! Our imperfections aside, you genuinely love us just as we are, and you delight in meeting us where we are. We may be in the darkest recesses of our own hearts, or we may be frolicking in the fields of joy. Either way, your grace abounds! Amen."]], "205": [["dateVerse", "Thursday, July 24", "Psalm 89:1-8", "Isaiah 48:7-49:21", "Philippians 4:14-23"], ["watchD", "Hear my prayer, Lord, listen to my cry for help; do not be deaf to my weeping. Psalm 39:12 NIV"], ["docT", "A woman, who was a sinner, stood behind him at his feet, weeping, and began to bathe his feet with her tears and to dry them with her hair, kissing his feet and anointing them with the ointment. But Jesus said to the woman, “Your faith has saved you; go in peace.” Luke 7:37,38,50"], ["prayer", "Eternal God, there are times when we know we could have handled things better; times when we cry out for you in desperation and in hope. We pray that you would hear our cries, forgive us, and wrap us in your arms of comfort. Amen."]], "206": [["dateVerse", "Friday, July 25", "Psalm 89:9-18", "Isaiah 49:22-51:16", "Colossians 1:1-14"], ["watchD", "We have heard with our ears, O God; our ancestors have told us what deeds you performed in their days, in the days of old. Psalm 44:1"], ["docT", "For the time is coming when people will not put up with sound teaching, but, having their ears tickled, they will accumulate for themselves teachers to suit their own desires. 2 Timothy 4:3"], ["prayer", "God of awe and wonder, we find ourselves amazed, that even after so many years, your word still strikes a chord in the song of our heart. We are grateful to those who came before us to share with us the good news of your love. We offer our thanks to you. Amen."]], "207": [["dateVerse", "Saturday, July 26", "Psalm 89:19-29", "Isaiah 51:17-53:12", "Colossians 1:15-27"], ["watchD", "I will punish you according to the fruit of your doings, said the Lord. Jeremiah 21:14"], ["docT", "His master said to him, “Well done, good and trustworthy slave; you have been trustworthy in a few things; I will put you in charge of many things; enter into the joy of your master.” Matthew 25:21"], ["prayer", "God of humility, it can be hard to admit that sometimes we have enough on our plate just trying to take care of ourselves in this life. When we feel the weight of the world on our shoulders, we pray you would help us carry our burdens. Amen."]], "208": [["info", "Seventh Sunday after Pentecost "], ["watchO", "Watchword for the week — Lord, teach us to pray. Luke 11:1"], ["dateVerse", "Sunday, July 27", "Genesis 18:20-32", "Psalm 138", "Colossians 2:6-15,(16-19)", "Luke 11:1-13"], ["watchD", "The Lord gives strength to his people. Psalm 29:11 NIV"], ["docT", "God did not give us a spirit of cowardice but rather a spirit of power and of love and of self-discipline. 2 Timothy 1:7"], ["prayer", "God, we are stronger together than we are on our own. Help us to be in harmonious community with one another, encouraging and supporting each other, so that we can do the work you have called us to do. In your name, we pray. Amen."]], "209": [["dateVerse", "Monday, July 28", "Psalm 89:30-37", "Isaiah 54,55", "Colossians 1:28-2:10"], ["watchD", "You shall not make wrongful use of the name of the Lord your God, for the Lord will not acquit anyone who misuses his name. Exodus 20:7"], ["docT", "Our Father in heaven, hallowed be your name. Matthew 6:9 NIV"], ["prayer", "Loving God, your son, Jesus, taught us how to pray, but that was merely the beginning. Guide us into deeper conversations with you through prayer, helping us strengthen our relationship with you. In your holy name, we pray. Amen."]], "210": [["dateVerse", "Tuesday, July 29", "Psalm 89:38-45", "Isaiah 56,57", "Colossians 2:11-23"], ["watchD", "Be exalted, O Lord, in your strength! We will sing and praise your power. Psalm 21:13"], ["docT", "Now as Jesus was approaching the path down from the Mount of Olives, the whole multitude of the disciples began to praise God joyfully with a loud voice for all the deeds of power that they had seen. Luke 19:37"], ["prayer", "God of beauty, we sing to you the songs that are in our hearts—the songs of joy, and of grief, and of sorrow. As we sing, we praise your glory, and our hearts fill with love and joy. Amen."]], "211": [["dateVerse", "Wednesday, July 30", "Psalm 89:46-52", "Isaiah 58,59", "Colossians 3:1-11"], ["watchD", "Keep my commandments and live; keep my teachings as the apple of your eye. Proverbs 7:2"], ["docT", "The young man said to Jesus, “I have kept all these; what do I still lack?” Matthew 19:20"], ["prayer", "Merciful God, when we hear you call us, we admit that we are often afraid to follow you. Giving up our worldly comforts is not an easy ask, and yet, our hearts long for more than the things of this world. Help us to listen when you call. Amen."]], "212": [["dateVerse", "Thursday, July 31", "Psalm 90", "Isaiah 60,61", "Colossians 3:12-25"], ["watchD", "For as the heavens are high above the earth, so great is his steadfast love toward those who fear him. Psalm 103:11"], ["docT", "Where sin increased, grace abounded all the more, so that, just as sin reigned in death, so grace might also reign through justification leading to eternal life through Jesus Christ our Lord. Romans 5:20-21"], ["prayer", "Holy God, your love for us truly is steadfast—there is no doubt about that. The more we falter, the more mistakes we make, the more grace we receive. For this, we are eternally grateful. In your glorious name, we pray. Amen."]], "213": [["dateVerse", "Friday, August 1", "Psalm 91:1-8", "Isaiah 62,63", "Colossians 4:1-9"], ["watchD", "Is it not you, O Lord our God? We set our hope on you. Jeremiah 14:22"], ["docT", "God gave us eternal life, and this life is in his son. 1 John 5:11"], ["prayer", "Dear divine Creator, grant us the strength to endure life’s trials, the wisdom to navigate challenges, and the courage to face uncertainty. May hope be our guiding light, illuminating our path with resilience and optimism. Amen."]], "214": [["dateVerse", "Saturday, August 2", "Psalm 91:9-16", "Isaiah 64,65", "Colossians 4:10-1", "Thessalonians 1:5a"], ["watchD", "Do not devise evil in your hearts against one another. Zechariah 7:10"], ["docT", "Finally, all of you, have unity of spirit, sympathy, love for one another, a tender heart, and a humble mind. 1 Peter 3:8"], ["prayer", "Gracious God, inspire us to embody the profound command of Christ: to love one another selflessly. May our hearts overflow with compassion, kindness, and understanding, fostering a world united in the bond of love. Amen."]], "215": [["info", "Eighth Sunday after Pentecost"], ["watchO", "Watchword for the week — Set your minds on things that are above, not on things that are on earth. Colossians 3:2"], ["dateVerse", "Sunday, August 3", "Ecclesiastes 1:2,12-14,2:18-23", "Psalm 49:1-12", "Colossians 3:1-11", "Luke 12:13-21"], ["watchD", "The Lord said, “I will instruct you and teach you the way you should go.” Psalm 32:8"], ["docT", "Jesus said, “Follow me!” John 21:22"], ["prayer", "God, grant us strength to follow your path with unwavering faith. Illuminate our way with wisdom, kindness, and courage. May our actions reflect our intentions, and may we walk with grace and purpose. In Jesus’ name, we pray. Amen."]], "216": [["dateVerse", "Monday, August 4", "Psalm 92:1-8", "Isaiah 66-Jeremiah 1:7", "1 Thessalonians 1:5b-2:9"], ["watchD", "The Lord is a God of justice; blessed are all those who wait for him. Isaiah 30:18"], ["docT", "If any of you is lacking in wisdom, ask God, who gives to all generously and ungrudgingly, and it will be given you. James 1:5"], ["prayer", "Gracious God, thank you for your boundless generosity. Help us to embrace your abundance with gratitude and share it with others. May your lavish care inspire us to be vessels of love and kindness. Amen."]], "217": [["dateVerse", "Tuesday, August 5", "Psalm 92:9-15", "Jeremiah 1:8-2:19", "1 Thessalonians 2:10-20"], ["watchD", "The Lord said to Moses, “You shall speak all that I command you.” Exodus 7:1,2"], ["docT", "Proclaim the message; be persistent whether the time is favorable or unfavorable; convince, rebuke, and encourage with the utmost patience in teaching. 2 Timothy 4:2"], ["prayer", "Lord, empower us to proclaim your word with conviction and clarity. Guide our tongues to speak truth boldly and our hearts to embody your teachings. May our words inspire faith and transformation in those we meet. Amen."]], "218": [["dateVerse", "Wednesday, August 6", "Psalm 93", "Jeremiah 2:20-3:13", "1 Thessalonians 3"], ["watchD", "I will sing to the Lord, for he is highly exalted. Exodus 15:1 NIV"], ["docT", "I will pray with the spirit, but I will pray with the mind also; I will sing praise with the spirit, but I will sing praise with the mind also. 1 Corinthians 14:15"], ["prayer", "Heavenly King, we lift our voices in joyful praise! You are worthy of all honor and glory! May our songs of adoration resound, echoing your majesty throughout the earth! Amen."]], "219": [["dateVerse", "Thursday, August 7", "Psalm 94:1-11", "Jeremiah 3:14-4:22", "1 Thessalonians 4:1-12"], ["watchD", "You have looked for much, but it came to little, and when you brought it home, I blew it away. Why? Says the Lord of hosts. Because my house lies in ruins, while all of you hurry off to your own houses. Haggai 1:9"], ["docT", "Jesus said, “But woe to you Pharisees! For you tithe mint and rue and herbs of all kinds and neglect justice and the love of God; it is these you ought to have practiced, without neglecting the others.” Luke 11:42"], ["prayer", "Forgiving Lord, as we repent of our sins, grant us the strength to amend our ways. Help us turn back to you with sincere hearts, seeking your mercy and guidance. Amen."]], "220": [["dateVerse", "Friday, August 8", "Psalm 94:12-23", "Jeremiah 4:23-5:25", "1 Thessalonians 4:13-5:3"], ["watchD", "I said, “I will guard my ways that I may not sin with my tongue.” Psalm 39:1"], ["docT", "From the same mouth comes a blessing and a curse. My brothers and sisters, this ought not to be so. James 3:10"], ["prayer", "Grant us, O Lord, the wisdom to restrain our tongues. Help us speak with kindness, truth, and love, refraining from words that shame or demean. Let our speech reflect your grace. Amen."]], "221": [["dateVerse", "Saturday, August 9", "Psalm 95", "Jeremiah 5:26-6:30", "1 Thessalonians 5:4-15"], ["watchD", "Put away the foreign gods that are among you and incline your hearts to the Lord. Joshua 24:23"], ["docT", "Paul said, “I have not hesitated to preach anything that would be helpful to you. I have declared to both Jews and Greeks that they must turn to God in repentance and have faith in our Lord Jesus.” Acts 20:20-21 NIV"], ["prayer", "God, when we stray, guide us back to your loving embrace. Grant us the courage to repent, the strength to seek forgiveness, and the humility to return to your divine presence. This we pray in the name of your son, Jesus Christ, our Lord. Amen."]], "222": [["info", "Ninth Sunday after Pentecost"], ["watchO", "Watchword for the week — Jesus said, “Do not be afraid, little flock, for it is your Father’s good pleasure to give you the kingdom.” Luke 12:32"], ["dateVerse", "Sunday, August 10", "Genesis 15:1-6", "Psalm 33:12-22", "Hebrews 11:1-3,8-16", "Luke 12:32-40"], ["watchD", "The Lord bless you and keep you. Numbers 6:24"], ["docT", "And remember, I am with you always, to the end of the age. Matthew 28:20"], ["prayer", "Eternal God, in your steadfastness, we find refuge. Amidst life’s storms, anchor us in your unwavering love. Grant us strength to trust in your promises, knowing you are faithful forever. Amen."]], "223": [["dateVerse", "Monday, August 11", "Psalm 96:1-9", "Jeremiah 7", "1 Thessalonians 5:16-28"], ["watchD", "Everyone who calls on the name of the Lord shall be saved. Joel 2:32"], ["docT", "Jesus said, “Beware that you are not led astray, for many will come in my name and say, ‘I am he!’ and, ‘The time is near!’ Do not go after them.” Luke 21:8"], ["prayer", "Divine Savior, hear our cry for salvation. Rescue us from darkness; redeem us from sin. May your mercy embrace us, and your grace transform us. In your love, we find eternal life. Amen."]], "224": [["dateVerse", "Tuesday, August 12", "Psalm 96:10-13", "Jeremiah 8:1-9:9", "2 Thessalonians 1"], ["watchD", "The Lord lives! Blessed be my rock. Psalm 18:46"], ["docT", "Jesus said to them, “Thus it is written, that the Messiah is to suffer and to rise from the dead on the third day.” Luke 24:46"], ["prayer", "Lord Jesus, conqueror of death, you triumphed over the grave, offering us eternal life. Grant us faith in your victory, that we may fearlessly face death and rejoice in resurrection. Amen."]], "225": [["specialVerse", "August Thirteenth Festival†", "Joshua 24:16-24", "Psalm 133", "1 John 4:1-13", "John 17:1-2,6-19"], ["dateVerse", "Wednesday, August 13", "Psalm 97:1-6", "Jeremiah 9:10-10:16", "2 Thessalonians 2:1-12"], ["watchD", "God’s truth shall be your shield and buckler. Psalm 91:4 NKJV"], ["docT", "Those who do what is true come to the light, so that it may be clearly seen that their deeds have been done in God. John 3:21"], ["prayer", "Divine Source of truth, enlighten our minds and hearts, as you did that day in Herrnhut. Grant us the courage to seek and uphold truth in all aspects of life. May your truth guide our paths. Amen."]], "226": [["dateVerse", "Thursday, August 14", "Psalm 97:7-12", "Jeremiah 10:17-11:23", "2 Thessalonians 2:13-3:5"], ["watchD", "The Lord said, “I do forgive, just as you have asked.” Numbers 14:20"], ["docT", "Whenever you stand praying, forgive, if you have anything against anyone, so that your Father in heaven may also forgive you your trespasses. Mark 11:25"], ["prayer", "Heavenly Father, shower us with your boundless grace and forgiveness. May we humbly accept your mercy, letting it cleanse and renew our souls. May the act of your forgiveness remind us to forgive others, too. Amen."]], "227": [["dateVerse", "Friday, August 15", "Psalm 98", "Jeremiah 12:1-13:19", "2 Thessalonians 3:6-18"], ["watchD", "I will bless you as long as I live; I will lift up my hands and call on your name. Psalm 63:4"], ["docT", "All the people saw the one [who had been healed,] walking and praising God. Acts 3:9"], ["prayer", "Divine Creator, pour out your abundant blessings upon us. Guide our steps, illuminate our paths, and fill our hearts with gratitude. May your blessings overflow, touching every aspect of our lives. Amen."]], "228": [["dateVerse", "Saturday, August 16", "Psalm 99", "Jeremiah 13:20-14:22", "1 Timothy 1:1-11"], ["watchD", "If you do what is right, will you not be accepted? But if you do not do what is right, sin is crouching at your door; it desires to have you, but you must rule over it. Genesis 4:7 NIV"], ["docT", "When Judas, his betrayer, saw that Jesus was condemned, he repented and brought back the thirty pieces of silver to the chief priests and the elders. He said, “I have sinned by betraying innocent blood.” Matthew 27:3-4"], ["prayer", "Gracious God, draw us back to your loving embrace. May we abandon lives that rely on our own strengths and ideas, and may we find the courage to return to you with contrite hearts. Amen."]], "229": [["info", "Tenth Sunday after Pentecost"], ["watchO", "Watchword for the week — Let us run with perseverance the race that is set before us, looking to Jesus the pioneer and perfecter of our faith. Hebrews 12:2"], ["dateVerse", "Sunday, August 17", "Jeremiah 23:23-29", "Psalm 82", "Hebrews 11:29-12:2", "Luke 12:49-56"], ["watchD", "Our days may come to seventy years, or eighty, if our strength endures; yet the best of them are but trouble and sorrow, for they quickly pass, and we fly away. Psalm 90:10 NIV"], ["docT", "I want to know Christ and the power of his resurrection. Philippians 3:10"], ["prayer", "Eternal God, all praise belongs to you. With hearts overflowing, we lift our voices in adoration. May every breath we breathe proclaim your greatness, and every moment reflect your glory. Amen."]], "230": [["dateVerse", "Monday, August 18", "Psalm 100", "Jeremiah 15:1-16:13", "1 Timothy 1:12-2:7"], ["watchD", "Make known his deeds among the nations; proclaim that his name is exalted. Isaiah 12:4"], ["docT", "Go therefore and make disciples of all nations, baptizing them in the name of the Father and of the Son and of the Holy Spirit and teaching them to obey everything that I have commanded you. Matthew 28:19-20"], ["prayer", "Lord, make us bold witnesses in the world. Guide our words and deeds to reflect your love and truth. May our lives draw others to you and glorify your name. Amen."]], "231": [["dateVerse", "Tuesday, August 19", "Psalm 101", "Jeremiah 16:14-17:27", "1 Timothy 2:8-3:7"], ["watchD", "The heavens will vanish like smoke, the earth will wear out like a garment, and those who live on it will die like gnats, but my salvation will be forever. Isaiah 51:6"], ["docT", "When the complete comes, the partial will come to an end. 1 Corinthians 13:10"], ["prayer", "Lord of lords, bring us to the New Jerusalem. Let your kingdom come, where tears are wiped away, and joy reigns forever. Prepare our hearts for eternal communion with you. Amen."]], "232": [["dateVerse", "Wednesday, August 20", "Psalm 102:1-11", "Jeremiah 18:1-19:9", "1 Timothy 3:8-16"], ["watchD", "Human beings are all like a puff of breath; great and small alike are worthless. Put them on the scales, and they weigh nothing; they are lighter than a mere breath. Psalm 62:9 GNT"], ["docT", "Store up for yourselves treasures in heaven, where neither moth nor rust consumes and where thieves do not break in and steal. For where your treasure is, there your heart will be also. Matthew 6:20-21"], ["prayer", "God of everlasting life, grant us the gift of eternity with you. May we live in your love, knowing that death is not the end but a passage to your eternal embrace. Amen."]], "233": [["dateVerse", "Thursday, August 21†", "Psalm 102:12-22", "Jeremiah 19:10-21:10", "1 Timothy 4:1-10"], ["watchD", "God said, “By the sweat of your face you shall eat bread until you return to the ground, for out of it you were taken; you are dust, and to dust you shall return.” Genesis 3:19"], ["docT", "If you sow to your own flesh, you will reap corruption from the flesh, but if you sow to the Spirit, you will reap eternal life from the Spirit. Galatians 6:8"], ["prayer", "God, our time in this flesh is brief and often difficult. Help us cherish each moment, seeking your will above all. May our lives glorify you, even in our fleeting time. Amen."]], "234": [["dateVerse", "Friday, August 22", "Psalm 102:23-28", "Jeremiah 21:11-22:30", "1 Timothy 4:11-5:8"], ["watchD", "Take care what you do, for there is no perversion of justice with the Lord our God or partiality or taking of bribes. 2 Chronicles 19:7"], ["docT", "Try to find out what is pleasing to the Lord. Ephesians 5:10"], ["prayer", "Lord, may our lives satisfy you. Guide our intentions, actions, and desires to align with your divine will. Let our existence be a pleasing offering unto you. In your name, we pray. Amen."]], "235": [["dateVerse", "Saturday, August 23", "Psalm 103:1-5", "Jeremiah 23:1-32", "1 Timothy 5:9-16"], ["watchD", "You have burdened me with your sins; you have wearied me with your iniquities. I alone am the one who blots out your transgressions for my own sake, and I will not remember your sins. Isaiah 43:24-25"], ["docT", "Jesus answered them, “My Father is still working, and I also am working.” John 5:17"], ["prayer", "Lord, forgive our transgressions. Grant us the strength to forgive those who have wronged us. May forgiveness be a path to healing and reconciliation in our lives. Amen."]], "236": [["info", "Eleventh Sunday after Pentecost"], ["watchO", "Watchword for the week — The steadfast love of the Lord is from everlasting to everlasting on those who fear him. Psalm 103:17"], ["dateVerse", "Sunday, August 24", "Isaiah 58:9b-14", "Psalm 103:1-8", "Hebrews 12:18-29", "Luke 13:10-17"], ["watchD", "We, your people, the flock of your pasture, will give thanks to you forever; from generation to generation we will recount your praise. Psalm 79:13"], ["docT", "Jesus said, “I am the good shepherd. I know my own, and my own know me.” John 10:14"], ["prayer", "Lord Jesus, our shepherd, guide us through life’s valleys and pastures. May we follow your voice, find rest in your care, and walk in your light forevermore. Amen."]], "237": [["dateVerse", "Monday, August 25", "Psalm 103:6-18", "Jeremiah 23:33-25:14", "1 Timothy 5:17-6:2"], ["watchD", "If you obey the Lord your God: Blessed shall you be in the city, and blessed shall you be in the field.” Deuteronomy 28:2-3"], ["docT", "You ask and do not receive because you ask wrongly, in order to spend what you get on your pleasures. James 4:3"], ["prayer", "Gracious God, teach us to pray aright. Grant us humility, sincerity, and faith as we come before you. May our prayers align with your will and bring glory to your name. Amen."]], "238": [["dateVerse", "Tuesday, August 26", "Psalm 103:19-22", "Jeremiah 25:15-26:9", "1 Timothy 6:3-16"], ["watchD", "The Lord is your keeper; the Lord is your shade at your right hand. The sun shall not strike you by day nor the moon by night. Psalm 121:5-6"], ["docT", "Grace to you and peace from God our Father and the Lord Jesus Christ. Philemon 3"], ["prayer", "God, our refuge in times of trouble, shelter us under your wings. Grant us peace and strength as we rest in your protective embrace. Amen."]], "239": [["dateVerse", "Wednesday, August 27", "Psalm 104:1-9", "Jeremiah 26:10-27:22", "1 Timothy 6:17-2 Timothy 1:7"], ["watchD", "The Lord reproves the one he loves, as a father the son in whom he delights. Proverbs 3:12"], ["docT", "The father said to the elder son, “But we had to celebrate and rejoice, because this brother of yours was dead and has come to life; he was lost and has been found.” Luke 15:32"], ["prayer", "Merciful God, in your wisdom, rebuke us gently. Guide us on the path of righteousness. May your admonitions lead us to growth and deeper understanding of your love. Amen."]], "240": [["dateVerse", "Thursday, August 28", "Psalm 104:10-18", "Jeremiah 28:1-29:14", "2 Timothy 1:8-18"], ["watchD", "You shall be a beautiful crown in the hand of the Lord and a royal diadem in the hand of your God. Isaiah 62:3"], ["docT", "Jesus said, “When you are invited, go and sit down at the lowest place, so that when your host comes, he may say to you, ‘Friend, move up higher’; then you will be honored in the presence of all who sit at the table with you.” Luke 14:10"], ["prayer", "God, teach us humility. May we see ourselves as we truly are and others as they can become. Guide us to serve with compassion and grace. Amen."]], "241": [["dateVerse", "Friday, August 29", "Psalm 104:19-23", "Jeremiah 29:15-30:11", "2 Timothy 2:1-13"], ["watchD", "O Lord of hosts, you are God, you alone, of all the kingdoms of the earth; you have made heaven and earth. Isaiah 37:16"], ["docT", "All things came into being through him, and without him not one thing came into being. John 1:3"], ["prayer", "Creator of all, inspire us with your divine wisdom. Help us to recognize your presence in every aspect of existence and to live in accordance with your divine will. Amen."]], "242": [["dateVerse", "Saturday, August 30", "Psalm 104:24-30", "Jeremiah 30:12-31:22", "2 Timothy 2:14-26"], ["watchD", "O, restore me to health and make me live! Isaiah 38:16"], ["docT", "It so happened that the father of Publius lay sick in bed with fever and dysentery. Paul visited him and cured him by praying and putting his hands on him. Acts 28:8"], ["prayer", "Lord, bring healing to our bodies, minds, and spirits. Grant strength to the weary, comfort to the afflicted, and hope to the discouraged. May your divine touch restore wholeness to us all. Amen."]], "243": [["info", "Twelfth Sunday after Pentecost"], ["watchO", "Watchword for the week — Let mutual love continue. Hebrews 13:1"], ["dateVerse", "Sunday, August 31", "Proverbs 25:6-7", "Psalm 112", "Hebrews 13:1-8,15-16", "Luke 14:1,7-14"], ["watchD", "Happy are all who take refuge in him. Psalm 2:12"], ["docT", "In Christ Jesus we have access in boldness and confidence through faith in him. Ephesians 3:12"], ["prayer", "God, infuse our service with delight. May we find fulfillment in serving others, and may we reflect your love through our actions. Let our service be a source of joy and blessing. Amen."]], "244": [["dateVerse", "Monday, September 1", "Psalm 104:31-35", "Jeremiah 31:23-32:15", "2 Timothy 3:1-9"], ["watchD", "Hold fast to the Lord your God, as you have done to this day. Joshua 23:8"], ["docT", "Let us not give up the habit of meeting together, as some are doing. Instead, let us encourage one another all the more, since you see that the Day of the Lord is coming nearer. Hebrews 10:25 GNT"], ["prayer", "Lord, we are eternally thankful for the love you have shown us. We are reminded of it when we see our peers, friends, and family. Our differing world views can make love difficult, and that is why we pray for patience. Amen."]], "245": [["dateVerse", "Tuesday, September 2", "Psalm 105:1-7", "Jeremiah 32:16-33:5", "2 Timothy 3:10-4:8"], ["watchD", "Who am I, O Lord God, and what is my house, that you have brought me thus far? 2 Samuel 7:18"], ["docT", "When Lydia and her household were baptized, she urged us, saying, “If you have judged me to be faithful to the Lord, come and stay at my home.” Acts 16:15"], ["prayer", "Gracious God, we strive to welcome others the way you do. When we were homeless and in need, you took us in. When we find others that are homeless and in need, help us welcome them with the same warmth you have shown us. Amen."]], "246": [["dateVerse", "Wednesday, September 3", "Psalm 105:8-15", "Jeremiah 33:6-34:7", "2 Timothy 4:9-22"], ["watchD", "A new heart I will give you, and a new spirit I will put within you. Ezekiel 36:26"], ["docT", "Love your enemies and pray for those who persecute you, so that you may be children of your Father in heaven. Matthew 5:44-45"], ["prayer", "O God, allow us to really listen; to feel the Holy Spirit; to observe your love; to make love a part of everyday life; to share love with all; to try and love like you. To you, we pray. Amen."]], "247": [["dateVerse", "Thursday, September 4", "Psalm 105:16-22", "Jeremiah 34:8-35:19", "Titus 1:1-9"], ["watchD", "God will help you, the Almighty will bless you. Genesis 49:25"], ["docT", "The gospel is God’s saving power for everyone who believes. Romans 1:16"], ["prayer", "So often we try to solve the world’s problems on our own, dear God. When we fail, it is without you. When we succeed, it is because of you. It is a blessing that you only require repentance—and salvation will be given to those who believe. Thank you. Amen."]], "248": [["dateVerse", "Friday, September 5", "Psalm 105:23-36", "Jeremiah 36", "Titus 1:10-2:5"], ["watchD", "Never take your word of truth from my mouth. Psalm 119:43 NIV"], ["docT", "They exchanged the truth about God for a lie and worshiped and served the creature rather than the Creator, who is blessed forever! Romans 1:25"], ["prayer", "Lord, too often we stray from you. The world has myriad distractions to take us off course. Your word is like a map providing us guidance to find our way home. May we follow where you lead. Amen!"]], "249": [["dateVerse", "Saturday, September 6", "Psalm 105:37-45", "Jeremiah 37:1-38:13", "Titus 2:6-3:2"], ["watchD", "God said, “I will be like the dew to Israel; he shall blossom like the lily.” Hosea 14:5"], ["docT", "Jesus said, “Therefore do not worry, saying, ‘What will we eat?’ or ‘What will we drink?’ or ‘What will we wear?’ Indeed, your heavenly Father knows that you need all these things.” Matthew 6:31,32"], ["prayer", "Heavenly Father, we are thankful for all you provide: for the food on our table and the friends at our door; for the ground beneath our feet and the air that we breath. We are thankful, heavenly Father. Amen."]], "250": [["info", "Thirteenth Sunday after Pentecost"], ["watchO", "Watchword for the week — Choose life so that you and your descendants may live, loving the Lord your God, obeying him, and holding fast to him. Deuteronomy 30:19,20"], ["dateVerse", "Sunday, September 7", "Deuteronomy 30:15-20", "Psalm 1", "Philemon 1-21", "Luke 14:25-33"], ["watchD", "With my mouth I will give great thanks to the Lord; I will praise him in the midst of the throng. Psalm 109:30"], ["docT", "When Jesus laid his hands on her, immediately she stood up straight and began praising God. Luke 13:13"], ["prayer", "Today we sing your praises, O Lord. A chorus of humanity joyfully praises your name: the shy person in the back of church praises your name; the squeaky alto in the choir praises your name. Everyone knows the blessing you bring. May we remember to always sing your praises. Amen."]], "251": [["dateVerse", "Monday, September 8", "Psalm 106:1-5", "Jeremiah 38:14-39:18", "Titus 3:3-15"], ["watchD", "God will send forth his steadfast love and his faithfulness. Psalm 57:3"], ["docT", "The fruit of the Spirit is love, joy, peace, patience, kindness, generosity, faithfulness, gentleness, and self-control. Galatians 5:22-23"], ["prayer", "Holy Spirit, we are steadfast in our faith because of the calm you bring. Guide us and be gentle with us so that we may enjoy your peace and love. Through you, we pray. Amen."]], "252": [["dateVerse", "Tuesday, September 9", "Psalm 106:6-12", "Jeremiah 40,41", "Philemon 1:1-11"], ["watchD", "It has pleased the Lord to make you a people for himself. 1 Samuel 12:22"], ["docT", "The apostles praised God, saying, “Then God has given even to the Gentiles the repentance that leads to life.” Acts 11:18"], ["prayer", "We are made in your image, God, but that image is blurred. We try our best to live our lives in your likeness, but we don’t see the full picture. We are blessed by your grace, and in turn, we paint your picture. To you, we pray. Amen."]], "253": [["dateVerse", "Wednesday, September 10", "Psalm 106:13-23", "Jeremiah 42,43", "Philemon 1:12-25"], ["watchD", "Our God—the great and mighty and awesome God, keeping covenant and steadfast love—do not treat lightly all the hardship that has come upon us. Nehemiah 9:32"], ["docT", "I am convinced that neither death, nor life, nor angels, nor rulers, nor things present, nor things to come, nor powers, nor height, nor depth, nor anything else in all creation will be able to separate us from the love of God in Christ Jesus our Lord. Romans 8:38-39"], ["prayer", "Creator, we find comfort in your eternity. We face daily hardships as we continue to walk the path of life. May we persevere in all that we do, and when we reach the end, you will be patiently waiting for each of us. Amen."]], "254": [["dateVerse", "Thursday, September 11", "Psalm 106:24-31", "Jeremiah 44", "Hebrews 1:1-9"], ["watchD", "I the Lord will speak the word that I speak, and it will be fulfilled. It will no longer be delayed. Ezekiel 12:25"], ["docT", "Scripture foresaw that God would justify the Gentiles by faith and announced the gospel in advance to Abraham: “All nations will be blessed through you.” Galatians 3:8 NIV"], ["prayer", "All nations can be blessed only through you, Lord. When we live together, we learn to love in your image. May we always remember that when we love together, we are neither Jew nor Gentile, but children of the Lord. Amen."]], "255": [["dateVerse", "Friday, September 12", "Psalm 106:32-39", "Jeremiah 45,46", "Hebrews 1:10-2:8a"], ["watchD", "Do not be afraid of sudden terror, for the Lord will be your confidence. Proverbs 3:25,26 NKJV"], ["docT", "When the disciples saw Jesus walking on the sea, they were terrified, saying, “It is a ghost!” And they cried out in fear. But immediately Jesus spoke to them and said, “Take heart, it is I; do not be afraid.” Matthew 14:26-27"], ["prayer", "God, when you appear, it can be frightening, confusing, or overwhelming. But then, you comfort us and tell us, “Do not be afraid.” We pray that it is that simple. Amen."]], "256": [["dateVerse", "Saturday, September 13", "Psalm 106:40-48", "Jeremiah 47:1-48:25", "Hebrews 2:8b-18"], ["watchD", "In God I trust; I am not afraid. What can a mere mortal do to me? Psalm 56:11"], ["docT", "Meanwhile the church throughout Judea, Galilee, and Samaria had peace and was built up. Living in the fear of the Lord and in the comfort of the Holy Spirit, it increased in numbers. Acts 9:31"], ["prayer", "In you, O God, we place our trust. We trust that you will guide us to salvation, like a shepherd guides his sheep home. May we always remember to turn to you in prayer. Amen."]], "257": [["info", "Fourteenth Sunday after Pentecost"], ["watchO", "Watchword for the week — The sacrifice acceptable to God is a broken spirit; a broken and contrite heart, O God, you will not despise. Psalm 51:17"], ["dateVerse", "Sunday, September 14", "Exodus 32:7-14", "Psalm 51:1-10", "1 Timothy 1:12-17", "Luke 15:1-10"], ["watchD", "I will rejoice in the Lord; I will exult in the God of my salvation. Habakkuk 3:18"], ["docT", "While the son was still far off, his father saw him and was filled with compassion; he ran and put his arms around him and kissed him. Luke 15:20"], ["prayer", "Father, we long to feel your warm embrace. In a world filled with misunderstanding and hate, we seek love and compassion. When we embrace you, it brings cause to celebrate and rejoice. Thank you. Amen."]], "258": [["dateVerse", "Monday, September 15", "Psalm 107:1-9", "Jeremiah 48:26-49:16", "Hebrews 3:1-15"], ["watchD", "I will raise up for them a prophet like you from among their fellow Israelites, and I will put my words in his mouth. Deuteronomy 18:18 NIV"], ["docT", "Many who heard him were astounded. They said, “Is not this the carpenter?” Mark 6:2,3"], ["prayer", "Great Teacher, we confess that we aren’t always listening. Sometimes we aren’t paying attention. At other times, we are oblivious to your word. We ask for forgiveness and guidance, so we may listen to you. Amen."]], "259": [["info", "Ministers’ Covenant Day† "], ["dateVerse", "Tuesday, September 16", "Psalm 107:10-16", "Jeremiah 49:17-39", "Hebrews 3:16-4:5"], ["watchD", "The heavens are telling the glory of God. Psalm 19:1"], ["docT", "Glorify God in your body. 1 Corinthians 6:20"], ["prayer", "Jesus, we place our faith in you. We listen and hear the heavens proclaim your glory. We follow you without being able to see you. May our faith be moved by the Holy Spirit. In your name, we pray. Amen."]], "260": [["dateVerse", "Wednesday, September 17", "Psalm 107:17-22", "Jeremiah 50:1-40", "Hebrews 4:6-16"], ["watchD", "Jeremiah said, “If I say, ‘I will not mention him or speak any more in his name,’ then within me there is something like a burning fire.” Jeremiah 20:9"], ["docT", "Pray for us as well, that God will open to us a door for the word, that we may declare the mystery of Christ, for which I am in prison, so that I may reveal it clearly, as I should. Colossians 4:3-4"], ["prayer", "O holy One, we declare our faith in you. When times are difficult, we try not to falter, and take comfort in the good news of your salvation. Your steadfast faith in us does not go unnoticed, and we thank you for your continued patience. Amen."]], "261": [["dateVerse", "Thursday, September 18", "Psalm 107:23-32", "Jeremiah 50:41-51:23", "Hebrews 5"], ["watchD", "The Lord said, “Why do you spend your money for that which is not bread and your earnings for that which does not satisfy? Listen carefully to me, and eat what is good.” Isaiah 55:2"], ["docT", "Jesus said, “The widow out of her poverty has put in everything she had, all she had to live on.” Mark 12:44"], ["prayer", "Lord of all creation, there is nothing that is of this world that we can offer to you. Our greatest riches are but a drop in the sea to you, but we can offer you ourselves, our devotion, and our faith. We humbly give what we can. Amen."]], "262": [["dateVerse", "Friday, September 19", "Psalm 107:33-43", "Jeremiah 51:24-64", "Hebrews 6:1-12"], ["watchD", "The surviving remnant of the house of Judah shall again take root downward and bear fruit upward. 2 Kings 19:30"], ["docT", "Jesus said, “Abide in me as I abide in you. Just as the branch cannot bear fruit by itself unless it abides in the vine, neither can you unless you abide in me.” John 15:4"], ["prayer", "Lord, our roots grow deep in your love. May that love help us bring forth growth and new life in your church, and bear fruit in your world. In your eternal wisdom, we trust. Amen."]], "263": [["dateVerse", "Saturday, September 20", "Psalm 108:1-5", "Jeremiah 52", "Hebrews 6:13-7:3"], ["watchD", "Teach me to do your will, for you are my God. Let your good spirit lead me on a level path. Psalm 143:10"], ["docT", "All who are led by the Spirit of God are children of God. Romans 8:14"], ["prayer", "God, our Father, we yearn to be obedient to follow the Holy Spirit. We have faith that you will lead us down a level path. The path need not be lonely when all your children walk in unison. We pray together. Amen."]], "264": [["info", "Fifteenth Sunday after Pentecost"], ["watchO", "Watchword for the week — From the rising of the sun to its setting the name of the Lord is to be praised. Psalm 113:3"], ["dateVerse", "Sunday, September 21", "Amos 8:4-7", "Psalm 113", "1 Timothy 2:1-7", "Luke 16:1-13"], ["watchD", "Ruth said, “Do not press me to leave you, to turn back from following you! Where you go, I will go; where you lodge, I will lodge; your people shall be my people and your God my God.” Ruth 1:16"], ["docT", "Boaz was the father of Obed by Ruth, and Obed the father of Jesse, and Jesse the father of King David. Jacob was the father of Joseph the husband of Mary, who bore Jesus, who is called the Messiah. Matthew 1:5-6,16"], ["prayer", "God, for generations you have offered us refuge in your kingdom. When we return home, we should be delighted to meet our forebears. These are not ancestors by blood, but fathers and mothers of thought. Help us to be a people that welcomes all and are united by love. Amen."]], "265": [["dateVerse", "Monday, September 22", "Psalm 108:6-13", "Lamentations 1:1-15", "Hebrews 7:4-17"], ["watchD", "Full of honor and majesty is the Lord’s work, and his righteousness endures forever. Psalm 111:3"], ["docT", "I no longer have a righteousness of my own, the kind that is gained by obeying the Law. I now have the righteousness that is given through faith in Christ, the righteousness that comes from God and is based on faith. Philippians 3:9 GNT"], ["prayer", "O Lord, you are the firm foundation on which we stand. We seek to live a righteous life, one built upon your foundation, a life full of honor that endures in you forever. To you, we pray. Amen."]], "266": [["dateVerse", "Tuesday, September 23", "Psalm 109:1-7", "Lamentations 1:16-2:10", "Hebrews 7:18-28"], ["watchD", "I will save you from all your uncleannesses. Ezekiel 36:29"], ["docT", "God did not call us to be impure, but to live a holy life. 1 Thessalonians 4:7 NIV"], ["prayer", "Jesus, we ask for forgiveness. We hear the call to live pure and clean lives. We acknowledge that we fall short, despite our best efforts. It is by design that we fail, and by design that you offer forgiveness. Please, hear our prayer. Amen."]], "267": [["dateVerse", "Wednesday, September 24", "Psalm 109:8-20", "Lamentations 2:11-3:15", "Hebrews 8"], ["watchD", "Help us, O God of our salvation, for the glory of your name; deliver us and forgive our sins, for your name’s sake. Psalm 79:9"], ["docT", "In his name the message about repentance and the forgiveness of sins must be preached to all nations. Luke 24:47 GNT"], ["prayer", "We are thankful that you forgive our sins, God. You have rescued us and offered us salvation. It is a blessing that we can repay you by sharing this news with all your people. They will know we are Christians by our love. May we show it through our words and actions. Amen."]], "268": [["dateVerse", "Thursday, September 25", "Psalm 109:21-31", "Lamentations 3:16-66", "Hebrews 9:1-10"], ["watchD", "The one who forms the mountains, creates the wind, reveals his thoughts to mortals—the Lord, the God of hosts, is his name! Amos 4:13"], ["docT", "Hallelujah! For the Lord God the Almighty reigns. Revelation 19:6"], ["prayer", "Creator of the world, we sing your praise. We rejoice in the fields, and we sing hallelujah in the rain. Nothing can dampen our spirits because the warmth of your love radiates from our hearts. We thankfully sing your praise. Amen."]], "269": [["dateVerse", "Friday, September 26", "Psalm 110", "Lamentations 4,5", "Hebrews 9:11-22"], ["watchD", "Many are saying to me, “There is no help for you in God.” But you, O Lord, are a shield around me, my glory, and the one who lifts up my head. Psalm 3:2-3"], ["docT", "Then one of them, when he saw that he was healed from the skin disease, turned back, praising God with a loud voice. Luke 17:15"], ["prayer", "We remain faithful to you, dear Jesus. Our faith is unwavering because you are our strength and shield. Furthermore, we are inspired by the miracles you perform. May we be witnesses to your amazing grace. Amen."]], "270": [["dateVerse", "Saturday, September 27", "Psalm 111", "Ezekiel 1,2", "Hebrews 9:23-10:4"], ["watchD", "Do not be afraid, but let your hands be strong. Zechariah 8:13"], ["docT", "Jesus said, “In the world you face persecution, but take courage: I have conquered the world!” John 16:33"], ["prayer", "We are always ready, O Lord. We will follow you whenever you ask. We are prepared to follow you into the world you have conquered, and to be a part of your kingdom. Until then, we pray. Amen."]], "271": [["info", "Sixteenth Sunday after Pentecost"], ["watchO", "Watchword for the week — There is great gain in godliness combined with contentment. 1 Timothy 6:6"], ["dateVerse", "Sunday, September 28", "Amos 6:1a,4-7", "Psalm 146", "1 Timothy 6:6-19", "Luke 16:19-31"], ["watchD", "The Lord watches over the strangers; he upholds the orphan and the widow. Psalm 146:9"], ["docT", "Do not forget to show hospitality to strangers, for by so doing some people have shown hospitality to angels without knowing it. Hebrews 13:2 NIV"], ["prayer", "Lord, you entrust us to watch over the least fortunate in life. Help us to look after strangers, the homeless, and disabled. We remember what you told us: when we do it for the least of these, we do it also for you. May we take good care of your people, Lord. Amen."]], "272": [["dateVerse", "Monday, September 29", "Psalm 112", "Ezekiel 3-4:5", "Hebrews 10:5-18"], ["watchD", "I am yours; save me. Psalm 119:94"], ["docT", "Suddenly an angel of the Lord appeared, and a light shone in the cell. He tapped Peter on the side and woke him, saying, “Get up quickly.” And the chains fell off his wrists. Acts 12:7"], ["prayer", "We try to survive on our own, God. Eventually we need help, and you are the ultimate savior. May we always rely on you, knowing you will graciously be there for us. Thanks be to you, O God. Amen."]], "273": [["dateVerse", "Tuesday, September 30", "Psalm 113", "Ezekiel 4:6-6:7", "Hebrews 10:19-31"], ["watchD", "Rise up, come to our help. Redeem us for the sake of your steadfast love. Psalm 44:26"], ["docT", "The God of all grace, who has called you to his eternal glory in Christ, will himself restore, support, strengthen, and establish you. 1 Peter 5:10"], ["prayer", "Lord, we are grateful that you call us to your eternal glory. When the time is right, we will rise up and come. Until that day, may our resolve to create your image here on Earth never waver. Amen."]], "274": [["dateVerse", "Wednesday, October 1", "Psalm 114", "Ezekiel 6:8-7:27", "Hebrews 10:32-11:3"], ["watchD", "And the Lord stirred up the spirit of all the remnant of the people, and they came and worked on the house of the Lord of hosts, their God. Haggai 1:14"], ["docT", "Jesus said, “I know your works, your toil and your endurance.” Revelation 2:2"], ["prayer", "God of fortitude, you bolster our bodies and our spirits for the physical work of your church. Guide our hands towards the building of your kingdom and our hearts towards your enduring love. Amen."]], "275": [["dateVerse", "Thursday, October 2", "Psalm 115:1-8", "Ezekiel 8,9", "Hebrews 11:4-16"], ["watchD", "Come and see what God has done: he is awesome in his deeds among mortals. Psalm 66:5"], ["docT", "Jesus said to the centurion, “Go; let it be done for you according to your faith.” And the servant was healed in that hour. Matthew 8:13"], ["prayer", "Astounding Savior, we give thanks for your bounteous gifts in our daily lives. We pray for open eyes, so that we may continue to see your transforming power at work in and around us. In your name, we pray. Amen."]], "276": [["dateVerse", "Friday, October 3", "Psalm 115:9-18", "Ezekiel 10:1-11:15", "Hebrews 11:17-28"], ["watchD", "Who has believed what we have heard? And to whom has the arm of the Lord been revealed? Isaiah 53:1"], ["docT", "Mary Magdalene went and announced to the disciples, “I have seen the Lord,” and she told them that he had said these things to her. John 20:18"], ["prayer", "Far-speaking Spirit, open our eyes to all our siblings who feel your presence moving among them. Let us be one in community with all our brethren of faith and let us together see your works revealed in the world. Amen."]], "277": [["dateVerse", "Saturday, October 4", "Psalm 116:1-7", "Ezekiel 11:16-12:28", "Hebrews 11:29-40"], ["watchD", "Solomon prayed: You have kept your promise to your servant David my father; with your mouth you have promised and with your hand you have fulfilled it— as it is today. 1 Kings 8:24 NIV"], ["docT", "The one who calls you is faithful. 1 Thessalonians 5:24"], ["prayer", "Steadfast Rock, your loyalty to us never wavers. You kept your covenant with us through Jesus Christ, our Lord; we pray for strength to live into the promise of his death. May we be faithful to you, as you are to us. In Christ’s strong name, we pray. Amen."]], "278": [["info", "Seventeenth Sunday after Pentecost"], ["watchO", "Watchword for the week — Commit your way to the Lord; trust in him, and he will act. Psalm 37:5"], ["dateVerse", "Sunday, October 5", "Habakkuk 1:1-4,2:1-4", "Psalm 37:1-9", "2 Timothy 1:1-14", "Luke 17:5-10"], ["watchD", "Whether it is good or bad, we will obey the voice of the Lord our God. Jeremiah 42:6"], ["docT", "But Jesus answered the disciples, “You give them something to eat.” Mark 6:37"], ["prayer", "Lord, we are hungry for your guidance. When we struggle to discern our path, let us feast at the table of your grace. Help us take direction from the words you speak to our hearts. Amen."]], "279": [["dateVerse", "Monday, October 6", "Psalm 116:8-14", "Ezekiel 13:1-14:11", "Hebrews 12:1-13"], ["watchD", "I believe that I shall see the goodness of the Lord in the land of the living. Psalm 27:13"], ["docT", "The prayer of faith will save the sick and the Lord will raise them up, and anyone who has committed sins will be forgiven. James 5:15"], ["prayer", "God always with us, we call upon your presence in the now. Help us see and know that your promises are not just for the everlasting, but for each immediate moment here on earth. Let us respond to your grace and power, and walk with you into the future. Amen."]], "280": [["dateVerse", "Tuesday, October 7", "Psalm 116:15-19", "Ezekiel 14:12-15:8", "Hebrews 12:14-24"], ["watchD", "I know that you can do all things and that no purpose of yours can be thwarted. Job 42:2"], ["docT", "Nothing will be impossible with God. Luke 1:37"], ["prayer", "Beacon of hope, fortify us with the assurance of your love and companionship as we journey through life’s many trials. With your steadying hand guiding us, we can weather any storm. In your name, we pray. Amen."]], "281": [["dateVerse", "Wednesday, October 8", "Psalm 117", "Ezekiel 16:1-42", "Hebrews 12:25-13:6"], ["watchD", "O Lord, you will hear the desire of the meek; you will strengthen their heart. Psalm 10:17"], ["docT", "When Jesus came to the place, he looked up and said to him, “Zacchaeus, hurry and come down, for I must stay at your house today.” So, he hurried down and was happy to welcome him. Luke 19:5-6"], ["prayer", "Compassionate Christ, through your life, you showed us how to walk among all of God’s children. May we keep our hearts, hands, and homes open to our neighbors in need. With all-encompassing love, we pray. Amen."]], "282": [["dateVerse", "Thursday, October 9", "Psalm 118:1-9", "Ezekiel 16:43-17:10", "Hebrews 13:7-19"], ["watchD", "The Lord said to Abram, “In you all the families of the earth shall be blessed.” Genesis 12:1,3"], ["docT", "Those who believe are blessed with Abraham who believed. Galatians 3:9"], ["prayer", "Safekeeper of all generations, we are children of your promise. We take strength in the steadfast belief of our ancestors who came before, both those we have known and those unknown to us. Help us to build a world to come, full of your love, set on Christ, the cornerstone. Amen."]], "283": [["dateVerse", "Friday, October 10", "Psalm 118:10-14", "Ezekiel 17:11-18:18", "Hebrews 13:20-James 1:8"], ["watchD", "I planted you as a choice vine from the purest stock. How then did you turn degenerate and become a wild vine? Jeremiah 2:21"], ["docT", "God has not rejected his people whom he foreknew. Romans 11:2"], ["prayer", "Master Gardener, you know us as seed, sprout, vine, and crop. You see our potential for bounteous harvest and our tendencies towards errancy and decay. Tend to us with a firm and gentle hand and give us the sweet waters of your guidance, so that we may blossom fully. Amen."]], "284": [["dateVerse", "Saturday, October 11", "Psalm 118:15-21", "Ezekiel 18:19-19:14", "James 1:9-18"], ["watchD", "Lord our Lord, how majestic is your name in all the earth! Psalm 8:1 NIV"], ["docT", "Jesus said, “You will be my witnesses in Jerusalem, in all Judea and Samaria, and to the ends of the earth.” Acts 1:8"], ["prayer", "Creator God, let us sing praises to you across your beautiful creation! Help us to see the wonders, both large and small, that you give to us each day, and that we may mark them with gladness. Amen."]], "285": [["info", "Eighteen Sunday after Pentecost"], ["watchO", "Watchword for the week — If we have died with him, we will also live with him. 2 Timothy 2:11"], ["dateVerse", "Sunday, October 12", "2 Kings 5:1-3,7-15c", "Psalm 111", "2 Timothy 2:8-15", "Luke 17:11-19"], ["watchD", "His authority would last forever, and his kingdom would never end. Daniel 7:14 GNT"], ["docT", "Jesus Christ is the same yesterday and today and forever. Hebrews 13:8"], ["prayer", "Christ, our eternal savior, you speak to us in all times and places. You are our constant, a guiding star for us as we navigate this tumultuous world. Though we change, your works remain our anchor. Let us hear your voice in all our tomorrows and praise your name our whole life long. Amen."]], "286": [["dateVerse", "Monday, October 13", "Psalm 118:22-29", "Ezekiel 20:1-29", "James 1:19-27"], ["watchD", "The Lord said, “Your wound is incurable, your injury beyond healing. But I will restore you to health and heal your wounds.” Jeremiah 30:12,17 NIV"], ["docT", "You know that Jesus Christ was revealed to take away sins, and in him there is no sin. 1 John 3:5-6"], ["prayer", "Lord, there are many ailments that afflict us: injuries of the heart, of the body, of the soul, of society. Through your power, we are equipped to face the work of restoration, knitting up hurts and pains, addressing injustices. Move within us a righteous spirit, and set us forth on the path of redemption and mercy. Amen."]], "287": [["dateVerse", "Tuesday, October 14", "Psalm 119:1-8", "Ezekiel 20:30-21:17", "James 2:1-13"], ["watchD", "You have delivered my soul from death, my eyes from tears, my feet from stumbling. Psalm 116:8"], ["docT", "A woman who had been suffering from a flow of blood for twelve years, and though she had spent all she had on physicians, no one could cure her. She came up behind him and touched the fringe of his cloak, and immediately her flow of blood stopped. Luke 8:43-44"], ["prayer", "Merciful Savior, we cry out to you for relief. In our sorrow, despair, and anguish, let us draw closer to you and the promise of your healing love. We yearn for the moment when your arms will enfold us, and your love surround us. Bring your comfort to us, we pray. Amen."]], "288": [["dateVerse", "Wednesday, October 15", "Psalm 119:9-16", "Ezekiel 21:18-22:22", "James 2:14-26"], ["watchD", "You shall go out in joy and be led back in peace. Isaiah 55:12"], ["docT", "The seventy-two returned with joy, saying, “Lord, in your name even the demons submit to us!” Jesus said to them, “Nevertheless, do not rejoice at this, that the spirits submit to you, but rejoice that your names are written in heaven.” Luke 10:17-18,20"], ["prayer", "Lord of the journey, we are but travelers in this world below. Though we may walk far from earthly homes, we know that we always have a home with you in heaven. Guide us safely through our wanderings and welcome us upon our return with joy. Amen."]], "289": [["dateVerse", "Thursday, October 16", "Psalm 119:17-24", "Ezekiel 22:23-23:27", "James 3:1-12"], ["watchD", "Do not be afraid, for I am with you and will bless you. Genesis 26:24"], ["docT", "Blessed be the God and Father of our Lord Jesus Christ, who has blessed us in Christ with every spiritual blessing in the heavenly places. Ephesians 1:3"], ["prayer", "God to whom we set our prayers, lift our burdens, open the doors! Let us call to you as Christ did, entreating your mercy and sure of your reply. We, with him, have been blessed with the pouring out of your power upon us—let our hearts be steadied. Amen."]], "290": [["dateVerse", "Friday, October 17", "Psalm 119:25-32", "Ezekiel 23:28-24:8", "James 3:13-4:6"], ["watchD", "I will not let you go, unless you bless me. Genesis 32:26"], ["docT", "Then children were being brought to him in order that he might lay his hands on them and pray. Matthew 19:13"], ["prayer", "Comforter and Sustainer, we fix our eyes on you. While we travel on life’s journey, may we feel the shelter of your care. Bring the power of your hands upon us; let us walk forth in the world clothed in your blessings. Amen."]], "291": [["dateVerse", "Saturday, October 18", "Psalm 119:33-40", "Ezekiel 24:9-25:14", "James 4:7-17"], ["watchD", "To the Lord our God belong mercy and forgiveness. Daniel 9:9"], ["docT", "In Jesus Christ we have redemption through his blood, the forgiveness of our trespasses, according to the riches of his grace. Ephesians 1:7"], ["prayer", "Rock of our faith, when we stumble, falter, and fail, we know our most full redemption comes from you. Help us extend your spirit of forgiveness in our own lives, as you have extended it to us. Amen."]], "292": [["info", "Nineteenth Sunday after Pentecost"], ["watchO", "Watchword for the week — Proclaim the message; be persistent whether the time is favorable or unfavorable; convince, rebuke, and encourage, with the utmost patience in teaching. 2 Timothy 4:2"], ["dateVerse", "Sunday, October 19", "Genesis 32:22-31", "Psalm 121", "2 Timothy 3:14-4:5", "Luke 18:1-8"], ["watchD", "O God, do not keep silent; do not hold your peace or be still, O God! Even now your enemies are in tumult; those who hate you have raised their heads. Psalm 83:1-2"], ["docT", "Lord, should we strike with the sword? Luke 22:49"], ["prayer", "In a world filled with strife, it is too easy to hunger for retribution. Lord, let us forsake the quick but cruel sword; be our shield against anger and hatred. Guide our hearts towards lasting peace and our hands towards the enduring work of turning swords to plowshares, we pray. Amen."]], "293": [["dateVerse", "Monday, October 20", "Psalm 119:41-48", "Ezekiel 25:15-27:11", "James 5:1-12"], ["watchD", "His dominion shall be from sea to sea and to the ends of the earth. Zechariah 9:10"], ["docT", "Again, the devil took him to a very high mountain and showed him all the kingdoms of the world and their glory, and he said to him, “All these I will give you, if you will fall down and worship me.” Then Jesus said to him, “Away with you, Satan!” Matthew 4:8-10"], ["prayer", "Resplendent Nurturer, you entrust the caretaking of your magnificent creation to us. Yet we see how all too easy it is to conquer and exploit this gift. Help us turn away from the allure of greed and the promise of material reward and orient us towards the joy of living in harmony with your bountiful earth. Amen."]], "294": [["dateVerse", "Tuesday, October 21", "Psalm 119:49-56", "Ezekiel 27:12-28:10", "James 5:13-20"], ["watchD", "Abram went, as the Lord had told him. Genesis 12:4"], ["docT", "For we are the people he called, not only from among the Jews but also from among the Gentiles. Romans 9:24 GNT"], ["prayer", "Light on our path, you send us out into the world to be a light unto others. Let us walk with curiosity and open-hearted wonder among your people, all of whom are our kin. As we return to our own communities, empower us to bring those connections home with us. O great Connector, Holy Spirit, to you, we pray. Amen."]], "295": [["dateVerse", "Wednesday, October 22", "Psalm 119:57-64", "Ezekiel 28:11-29:12", "1 Peter 1:1-12"], ["watchD", "Thus said the Lord, “Just as I have brought all this great disaster upon this people, so I will bring upon them all the good fortune that I now promise them.” Jeremiah 32:42"], ["docT", "Our hope for you is unshaken, for we know that as you share in our sufferings, so also you share in our consolation. 2 Corinthians 1:7"], ["prayer", "Sometimes the disasters of the world are too much for our hearts to bear, O God. When hardship befalls us, you are there. When our communities are hurting, you are there. When we long to tear our eyes from the injustices of the world, you are there. Bring us steadfast companionship and sweet consolation as a balm to our broken hearts. This we most urgently pray. Amen."]], "296": [["dateVerse", "Thursday, October 23", "Psalm 119:65-72", "Ezekiel 29:13-30:26", "1 Peter 1:13-25"], ["watchD", "Can a woman forget her nursing child or show no compassion for the child of her womb? Even these might forget, yet I will not forget you. Isaiah 49:15"], ["docT", "God is love. 1 John 4:8"], ["prayer", "God of abiding love, hold us close to you as your most precious children. Nourish us; nurture us; wrap us in your care. Let us face each new day leading with love, as you have taught us. Amen."]], "297": [["dateVerse", "Friday, October 24", "Psalm 119:73-80", "Ezekiel 31:1-32:16", "1 Peter 2:1-12"], ["watchD", "“There is hope for your future,” says the Lord. Jeremiah 31:17"], ["docT", "In the ages to come God might show the immeasurable riches of his grace in kindness toward us in Christ Jesus. Ephesians 2:7"], ["prayer", "God of everlasting promise, you gave us your son, Jesus Christ, to give us hope on earth. He died to give us hope for things to come. The spirit lives with us as a reminder of that covenant, and through the presence of the Holy Spirit, we know that you remain with us. We renew our troth to you every morning as we pray. Amen."]], "298": [["dateVerse", "Saturday, October 25", "Psalm 119:81-88", "Ezekiel 32:17-33:20", "1 Peter 2:13-25"], ["watchD", "You shall eat your bread to the full and live securely in your land. Leviticus 26:5"], ["docT", "The bread of God is that which comes down from heaven and gives life to the world. John 6:33"], ["prayer", "Lord of the hungry, when we look to you for nourishment, you provide not only for our empty bellies, but also for our empty hearts. The gift of your dear son has sustained us as the bread of life, filling our bodies and souls. We thank you for this most precious communion. Amen."]], "299": [["info", "Twentieth Sunday after Pentecost"], ["watchO", "Watchword for the week — Jesus said, “All who exalt themselves will be humbled, but all who humble themselves will be exalted.” Luke 18:14"], ["dateVerse", "Sunday, October 26", "Jeremiah 14:7-10,19-22", "Psalm 84:1-7", "2 Timothy 4:6-8,16-18", "Luke 18:9-14"], ["watchD", "Do not withhold good from those to whom it is due, when it is in your power to do it. Proverbs 3:27"], ["docT", "If a person with gold rings and in fine clothes comes into your assembly, and if a poor person in dirty clothes also comes in, and if you take notice of the one wearing the fine clothes and say, “Have a seat here in a good place, please,” while to the one who is poor you say, “Stand there,” or, “Sit by my footstool,” have you not made distinctions among yourselves and become judges with evil thoughts? James 2:2-4"], ["prayer", "Beneficent Savior, we know that your ministry was among the people. You made peers of the tax collectors and the prostitutes, and you were a friend of fishermen. May our own communities include the overlooked, building bonds of love, where all too easily there could be dismissal and exclusion. Help us every day to live into the promise of your all-inclusive grace. Amen."]], "300": [["dateVerse", "Monday, October 27", "Psalm 119:89-96", "Ezekiel 33:21-34:19", "1 Peter 3:1-7"], ["watchD", "The eyes of all look to you, and you give them their food in due season. You open your hand, satisfying the desire of every living thing. Psalm 145:15-16"], ["docT", "John the Baptist said, “Whoever has two coats must share with anyone who has none, and whoever has food must do likewise.” Luke 3:11"], ["prayer", "God of the helping hand, you feed your flock with a rich feast of spiritual and material blessings. As we recognize your gracious generosity in our lives, let us turn outwards and offer those blessings among your people, for your sake. Make us a force for your abounding joy. Amen."]], "301": [["dateVerse", "Tuesday, October 28", "Psalm 119:97-104", "Ezekiel 34:20-36:7", "1 Peter 3:8-22"], ["watchD", "Pride goes before destruction and a haughty spirit before a fall. Proverbs 16:18"], ["docT", "Jesus said, “It is what comes out of a person that defiles.” Mark 7:20"], ["prayer", "O most human Christ, by walking among us, you clearly saw the many ways our hearts could turn from good. When we falter on the path you set before us, bring to us mercy and guidance to help us find the course of true righteousness. This we humbly pray. Amen."]], "302": [["dateVerse", "Wednesday, October 29", "Psalm 119:105-112", "Ezekiel 36:8-38", "1 Peter 4"], ["watchD", "The Lord said, “If you obey my voice and keep my covenant, you shall be my treasured possession out of all the peoples. Indeed, the whole earth is mine.” Exodus 19:5"], ["docT", "Jesus said, “If you keep my commandments, you will abide in my love, just as I have kept my Father’s commandments and abide in his love.” John 15:10"], ["prayer", "Lord and Comforter, what a joy to be enfolded in your tender care! Your love and warmth suffuse us. Let the light and assurance we feel from you shine through us this day. Radiant Lord, in your name, we pray. Amen."]], "303": [["dateVerse", "Thursday, October 30", "Psalm 119:113-120", "Ezekiel 37:1-38:6", "1 Peter 5"], ["watchD", "O Lord, save my life; deliver me for the sake of your steadfast love. Psalm 6:4"], ["docT", "God consoles us in all our affliction, so that we may be able to console those who are in any affliction with the consolation with which we ourselves are consoled by God. 2 Corinthians 1:4"], ["prayer", "When we know hardship and suffering, Lord, bring us closer to your love. Let us be renewed through the gift of your blessed assurance. Help us turn to our neighbors, and act as your agents in the world, outstretching the hand of comfort and love for them as you did for us. Enfold and empower us, Lord, we pray. Amen."]], "304": [["info", "Reformation Day "], ["dateVerse", "Friday, October 31", "Psalm 119:121-128", "Ezekiel 38:7-39:13", "2 Peter 1:1-11"], ["watchD", "“Why do you bring charges against me? You have all rebelled against me,” declares the Lord. Jeremiah 2:29 NIV"], ["docT", "There is no distinction, since all have sinned and fall short of the glory of God; they are now justified by his grace as a gift, through the redemption that is in Christ Jesus. Romans 3:22-24"], ["prayer", "Lord, daily we wrestle with how best to draw close to you. When we fear you have turned your face away from us—in moments of spite, or anger, or hurt—bring us reminders of your unrelenting grace. Stay with us and draw us close. In your name, we humbly pray. Amen."]], "305": [["info", "All Saints Day"], ["watchO", "Watchword for All Saints Day — Salvation belongs to our God who is seated on the throne, and to the Lamb! Revelation 7:10"], ["dateVerse", "Saturday, November 1", "Psalm 119:129-136", "Ezekiel 39:14-40:16", "2 Peter 1:12-21"], ["specialVerse", "All Saints Day", "Daniel 7:1-3,15-18", "Psalm 149", "Ephesians 1:11-23", "Luke 6:20-31"], ["watchD", "I shall not be put to shame, having my eyes fixed on all your commandments. Psalm 119:6"], ["docT", "Jesus said, “But the seed on good soil stands for those with a noble and good heart, who hear the word, retain it, and by persevering produce a crop.” Luke 8:15 NIV"], ["prayer", "Wise Teacher, on this All Saints Day, we remember your saints, past and present. You guided them and planted seeds within them that grew. Just as your love grew in them, may they inspire us in our own spiritual growth. Amen."]], "306": [["info", "Twenty-first Sunday after Pentecost"], ["watchO", "Watchword for the week — Jesus said, “For the son of man came to seek and to save the lost.” Luke 19:10"], ["dateVerse", "Sunday, November 2", "Isaiah 1:10-18", "Psalm 32:1-7", "2 Thessalonians 1:1-4,11-12", "Luke 19:1-10"], ["watchD", "Many nations shall join themselves to the Lord on that day and shall be my people. Zechariah 2:11"], ["docT", "God will dwell with them; they will be his peoples, and God himself will be with them and be their God. Revelation 21:3"], ["prayer", "God, our spirit friend, you have made and chosen us to be your people. You dwell among us and within us. We sing our praises to you that you are always with us! Amen."]], "307": [["dateVerse", "Monday, November 3", "Psalm 119:137-144", "Ezekiel 40:17-49", "2 Peter 2:1-10"], ["watchD", "Even now my witness is in heaven, and my advocate is on high. Job 16:19"], ["docT", "Since, then, we have a great high priest who has passed through the heavens, Jesus, the Son of God, let us hold fast to our confession. Hebrews 4:14"], ["prayer", "Merciful Father, when we feel alone, just knowing that you are always there to compassionately stand up for us through our troubles and tribulations gives us hope. Your love and mercy have drawn us near and given us life. Thank you. Amen."]], "308": [["dateVerse", "Tuesday, November 4", "Psalm 119:145-152", "Ezekiel 41:1-42:9", "2 Peter 2:11-22"], ["watchD", "I walk before the Lord in the land of the living. Psalm 116:9"], ["docT", "So you also must consider yourselves dead to sin and alive to God in Christ Jesus. Romans 6:11"], ["prayer", "Our redeeming God, we trust in you to direct and protect us through life. As a young child takes their parent’s hand crossing the street, so you take our hand to guide us. We can face the future and not be afraid. Thank you for your protection. Amen."]], "309": [["dateVerse", "Wednesday, November 5", "Psalm 119:153-160", "Ezekiel 42:10-43:21", "2 Peter 3:1-13"], ["watchD", "Let us test and examine our ways and return to the Lord. Lamentations 3:40"], ["docT", "This is my prayer, that your love may overflow more and more with knowledge and full insight to help you to determine what really matters, so that in the day of Christ you may be pure and blameless. Philippians 1:9-10"], ["prayer", "Merciful God, you have always made us feel worthy, even when we examine ourselves and know that we do not measure up to your expectations. We pray for knowledge of what truly matters in our lives so that we may release the trivial. Amen."]], "310": [["dateVerse", "Thursday, November 6", "Psalm 119:161-168", "Ezekiel 43:22-44:27", "2 Peter 3:14-1 John 1:4"], ["watchD", "For my name’s sake I defer my anger; for the sake of my praise I restrain it for you, so that I may not cut you off. Isaiah 48:9"], ["docT", "The angel said to Joseph, “Mary will bear a son, and you are to name him Jesus, for he will save his people from their sins.” Matthew 1:21"], ["prayer", "Compassionate Lord, we are thankful you do not treat us according to our sin but sent your son to veil our transgressions. You are merciful, even when we deserve your anger and rebuke. We ask for your forgiveness. Amen."]], "311": [["dateVerse", "Friday, November 7", "Psalm 119:169-176", "Ezekiel 44:28-45:25", "1 John 1:5-2:11"], ["watchD", "May all who seek you rejoice and be glad in you. Psalm 40:16"], ["docT", "“Blessed is the king who comes in the name of the Lord! Peace in heaven, and glory in the highest heaven!” Luke 19:38"], ["prayer", "Gracious God, you listen when we ask; you are present when we search; and you open the door wide when we knock. You are ever-present in our lives and worthy of all our praise. Thank you. Amen."]], "312": [["dateVerse", "Saturday, November 8", "Psalm 120", "Ezekiel 46:1-47:12", "1 John 2:12-17"], ["watchD", "I will lead the blind by a road they do not know; by paths they have not known I will guide them. Isaiah 42:16"], ["docT", "Jesus said, “I am the light of the world. Whoever follows me will never walk in darkness but will have the light of life.” John 8:12"], ["prayer", "God of light, the sun feels so good upon our face in the middle of winter, but to be in your light is unimaginably better. May we reflect your light and share your warmth with all people! Amen."]], "313": [["info", "Twenty-second Sunday after Pentecost"], ["watchO", "Watchword for the week — For I know that my Redeemer lives, and that at the last he will stand upon the earth. Job 19:25"], ["dateVerse", "Sunday, November 9", "Job 19:23-27a", "Psalm 17:1-9", "2 Thessalonians 2:1-5,13-17", "Luke 20:27-38"], ["watchD", "So be careful, lest you forget the covenant that the Lord your God made with you and make for yourselves an idol in the form of anything that the Lord your God has forbidden you. Deuteronomy 4:23"], ["docT", "Ever since God created the world, his invisible qualities, both his eternal power and his divine nature, have been clearly seen; they are perceived in the things that God has made. Romans 1:20 GNT"], ["prayer", "Precious Lord, too many times we reject your ways and seek comfort elsewhere. Help us remember that you are the source of everything we need. May our eyes see, and lips tell of all the great and wonderful things you have made! Amen."]], "314": [["dateVerse", "Monday, November 10", "Psalm 121", "Ezekiel 47:13-48:22", "1 John 2:18-29"], ["watchD", "Why do you contend against God, saying, “He will answer none of my words?” For God speaks in one way and in two, though people do not perceive it. Job 33:13-14"], ["docT", "Let anyone who has an ear listen to what the Spirit is saying to the churches. Revelation 2:7"], ["prayer", "Abba, Father, sometimes it is in the stillness that we can hear you best. Sometimes when we pray, we are so busy saying our words and distracted by our thoughts, that we’re not listening. Open our eyes, ears, mind, and heart to discern your will. Amen."]], "315": [["dateVerse", "Tuesday, November 11", "Psalm 122", "Ezekiel 48:23-Daniel 1:21", "1 John 3:1-10"], ["watchD", "Do not fear or be dismayed. Joshua 8:1"], ["docT", "Jesus touched their eyes and said, “According to your faith, let it be done to you.” And their eyes were opened. Matthew 9:29-30"], ["prayer", "Almighty Healer, the balm that you offer to the world is soothing and comforting. Why are we so often afraid to accept it? Help us to trust and believe in you whenever we experience the struggles and storms of life. In your name, we pray. Amen."]], "316": [["dateVerse", "Wednesday, November 12", "Psalm 123", "Daniel 2:1-33", "1 John 3:11-24"], ["watchD", "You must not be partial in judging: hear out the small and the great alike; you shall not be intimidated by anyone, for the judgment is God’s. Deuteronomy 1:17"], ["docT", "But if you show partiality, you commit sin and are convicted by the law as transgressors. James 2:9"], ["prayer", "God of justice, so often we take it upon ourselves to judge others by appearances, social status, or petty grievances. Help us to remember that, as your servants, our task is to love, forgive, console, and understand. Amen."]], "317": [["info", "Chief Elder Festival"], ["dateVerse", "Thursday, November 13", "Psalm 124", "Daniel 2:34-3:18", "1 John 4:1-16a"], ["specialVerse", "Chief Elder Festival†", "Ezekiel 34:11-16,23-24", "Psalm 8", "Hebrews 4:14-16", "John 10:1-10"], ["watchD", "Lord I rejoice in your victory. 1 Samuel 2:1"], ["docT", "Thanks be to God, who gives us the victory through our Lord Jesus Christ. 1 Corinthians 15:57"], ["prayer", "Jesus Christ, our Chief Elder, head of the church, and head of our faith, help us to be strong in faith as we remember that you are head of every authority and governing body. Give us vision, guidance, and grace to carry out your plan. Amen."]], "318": [["dateVerse", "Friday, November 14", "Psalm 125", "Daniel 3:19-4:18", "1 John 4:16b-5:5"], ["watchD", "As an eagle stirs up its nest, and hovers over its young, the Lord spread his wings, he caught them, he carried them on his pinions. Deuteronomy 32:10-12 NASB"], ["docT", "My Father, who has given them to me, is greater than all; no one can snatch them out of my Father’s hand. John 10:29 NIV"], ["prayer", "Gentle Shepherd, bring us close to you to comfort and calm our fears. Through the unexpected struggles we face, you have always been there to provide for us. May we fully trust in your amazing care. Amen."]], "319": [["dateVerse", "Saturday, November 15", "Psalm 126", "Daniel 4:19-5:16", "1 John 5:6-21"], ["watchD", "Satisfy us in the morning with your steadfast love, so that we may rejoice and be glad all our days. Psalm 90:14"], ["docT", "The aim of such instruction is love that comes from a pure heart, a good conscience, and sincere faith. 1 Timothy 1:5"], ["prayer", "God Almighty, we trust that the sun will rise in the morning and set in the evening, but we do not always trust in the things we cannot see or feel. Help us to trust in you—the rock on which our faith depends. Amen."]], "320": [["info", "Twenty-third Sunday after Pentecost"], ["watchO", "Watchword for the week — Brothers and sisters, do not be weary in doing what is right. 2 Thessalonians 3:13"], ["dateVerse", "Sunday, November 16", "Malachi 4:1-2a", "Psalm 98", "2 Thessalonians 3:6-13", "Luke 21:5-19"], ["watchD", "The Lord regarded their distress when he heard their cry. For their sake he remembered his covenant. Psalm 106:44-45"], ["docT", "While they were stoning Stephen, he prayed, “Lord Jesus, receive my spirit.” Acts 7:59"], ["prayer", "Forgiving God, you call us to forgive others as you forgive us. Too often we do not extend forgiveness to ourselves and others. Help us to remember what your loving, forgiving, anger-dispelling embrace feels like when forgiveness isn’t our initial response. Amen."]], "321": [["dateVerse", "Monday, November 17", "Psalm 127", "Daniel 5:17-6:18", "2 John"], ["watchD", "All the paths of the Lord are steadfast love and faithfulness, for those who keep his covenant and his decrees. Psalm 25:10"], ["docT", "Jesus said, “Blessed are you when people revile you and persecute you and utter all kinds of evil against you falsely on my account. Rejoice and be glad, for your reward is great in heaven.” Matthew 5:11-12"], ["prayer", "Faithful Lord, blessed to be a blessing are we as your children. May we comfort and uplift others who feel persecuted, sorrowful, and rejected. Let them know they are blessed and loved, too. Amen."]], "322": [["dateVerse", "Tuesday, November 18", "Psalm 128", "Daniel 6:19-7:22", "3 John"], ["watchD", "The Lord is a shield for all who take refuge in him. Psalm 18:30"], ["docT", "Hoping against hope, Abraham believed that he would become “the father of many nations.” Romans 4:18"], ["prayer", "God of Abraham, you made a covenant that you kept when you claimed us as your people. Abraham had a great faith and believed you, even through his advancing age. May we be equally faithful as we promise to keep your word within our hearts and minds. Amen."]], "323": [["dateVerse", "Wednesday, November 19", "Psalm 129", "Daniel 7:23-8:27", "Jude 1:1-10"], ["watchD", "Woe to those who devise wickedness because it is in their power. Micah 2:1"], ["docT", "Jesus called the disciples to him and said, “You know that the rulers of the gentiles lord it over them, and their great ones are tyrants over them. It will not be so among you.” Matthew 20:25-26"], ["prayer", "God of every nation, we live in a time of hatred, war, and despair. Help us to know that you are our refuge and strength throughout. We have hope that one day the world will be at peace, and truth and justice will reign. Amen."]], "324": [["dateVerse", "Thursday, November 20", "Psalm 130", "Daniel 9:1-10:7", "Jude 1:11-25"], ["watchD", "The Lord God formed man from the dust of the ground and breathed into his nostrils the breath of life, and the man became a living being. Genesis 2:7"], ["docT", "It is no longer I who live, but it is Christ who lives in me. And the life I now live in the flesh I live by the faith of the Son of God, who loved me and gave himself for me. Galatians 2:20"], ["prayer", "Breath of life, when we concentrate on our breathing, it reminds us to slow our racing minds and anxious hearts. Help us to be still and know that you are God, and we are yours. Strengthen and comfort us, we pray. Amen."]], "325": [["dateVerse", "Friday, November 21", "Psalm 131", "Daniel 10:8-11:19", "Revelation 1:1-8"], ["watchD", "O Lord God, you are God, and your words are true. 2 Samuel 7:28"], ["docT", "Jesus said, “If you continue in my word, you are truly my disciples, and you will know the truth, and the truth will make you free.” John 8:31-32"], ["prayer", "Unchanging God, we pray for your guidance in our decisions. May what we do be for your glory. Abide with us and give us hope, strength, and confidence to do the things you would have us do. Amen."]], "326": [["dateVerse", "Saturday, November 22", "Psalm 132", "Daniel 11:20-12:7", "Revelation 1:9-20"], ["watchD", "I am merciful, says the Lord; I will not be angry forever. Only acknowledge your guilt, that you have rebelled against the Lord your God. Jeremiah 3:12-13"], ["docT", "Forgive us our debts, as we also have forgiven our debtors. Matthew 6:12"], ["prayer", "Merciful Lord, you are our shining example of forgiveness. Despite our unpaid debts, deeds left undone, and flaws we wish we could fix, you have given us your son, Jesus, who upon the cross, wiped our slate clean. Knowing this, how can we not forgive others? Amen."]], "327": [["info", "Reign of Christ (Christ the King)"], ["watchO", "Watchword for the week — Be still, and know that I am God! I am exalted among the nations, I am exalted in the earth. Psalm 46:10"], ["dateVerse", "Sunday, November 23", "Jeremiah 23:1-6", "Psalm 46", "Colossians 1:11-20", "Luke 23:33-43"], ["watchD", "The Lord said, “I will give you as a light to the nations, that my salvation may reach to the end of the earth.” Isaiah 49:6"], ["docT", "During the night Paul had a vision: there stood a man of Macedonia pleading with him and saying, “Come over to Macedonia and help us.” When he had seen the vision, we immediately tried to cross over to Macedonia, being convinced that God had called us to proclaim the good news to them. Acts 16:9-10"], ["prayer", "God of light and truth, you are a light unto the world. Give us a willing heart to be beacons of faith, love, and hope to those in darkness. With thanksgiving, we pray in your holy name. Amen."]], "328": [["dateVerse", "Monday, November 24", "Psalm 133", "Daniel 12:8-Hosea 2:15", "Revelation 2:1-11"], ["watchD", "King Nebuchadnezzar said, “The signs and wonders that the Most High God has worked for me I am pleased to recount.” Daniel 4:2"], ["docT", "Jesus said, “Whoever is not against us is for us.” Mark 9:40"], ["prayer", "Spirit of the living God, fall afresh on us. Open our hearts and minds to be receptive to your Spirit. Inspire us to go out to serve our neighbors and witness to your love, mercy, and grace. Amen."]], "329": [["dateVerse", "Tuesday, November 25", "Psalm 134", "Hosea 2:16-4:19", "Revelation 2:12-23"], ["watchD", "The Lord will fulfill his purpose for me. Psalm 138:8"], ["docT", "Having been made perfect, Jesus became the source of eternal salvation for all who obey him. Hebrews 5:9"], ["prayer", "Saving God, you sent Jesus to us to show us what perfect love is. We ask for your divine guidance so that your love may unfold in us. Grant us this day, and every day, the strength to hold onto your promises. Amen."]], "330": [["dateVerse", "Wednesday, November 26", "Psalm 135:1-12", "Hosea 5,6,7", "Revelation 2:24-3:6"], ["watchD", "Lord, you have plans formed of old, faithful, and sure. Isaiah 25:1"], ["docT", "Let us hold fast to the confession of our hope without wavering, for he who has promised is faithful. Hebrews 10:23"], ["prayer", "There are times when we get too wrapped up in our own lives, merciful God, and we forget to come to you. Thank you for your loving faithfulness and for always being there with encouragement that draws us closer to you. Amen."]], "331": [["dateVerse", "Thursday, November 27", "Psalm 135:13-21", "Hosea 8,9", "Revelation 3:7-18"], ["watchD", "God said, “In distress you called, and I rescued you.” Psalm 81:7"], ["docT", "When Peter noticed the strong wind, he became frightened, and, beginning to sink, he cried out, “Lord, save me!” Jesus immediately reached out his hand and caught him. Matthew 14:30-31"], ["prayer", "Eternal Father, we thank you for being there when we cry out, “Lord, save me!” When we call out in times of distress, fear, and anxiety, open our eyes to your compassionate presence and the blessings around us that you provide. Amen."]], "332": [["dateVerse", "Friday, November 28", "Psalm 136", "Hosea 10,11,12", "Revelation 3:19-4:8"], ["watchD", "For as the new heavens and the new earth, which I will make, shall remain before me, says the Lord, so shall your descendants and your name remain. Isaiah 66:22"], ["docT", "Nathanael replied, “Rabbi, you are the Son of God! You are the King of Israel!” John 1:49"], ["prayer", "Omnipotent God, you desire a humble and contrite heart. We confess that we have been weighed down by earthly distractions. Help us know what it is that holds us back and keeps us from following you without any reservation. We pray for your guidance. Amen."]], "333": [["dateVerse", "Saturday, November 29", "Psalm 137", "Hosea 13,14", "Revelation 4:9-5:10"], ["watchD", "A day in your courts is better than a thousand elsewhere. Psalm 84:10"], ["docT", "Jesus said to his parents, “Why were you searching for me? Did you not know that I must be in my Father’s house?” Luke 2:49"], ["prayer", "Father, to be anywhere with you is home to us. Help us grow closer to you each day with practices of prayer, worship, and love for each other and for you. Lead us in our walk through life to an eternal life in your house. Amen."]], "334": [["info", "First Sunday of Advent"], ["watchO", "Watchword for the week — Come, let us walk in the light of the Lord! Isaiah 2:5"], ["dateVerse", "Sunday, November 30", "Isaiah 2:1-5", "Psalm 122", "Romans 13:11-14", "Matthew 24:36-44"], ["watchD", "No longer shall they teach one another or say to each other, “Know the Lord,” for they shall all know me, from the least of them to the greatest, says the Lord. Jeremiah 31:34"], ["docT", "When the chief priests and the scribes saw the amazing things that he did and heard the children crying out in the temple and saying, “Hosanna to the Son of David,” they became angry and said to him, “Do you hear what these are saying?” Jesus said to them, “Yes; have you never read, ‘Out of the mouths of infants and nursing babies you have prepared praise for yourself?’” Matthew 21:15-16"], ["prayer", "Gracious King and Savior, we delight in your promise of living in your kingdom when our days are done, and we sing your praises evermore. Equip us with gifts for service here on earth so that we are deemed ready at your call. Amen."]], "335": [["dateVerse", "Monday, December 1", "Psalm 138:1-5", "Joel 1:1-2:14", "Revelation 5:11-6:8"], ["watchD", "O send out your light and your truth; let them lead me to your dwelling. Psalm 43:3"], ["docT", "Simeon said, “Master, now you are dismissing your servant in peace, according to your word, for my eyes have seen your salvation, which you have prepared in the presence of all peoples, a light for revelation to the Gentiles and for glory to your people Israel.” Luke 2:29-32"], ["prayer", "Light of the world, mold us to bring your light to a world that desperately needs it. May your salvation light up the darkness of all that separates us as children of God. Amen."]], "336": [["dateVerse", "Tuesday, December 2", "Psalm 138:6-8", "Joel 2:15-3:21", "Revelation 6:9-7:8"], ["watchD", "Restore me, and I will return, because you are the Lord my God. Jeremiah 31:18 NIV"], ["docT", "Paul said, “We bring you good news, that you should turn from these worthless things to the living God, who made the heaven and the earth and the sea and all that is in them.” Acts 14:15"], ["prayer", "Dear Jesus, help us to be inspired and excited to share your good news with the world. May we always be guided by the fact you came to save and not condemn the world. Amen."]], "337": [["dateVerse", "Wednesday, December 3", "Psalm 139:1-6", "Amos 1,2", "Revelation 7:9-17"], ["watchD", "Would that all the Lord’s people were prophets and that the Lord would put his Spirit on them! Numbers 11:29"], ["docT", "You will receive power when the Holy Spirit has come upon you. Acts 1:8"], ["prayer", "Holy Spirit, help us to trust that you are doing miraculous things in our world today. Call us to witness and participate in the miraculous beauty around us. Amen."]], "338": [["dateVerse", "Thursday, December 4", "Psalm 139:7-12", "Amos 3,4", "Revelation 8"], ["watchD", "Your descendants who have never heard the Law of the Lord your God will hear it. And so they will learn to obey him. Deuteronomy 31:13 GNT"], ["docT", "And, fathers, do not provoke your children to anger, but bring them up in the discipline and instruction of the Lord. Ephesians 6:4"], ["prayer", "Heavenly Father, help us to remember that we are not the source of salvation. We are the ones called to show others just how impactful it can be to serve your kingdom. Amen."]], "339": [["dateVerse", "Friday, December 5", "Psalm 139:13-16", "Amos 5", "Revelation 9:1-11"], ["watchD", "Show us your steadfast love, O Lord, and grant us your salvation. Psalm 85:7"], ["docT", "Salvation is from the Jews. John 4:22"], ["prayer", "Christ, you are the morning star that guides us on the path of salvation. May we courageously stand united with all children of God in need. Amen."]], "340": [["dateVerse", "Saturday, December 6", "Psalm 139:17-24", "Amos 6,7", "Revelation 9:12-21"], ["watchD", "Lord save us! Lord, grant us success! Psalm 118:25 NIV"], ["docT", "The Holy Spirit said, “Set apart for me Barnabas and Saul for the work to which I have called them.” Then after fasting and praying they laid their hands on them and sent them off. Acts 13:2-3"], ["prayer", "Holy Spirit, may we feel your presence descend upon us as we seek you through prayer. Guide us to succeed in serving you in our daily lives. Amen."]], "341": [["info", "Second Sunday of Advent"], ["watchO", "Watchword for the week — Repent, for the kingdom of heaven has come near. Matthew 3:2"], ["dateVerse", "Sunday, December 7", "Isaiah 11:1-10", "Psalm 72", "Romans 15:4-13", "Matthew 3:1-12"], ["watchD", "The Lord lifts up those who are bowed down. Psalm 146:8"], ["docT", "Very truly, I tell you, you will weep and mourn, but the world will rejoice; you will have pain, but your pain will turn into joy. John 16:20"], ["prayer", "Great Comforter, help us to remember that it is okay for us to cry when we feel sad or brokenhearted. Empower us to remember, in the midst of our pain, that those tears never get the last word. Amen."]], "342": [["dateVerse", "Monday, December 8", "Psalm 140:1-5", "Amos 8,9", "Revelation 10"], ["watchD", "Return to your God; hold fast to love and justice, and wait continually for your God. Hosea 12:6"], ["docT", "Paul wrote: Christ Jesus came into the world to save sinners—of whom I am the foremost. But for that very reason I received mercy, so that in me, as the foremost, Jesus Christ might display the utmost patience as an example to those who would come to believe in him for eternal life. 1 Timothy 1:15-16"], ["prayer", "Lord of sinners, help us to remember that there is no wrong turn or wrong path from which you cannot rescue us. May we seek your warm and tender embrace in our times of struggle. Amen."]], "343": [["dateVerse", "Tuesday, December 9", "Psalm 140:6-13", "Obadiah 1", "Jonah 1,2", "Revelation 11:1-14"], ["watchD", "Even when you turn gray I will carry you. I have made, and I will bear; I will carry and will save. Isaiah 46:4"], ["docT", "Show respect for widows who really are all alone. 1 Timothy 5:3 GNT"], ["prayer", "Great Comforter, help us to remember that, when trials and tribulations come in life, you are not a God that runs away, but you find ways to pull us closer to your love. For that tenderness, we give thanks. Amen."]], "344": [["dateVerse", "Wednesday, December 10", "Psalm 141:1-4", "Jonah 3,4", "Revelation 11:15-12:6"], ["watchD", "You are great, O Lord God, for there is no one like you, and there is no God besides you, according to all that we have heard with our ears. 2 Samuel 7:22"], ["docT", "I am the Alpha and the Omega, the First and the Last, the Beginning and the End. Revelation 22:13"], ["prayer", "Alpha and Omega, on the days we feel powerless to change the world with Christ’s love, help us to see that you have the power and might to make those changes a reality. Amen."]], "345": [["dateVerse", "Thursday, December 11", "Psalm 141:5-10", "Micah 1- 3:7", "Revelation 12:7-18"], ["watchD", "I have loved you with an everlasting love; therefore I have continued my faithfulness to you. Jeremiah 31:3"], ["docT", "For God so loved the world that he gave his only Son, so that everyone who believes in him may not perish but may have eternal life. John 3:16"], ["prayer", "God of love, may we pay attention to how much you love us and love this world. Call us to bear witness to the eternal life that you bring to the world. Amen."]], "346": [["dateVerse", "Friday, December 12", "Psalm 142", "Micah 3:8-5:15", "Revelation 13:1-10"], ["watchD", "O that you would tear open the heavens and come down. Isaiah 64:1"], ["docT", "The angel said to Mary, “You will conceive in your womb and bear a son, and you will name him Jesus. He will be great and will be called the Son of the Most High.” Luke 1:31-32"], ["prayer", "Dear Jesus, call us to see that your heavenly father flung wide the gates of heaven to bring you to us so that we would witness a perfect example of how to serve humanity. Amen."]], "347": [["dateVerse", "Saturday, December 13", "Psalm 143:1-6", "Micah 6,7", "Revelation 13:11-14:5"], ["watchD", "The days are surely coming, says the Lord, when the city shall be rebuilt for the Lord. Jeremiah 31:38"], ["docT", "And I saw the holy city, the new Jerusalem, coming down out of heaven from God, prepared as a bride adorned for her husband. And I heard a loud voice from the throne saying, “See, the home of God is among mortals.” Revelation 21:2-3"], ["prayer", "Gracious God, help us to shape our cities and our neighborhoods by the barometer of Christ’s love. Help us to judge our communities not on the basis of material possessions, but from a place of selfless giving. Amen."]], "348": [["info", "Third Sunday of Advent"], ["watchO", "Watchword for the week — Be strong, do not fear! Here is your God. Isaiah 35:4"], ["dateVerse", "Sunday, December 14", "Isaiah 35:1-10", "Psalm 146:5-10", "James 5:7-10", "Matthew 11:2-11"], ["watchD", "To you, O Lord, I call; my rock, do not refuse to hear me. Psalm 28:1"], ["docT", "The centurion asked Jesus, “But only speak the word, and let my servant be healed.” Luke 7:7"], ["prayer", "Holy Ghost, help us to listen with the faith of the centurion. May we be reminded of how much you can accomplish with even a faint whisper of compassion. Amen."]], "349": [["dateVerse", "Monday, December 15", "Psalm 143:7-12", "Nahum 1,2", "Revelation 14:6-16"], ["watchD", "He was wounded for our transgressions, crushed for our iniquities. Isaiah 53:5"], ["docT", "God, who did not withhold his own Son but gave him up for all of us, how will he not with him also give us everything else? Romans 8:32"], ["prayer", "Dear Jesus, may we remember that you were crucified to remove the burden of sin from the world. May our thanks be moved to tears when we see our reflection in your wounds. Amen."]], "350": [["dateVerse", "Tuesday, December 16", "Psalm 144:1-4", "Nahum 3", "Habakkuk 1", "Revelation 14:17-15:8"], ["watchD", "For God alone my soul waits in silence, for my hope is from him. Psalm 62:5"], ["docT", "We wait for the blessed hope and the manifestation of the glory of our great God and Savior, Jesus Christ. Titus 2:13"], ["prayer", "Prince of peace, waiting for you to come this Christmas season is filled with anxiety. Help us to see that waiting can be a productive space to occupy if we use that time to serve the needs of our world. Amen."]], "351": [["dateVerse", "Wednesday, December 17", "Psalm 144:5-8", "Habakkuk 2,3", "Revelation 16:1-11"], ["watchD", "Woe to those who call evil good and good evil, who put darkness for light and light for darkness. Isaiah 5:20"], ["docT", "Do not be overcome by evil, but overcome evil with good. Romans 12:21"], ["prayer", "Lord of light, help us to stand for justice and righteousness in our world. May our loyalty be to your voice and wisdom and not those who seek power to abuse others. Amen."]], "352": [["dateVerse", "Thursday, December 18", "Psalm 144:9-15", "Zephaniah 1,2", "Revelation 16:12-21"], ["watchD", "Reform your ways and your actions, and I will let you live in this place. Jeremiah 7:3 NIV"], ["docT", "For this very reason, you must make every effort to support your faith with excellence, and excellence with knowledge, and knowledge with self-control, and self-control with endurance, and endurance with godliness, and godliness with mutual affection, and mutual affection with love. 2 Peter 1:5-7"], ["prayer", "Abba, bless us with strength and courage to change our ways when they block us from loving our Lord and our neighbor. It is never too late to make a positive change for God. Amen."]], "353": [["dateVerse", "Friday, December 19", "Psalm 145:1-7", "Zephaniah 3", "Haggai 1", "Revelation 17:1-8"], ["watchD", "There is no Rock like our God. 1 Samuel 2:2"], ["docT", "Be strong in the Lord and in the strength of his power. Ephesians 6:10"], ["prayer", "Heavenly Father, give us the strength to survive these dark days. Help us to rest our hope on your light which waits for us on the horizon. Amen."]], "354": [["dateVerse", "Saturday, December 20", "Psalm 145:8-16", "Haggai 2", "Revelation 17:9-18"], ["watchD", "Joseph reassured his brothers, speaking kindly to them. Genesis 50:21"], ["docT", "Be kind to one another, tenderhearted, forgiving one another, as God in Christ has forgiven you. Ephesians 4:32"], ["prayer", "Holy Spirit, help our faith be practical. Equip us to carry out small acts of kindness and forgiveness for our families, friends, and community. Amen."]], "355": [["info", "Fourth Sunday of Advent"], ["watchO", "Watchword for the week — Restore us, O Lord God of hosts; let your face shine, that we may be saved. Psalm 80:19"], ["dateVerse", "Sunday, December 21", "Isaiah 7:10-16", "Psalm 80:1-7,10-14", "Romans 1:1-7", "Matthew 1:18-25"], ["watchD", "All these things my hand has made, so all these things are mine, says the Lord. But this is the one to whom I will look, to the humble and contrite in spirit who trembles at my word. Isaiah 66:2"], ["docT", "When the goodness and loving kindness of God our Savior appeared, he saved us, not because of any works of righteousness that we had done, but according to his mercy. Titus 3:4-5"], ["prayer", "Merciful Savior, help us to remember that as we wait impatiently for the Christmas gifts we will receive, we already receive the blessed gift of your mercy every single day. Amen."]], "356": [["dateVerse", "Monday, December 22", "Psalm 145:17-21", "Zechariah 1,2", "Revelation 18:1-10"], ["watchD", "Alas for you who heap up what is not your own! How long will you load yourselves with goods taken in pledge? Habakkuk 2:6"], ["docT", "Jesus said, “Whoever is faithful in a very little is faithful also in much, and whoever is dishonest in a very little is dishonest also in much.” Luke 16:10"], ["prayer", "Dear Jesus, help us to be faithful to our Christian witness in our lives and in our world. May we honor the pledges we have made to you. Amen."]], "357": [["dateVerse", "Tuesday, December 23", "Psalm 146", "Zechariah 3-5", "Revelation 18:11-24"], ["watchD", "Take courage, all you people of the land, says the Lord; work, for I am with you. Haggai 2:4"], ["docT", "The one who sows sparingly will also reap sparingly, and the one who sows bountifully will also reap bountifully. 2 Corinthians 9:6"], ["prayer", "Dear Jesus, help us to see that when we sow seeds of faith, hope, and love around us, we can see your reflection in all our labors of love. Amen."]], "358": [["info", "Christmas Eve "], ["dateVerse", "Wednesday, December 24", "Psalm 147:1-6", "Zechariah 6,7", "Revelation 19:1-8"], ["watchD", "Righteousness and justice are the foundation of your throne; steadfast love and faithfulness go before you. Psalm 89:14"], ["docT", "The word became flesh and lived among us, and we have seen his glory, the glory as of a father’s only son, full of grace and truth. John 1:14"], ["prayer", "Prince of peace, help us to pay homage to your glorious birth. May we sing the glories of your justice and righteousness in our hearts tonight. Amen."]], "359": [["info", "Nativity of the Lord (Christmas Day)"], ["watchO", "Watchword for Christmas Day — The law was given through Moses; grace and truth came through Jesus Christ. John 1:17"], ["dateVerse", "Thursday, December 25", "Psalm 147:7-14", "Zechariah 8,9", "Revelation 19:9-21"], ["watchD", "Restore us to yourself, O Lord, that we may be restored; renew our days as of old. Lamentations 5:21"], ["docT", "To you is born this day in the city of David a Savior, who is the Messiah, the Lord. Luke 2:11"], ["prayer", "Christ Child, help us to see you as the greatest gift that has ever been given to the world. May we rejoice in the glory of God’s greatest gift. Amen."]], "360": [["dateVerse", "Friday, December 26", "Psalm 147:15-20", "Zechariah 10,11", "Revelation 20:1-10"], ["watchD", "The commandment of the Lord is clear, enlightening the eyes. Psalm 19:8"], ["docT", "And all who sat in the council looked intently at Stephen, and they saw that his face was like the face of an angel. Acts 6:15"], ["prayer", "Dear Jesus, open the eyes of our hearts to share your compassion, mercy, and unconditional love with the world. Amen."]], "361": [["dateVerse", "Saturday, December 27", "Psalm 148:1-6", "Zechariah 12-13:6", "Revelation 20:11-21:8"], ["watchD", "I will come praising the mighty deeds of the Lord God; I will praise your righteousness, yours alone. Psalm 71:16"], ["docT", "We proclaim to those who are the called, both Jews and Greeks, Christ the power of God and the wisdom of God. 1 Corinthians 1:23,24"], ["prayer", "Almighty God, help us to see that your hands are extended to the entire world. We are blessed that all children of God can claim you as a loving presence. Amen."]], "362": [["info", "First Sunday after Christmas Day"], ["watchO", "Watchword for the week — I will recount the gracious deeds of the Lord, the praiseworthy acts of the Lord, because of all that the Lord has done for us. Isaiah 63:7"], ["dateVerse", "Sunday, December 28", "Isaiah 63:7-9", "Psalm 148", "Hebrews 2:10-18", "Matthew 2:13-23"], ["watchD", "How very good and pleasant it is when kindred live together in unity! For there the Lord ordained his blessing, life forevermore. Psalm 133:1,3"], ["docT", "Glory to God in the highest heaven, and on earth peace among those whom he favors! Luke 2:14"], ["prayer", "O heavenly Peace, call us to live lives dedicated to making your kindness seen throughout our communities. May we be your ambassadors of peace in the world around us. Amen."]], "363": [["dateVerse", "Monday, December 29", "Psalm 148:7-14", "Zechariah 13:7-14:21", "Revelation 21:9-21"], ["watchD", "But you, O Lord, do not be far away! O my help, come quickly to my aid! Psalm 22:19"], ["docT", "The power of the Lord was with Jesus to heal. Luke 5:17"], ["prayer", "Great Physician, help us to have the humility to come to you for true healing. Let us trust you to be the balm for all the emotional, physical, and spiritual pain we carry. Amen."]], "364": [["dateVerse", "Tuesday, December 30", "Psalm 149", "Malachi 1,2", "Revelation 21:22-22:7"], ["watchD", "The Lord said to Moses, “You have found favor in my sight, and I know you by name.” Exodus 33:17"], ["docT", "God’s firm foundation stands, bearing this inscription: “The Lord knows those who are his.” 2 Timothy 2:19"], ["prayer", "Dear Jesus, we are grateful for a personal relationship with you. We know that you care about every thought we have, even before it is formed. May we strive to know you just as intimately. Amen."]], "365": [["dateVerse", "Wednesday, December 31", "Psalm 150", "Malachi 3,4", "Revelation 22:8-21"], ["watchD", "The Lord grants peace within your borders. Psalm 147:14"], ["docT", "Blessed are the peacemakers, for they will be called children of God. Matthew 5:9"], ["prayer", "Prince of peace, call us to be your peacemakers. May the peace we share with this world reflect the peace you give to us each day. Amen."]]}